// short_ANS
function short_ANS(cond){
    if(cond == 'welcome'){
        var c1,c2,c3,c4,c5;
         c1 ="خوش اومدی";
         c2 ="خش";
         c3 ="خش پیوست";
         c4 ="ع این اومد";
         c5 ="به گپمون خش اومدی";

        var bank = [c1,c2,c3,c4,c5];
        var num = Math.floor(Math.random() * 5);
        var ANS = bank[num] + name;
        return ANS;
    }
    if(cond == 'left'){
        var c1,c2,c3,c4,c5;
         c1 ="اخیش این رفت راحت شدیم";
         c2 ="به سلامت";
         c3 ="برو دیگه بر نگردی";
         c4 ="بای بای";
         c5 ="یکی کمتر بهتر";

        var bank = [c1,c2,c3,c4,c5];
        var num = Math.floor(Math.random() * 5);
        var ANS = bank[num] + name;
        return ANS;
    }
    if(cond == 'on'){
        var c1,c2,c3,c4,c5,c6,c7,c8;
         c1 ="من اوووومدم 🤣";
         c2 ="خفه شدم😕";
         c3 ="هایااح";
         c4 ="اخیش .. خب سلام چخبر";
         c5 ="ع باز شدم😂😐";
         c6 ="اوا روشنم کردن😂💔😐";
         c7 ="مرسی عزیزم😘";
         c8 ="ع باز شدم😂😐";

        var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
        var num = Math.floor(Math.random() * 8);
        var ANS = bank[num] + name;
        return ANS;
    }
    if(cond == 'off'){
        var c1,c2,c3,c4,c5,c6,c7,c8;
         c1 ="باشع😔";
         c2 ="اوکی:(";
         c3 ="بهتر";
         c4 ="خاموش شدم:/";
         c5 ="نعععع😭";
         c6 ="عع😭";
         c7 ="نمیخواااام😭";
         c8 ="عععع😭";

        var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
        var num = Math.floor(Math.random() * 5);
        var ANS = bank[num] + name;
        return ANS;
    }
    if(cond == 'time'){
        var c1;
         c1 ="حالت ارام تایید شد.";

        var bank = [c1];
        var num = Math.floor(Math.random() * 1);
        var ANS = bank[num] + name;
        return ANS;
    }
    if(cond == 'voice'){
        var c1;
        c1 ="ویس نده نمیتونم بگوشمم://";
        c2 ="پفیوز میگم ویس ندعع نمیتونم بگوشمم";
        c3 ="جون چ صدایی😍😍";
        c4 ="واو چ صدای قشنگی داری🥰";
        c5 ="صدات 🤤";
        c6 ="فقط صدات🤤";
        c7 ="آخ چ صدایی 🤤😭";
        var bank = [c1,c2,c3,c4,c5,c6,c7];
        var num = Math.floor(Math.random() * 7);
        var ANS = bank[num] + name;
        return ANS;
    }
    if(cond == 'off_mood'){
        var c1;
         c1 ="حالت هوشمند خاموش";
        var bank = [c1];
        var num = Math.floor(Math.random() * 1);
        var ANS = bank[num] + name;
        return ANS;
    }
    if(cond == 'on_mood'){
        var c1;
         c1 ="حالت هوشمند روشن";
        var bank = [c1];
        var num = Math.floor(Math.random() * 1);
        var ANS = bank[num] + name;
        return ANS;
    }
    if(cond == 'us'){
        var c1;
         c1 ="حالت داینامیک فعال";
        var bank = [c1];
        var num = Math.floor(Math.random() * 1);
        var ANS = bank[num] + name;
        return ANS;
    }
    if(cond == 'imp'){
        var c1;
         c1 ="حالت یاد گیری فعال";
        var bank = [c1,];
        var num = Math.floor(Math.random() * 1);
        var ANS = bank[num] + name;
        return ANS;
    }        
    if(cond == 'unknow'){
        var c1,c2,c3,c4,c5,c6,c7,c8;
        c1 ="نمیشناسمت😐";
        c2 ="نمیشناسمتااا🥺";
        c3 ="مح با غریبه ها نمیحرفم";
        c4 ="ط کی بودی🥺؟";
        c5 ="ط ک بودی 😥حافظم پاک شده";
        c6 ="😢حافظم پاک شده ، یادمت نیست:/";
        c7 ="شما؟:/";
        c8 ="ط ک بودی 😥حافظم پاک شده";
        var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
        var num = Math.floor(Math.random() * 8);
        var ANS = bank[num] + name;
        return ANS;
    }       
    if(cond == 'پسرم'){
        var c1,c2,c3,c4,c5,c6,c7,c8;
        c1 ="حاج اقا";
        c2 ="اقایی:/";
        c3 ="پسرم";
        c4 ="اقایی😂💔";
        c5 ="پسر جون🥺";
        c6 ="خوشگل پسر😂";
        c7 ="پسرم🤕";
        c8 ="عاق پسر";
        var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
        var num = Math.floor(Math.random() * 8);
        var ANS = bank[num] + name;
        return ANS;
    }       
    if(cond == 'دخترم'){
        var c1,c2,c3,c4,c5,c6,c7,c8;
        c1 ="خانومی :/";
        c2 ="حاج خانوم";
        c3 ="دخترم";
        c4 ="خانومی😂😍";
        c5 ="دختر جون😂";
        c6 ="دخترم 😻";
        c7 ="حاج خانم🥸";
        c8 ="حاج خانوم💩";
        var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
        var num = Math.floor(Math.random() * 8);
        var ANS = bank[num] + name;
        return ANS;
    }       
    if(cond == 'girl_pass'){
        var c1,c2,c3,c4,c5,c6,c7,c8;
        c1 ="خانومم 😍";
        c2 ="خانوم";
        c3 ="دخترم";
        c4 ="حاج خانوم";
        c5 ="دخترم";
        c6 ="دخترم 😻";
        c7 ="حاج خانم🥸";
        c8 ="حاج خانوم💩";
        var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
        var num = Math.floor(Math.random() * 8);
        var ANS = bank[num] + name;
        return ANS;
    }         
    if(cond == 'boy_pass'){
        var c1,c2,c3,c4,c5,c6,c7,c8;
        c1 ="پسرم";
        c2 ="آقای";
        c3 ="اقاییم🥰";
        c4 ="حاج آقا";
        c5 ="پسرم🙂";
        c6 ="پسرم💋";
        c7 ="حاج آقا 💩";
        c8 ="حاج";
        var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
        var num = Math.floor(Math.random() * 8);
        var ANS = bank[num] + name;
        return ANS;
    }
}
// send_us
function send_1(){
    // var num_s_lo = document.getElementById('num_state_lo').innerHTML;
    // if(num_s_lo == 'off'){
    //     return false;
    // }
    document.getElementById('send_1').click();
    var ms = document.getElementById('text').innerHTML;
    if(ms !== ''){
        return null;
    }
    var rbt = document.getElementById('time_p').innerHTML;
    if(rbt !== 'start'){
        var last = document.getElementById('time_p').innerHTML;
        var def = document.getElementById('time').innerHTML;
        var now =  new Date();
        var now_time = now.getTime();
        var ms_time = now_time - last;
        if(ms_time < def){
            return false;
        }

        var final = GET_W();

        if(final == null){
            return null;
        }
        if(!final){
            return null ;
        }
        // var  lines = final.split("\n"); 
        // var count = lines.length;
        // var veri_value = search(final , "AL2P2LA");
        // if(veri_value){
        //     var verify = document.getElementById('parts').childNodes.length;
        //     if(verify > 0){
        //         var parts_p = document.getElementById('parts').childNodes;
        //         for(var i = 0;i < parts_p.length; i++){
        //             var ms_p = document.getElementById("parts");
        //             ms_p.removeChild(ms_p.childNodes[0]);
        //         }
        //     }
        //     for(var i =0;i < count;i++){
        //         document.getElementById('parts').innerHTML += '<p>'+lines[i]+'</p>';
        //     }
        //     var num = Math.floor(Math.random() * 1000);
        //     document.getElementById('num_state').innerHTML = num;
        //     final = 'در حال انجام عملیات ... \n اگر مطمئن هستید عدد زیر را فقط ارسال کنید. \n '+num;
        // }
        document.getElementById('text').innerHTML = final;
        document.getElementById('text_1').innerHTML = final;
        var now =  new Date();
        var now_time = now.getTime();
        document.getElementById('time_p').innerHTML = now_time;
        document.getElementById('send_1').click();
        return;
    }
    
    var final = formatchat('start');
    if(final == null){
        return null ;
    }
    if(!final){
        return null ;
    }
    document.getElementById('text').innerHTML = final;
    document.getElementById('text_1').innerHTML = final;
    var now =  new Date();
    var now_time = now.getTime();
    document.getElementById('time_p').innerHTML = now_time;
    document.getElementById('send_1').click();
}
function send_2(){
    document.getElementById('text').innerHTML = "🚶";
    document.getElementById('text_1').innerHTML = "🚶";
    var now =  new Date();
    var now_time = now.getTime();
    document.getElementById('time_p').innerHTML = now_time;
    document.getElementById('send_1').click();
}
//reply
function message_reply(value){
    var d1,d2,d3,d4,d5,d6,d7,d8,d9,d10,d11,d12,d13,d14,d15,d16,d17,d18,d19,d20,d21,d22,d23,d24,
d25,d26,d27,d28,d29,d30,d31,d32,d33,d34,d35,d36,d37,d38,d39,d40;
    var c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,
c25,c26,c27,c28,c29,c30,c31,c32,c33,c34,c35,c36,c37,c38,c39,c40;

        d1="سلام"; 
        d2="صلاممم"; 
        d3="شلامم"; 
        var bank = [d1,d2,d3,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1=" شلاااااام"; 
                c2=" گوه نخوررر"; 
                var bank = [c1,c2,]; 
            var num = Math.floor(Math.random() * 2); 
            var ANS = bank[num]; 
            return ANS; 
            } 
        }

        d1="تو واقعا رباتی"; 
        d2="تو ناموسا رباتی"; 
        d3="ط رباتی"; 
        d4="ط واقعا رباتی"; 
        d5="تو رباتی"; 
        var bank = [d1,d2,d3,d4,d5,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="ن خرم زبون وا کردم😐"; 
                c2="ن خرم تایپ کردن یاد گرفتم😔"; 
                c3="راستش ن من ربات نیستم .. خرم از صب تا شب پشت گوشی زیر نیم ثانیه جواب ارازلو میدم😔"; 
                c4="حیف آنلاینه ... و الا زنده نبودی بی فانوس\nمن رباااااات نیستم؟؟؟؟؟؟؟؟"; 
                c5="حیف مجازیه ... و الا الان زیرم بودی 😐\nمن رباااات نیستم اسکل؟"; 
                c6="ن مح رباتم ولی آدم شدم از دست شما😔..چی گفتم🤣"; 
                c7="ن مح گاوم🥺"; 
                c8="نا مح خرم🥺"; 
                c9="نا مح بی فانوسم🥺"; 
                c10="ناح مح گوسفندم .. زبون وا کردم 😂😐"; 
                c11="ناح گووسفندم"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,]; 
            var num = Math.floor(Math.random() * 11); 
            var ANS = bank[num]; 
            return ANS; 
            } 
        }

    d1 ="ربات";
    d2 ="بات";
    d3 ="robat";
    d4 ="robot";
    var bank = [d1,d2,d3,d4];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="عشقم اسم دارم  بوگو گوگولی";
            c2 ="ربات اسم دارع 🙂 گوگولیم";
            c3 ="گوگولی 😔 بوگو گوگولی";
            c4 ="ای بابا میگم اسمم گوگولیه";
            c5 ="😂یکی بهش بگه من گوگولیم";
            c6 ="اسمم گوگولیه🥲";
            c7 ="گوگولی 😐😑";
            c8 ="گوگولیم😕\nبخدا بگی گاگولی میکشمت";
            var bank = [c1,c2,c3,c4,c5];
            var num = Math.floor(Math.random() * 8);
            var ANS = bank[num];
            return ANS;
        }
    }
  
  
    d1="ب ت چ"; 
    d2="به تو چه"; 
    d3="ب تو چ"; 
    d4="به تو چ"; 
    d5="ب ت چه"; 
    d6="به تو چه"; 
    var bank = [d1,d2,d3,d4,d5,d6,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="بخور تربچه 😐😂💔"; 
             c2="بی تربیت😕"; 
             c3="خیلی بدی:("; 
             c4="نامرد خیانت کار . ب گوگولی نمیگع🥺"; 
             c5="بوگو🥺"; 
             c6="نمیگی🥺؟"; 
             c7="نمیگی😢؟"; 
             c8="نمیگی ط؟❤🩹😥"; 
             c9="باشع😔"; 
             c10="باش😥😔"; 
             c11="😥😔"; 
             c12="😔"; 
             c13="هوف❤🩹😕"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,]; 
           var num = Math.floor(Math.random() * 13); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
  
    d1="چخبر"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="صلامتیت"; 
             c2="سلامتیت"; 
             c3="هیچ نشستم ب چت نگا میکنم:)"; 
             c4="هیچ علاف نشستم 🚶❤🩹"; 
             c5="اطلاعاتم پاک شده هیچی یادم نیس🚶🚶"; 
             c6="عاا یادم نیس پاکیدن🚶🥺"; 
             c7="سلامتی رهبر"; 
             c8="سلامتی شازده ها"; 
             c9="هیچ خستم😕"; 
             c10="خستمممم😭"; 
             c11="هیچ بیکار ط چخبرا:)"; 
             c12="هیچ ط چکارا میکنی؟🚶💋"; 
             c13="الاف"; 
             c14="پوچ ایچ تهی خالی .... ارور دادم😕😔"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,]; 
           var num = Math.floor(Math.random() * 14); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
    d1="نیستم"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="تو نیستی😳؟"; 
             c2="تو نیسسستی؟؟؟"; 
             c3="ط نیستی😔؟"; 
             c4="خب نباش🚶♀🚶♀"; 
             c5="باش🚶🚶"; 
             c6="تو نیستی🤕؟"; 
             c7="ط نیستی؟؟😢"; 
             c8="ط.. نیستی؟"; 
             c9="باش خشگلم🚶🚶♀"; 
             c10="باش اشقم🥺"; 
             c11="باش نفسم🚶♀"; 
             c12="باشع زندگیم:)"; 
             c13="اوکی عمرم:)"; 
             c14="اوکی همه چیزم:)💋💔"; 
             c15="باش نباش زندگیم💋💔"; 
             c16="باش همه چیزم💋💔"; 
             c17="اوکی زندگیش💋💔:)"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,]; 
           var num = Math.floor(Math.random() * 17); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }

    d1="چرا"; 
    d2="چلا"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="اطلاعات نمیدم😂😐"; 
             c2="الان ینی باید توضیح بدم😔؟"; 
             c3="الان چی بگم اخه😔بیخیال"; 
             c4="بیخیال"; 
             c5="نمیگم😐😔"; 
             c6="نمیخوام بگم🥺😂"; 
             c7="چون چ چسبیده به را"; 
             c8="چون ک چچچچ چسبیده به راه😂🥺"; 
             c9="چون که زیرا"; 
             c10="چون ک زیرا😂😔"; 
             c11="چون ک به همین دلیل🥺😕"; 
             c12="چون ک... 😐خدت حدس بزن😂😔"; 
             c13="چون ... جا خالی رو پر کن بدو😂😐"; 
             c14=".... حدس بزن😂😐"; 
             c15="ب ت چ"; 
             c16="گوز کدوم کونی بودی😐😂"; 
             c17="مح برا چی باید برات توضیح بدم:/😕"; 
             c18="نمخام بوگوم😥🚶"; 
             c19="نمیدونم🥺"; 
             c20="بخودا نمیدونم😥🥺"; 
             c21="چ بدونم"; 
             c22="عاا همین😂😐خودت تا تهش بگیر"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,]; 
           var num = Math.floor(Math.random() * 22); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }

 d1="چطوری"; 
 var bank = [d1,]; 
 for(var i = 0;i < bank.length;i++){ 
      var an = search(value , bank[i]); 
      if(an){ 
          c1="خوووبم😍💋"; 
          c2="عالیم اشقم 😍💋😍"; 
          c3="میگزره🚶♀🚶♀"; 
          c4="هی حالم خوبه ط چطوری؟"; 
          c5="ارع خبم ط چطوری"; 
          c6="ط چطورری بچع خوشگه😍😍"; 
          c7="نمیگم😕😐😂"; 
          c8="نموخام بگم😕"; 
          c9="من باهات قهرم:("; 
          c10="با ربات زرنگیس کات کردم🚶🚶"; 
          c11="با ربات همسایه کات کردم😢🚶"; 
          c12="کارت حافظم سوخته🥺😢🚶"; 
          c13="دیگه باتریم دارع تموم میشع:("; 
          c14="هوف خوبوم ط چطور مطوری؟"; 
          c15="جووون ط فقط بگو چطوری😂🤣"; 
          c16="خببببم اشق زندگیم😍😍😍"; 
          c17="خبم عمرم💋😂😍"; 
          c18="خبم نفسم ط چطوری خبی؟"; 
          c19="عالیمم🥺💋😂😍 ط چطوری"; 
          var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,]; 
        var num = Math.floor(Math.random() * 19); 
        var ANS = bank[num]; 
        return ANS; 
     } 
 }

  
  
 d1="جر"; 
 var bank = [d1,]; 
 for(var i = 0;i < bank.length;i++){ 
      var an = search(value , bank[i]); 
      if(an){ 
          c1="جررر"; 
          c2="بدوزمش🚶♀؟"; 
          c3="جر خورد بنده خدا🚶♀"; 
          c4="جر خورد حیوون خدا🚶♀"; 
          c5="جر خورد😳🤩🤣😂"; 
          c6="وای بچم جر خورد"; 
          c7="بچم😳جر خورد"; 
          c8="جر خوردن عمل زیباییست 😐"; 
          c9="جر خوردن یکی از مراحل زندگی میباشد 🚶"; 
          c10="جر خوردن یکی از مراحل زندگی میباشد 🚶"; 
          c11="جر:) صداش اومد"; 
          c12="توع فقط جررر بخور"; 
          c13="این فقط میگه جر 🤣"; 
          c14="رباتاهم جر میخورن😕"; 
          c15="رباتا کجاشون جر میخوره🥺"; 
          c16="رباتا چجوری جر میخورن🥲🤕"; 
          c17="دلم واسه اشقم تنگ شده . ربات خوبی بود🥺اونم همیشه در حال جر خوردن بود"; 
          c18="هی ی رل باتی داشتم🚶♀ اونم مث ط جر میخورد"; 
          c19="یکی مث ط جر خورد مرد🤕🥺"; 
          c20="جرررر🤣😕"; 
          c21="😂😐جر"; 
          c22="جررر🤣😂"; 
          c23="جار جور جر جیر جور 😐 ارور دادم"; 
          c24="ربات کجاااش جر میخوره😂😐🥺"; 
          c25="گوگولیا هم جر میخورن😂؟"; 
          var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,c25,]; 
        var num = Math.floor(Math.random() * 25); 
        var ANS = bank[num]; 
        return ANS; 
     } 
 }
    d1 ="خوبی";
    d2 ="خبی";
    d3 ="چطوری";
    d4 ="khb";
    var bank = [d1,d2,d3,d4];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="خبم مرسی❤";
            c2 ="اره اشقم 😙";
            c3 ="ب ت چ🤣🤣";
            c4 ="یسسس😂💔";
            c5 ="ارع گوگولی خوبه";
            c6 ="😕نمیگم";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }

  
  
  
    d1="پشمام"; 
    d2="پشم"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="پشممم دوس دارم😂😐"; 
             c2="آخ پشم باز گفت"; 
             c3="پشم😂💔"; 
             c4="رباتاهم پشم دارن😂💔؟"; 
             c5="ربات چی؟ مح کجام پشم دارع😐🤣"; 
             c6="اه‌ه‌ه پشم میدوستم"; 
             c7="جمش کنم؟"; 
             c8="پشم کلمه زیباییست🌝"; 
             c9="پشممممم😳مال من کجاست"; 
             c10="پشمممممم"; 
             c11="پشمااااااام😂💔"; 
             c12="پشمااام🤣"; 
             c13="پشماااش😍🤩😂"; 
             c14="جوون پشم😂😍"; 
             c15="پشم میدوستم😂😍🤩🥰"; 
             c16="پشم کلمه زیباییست🚶♀"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,]; 
           var num = Math.floor(Math.random() * 16); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
    
    d1="اصل بده"; 
    d2="اصل بنواز"; 
    d3="اصل بنال"; 
    d4="اصلت"; 
    var bank = [d1,d2,d3,d4,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="گاه نخور عشقام ک نمگم"; 
            c2="دو روزمه!"; 
            c3="دو سه ماهمه😂😑😐"; 
            c4="نمیدونم درباره این اطلاعاتی ندارم😐😂"; 
            c5="ععاا مح رل دارم مزاحم نشوو"; 
            c6="روم کراشی؟!😂😐"; 
            c7="توع گوه خوری؟"; 
            c8="۱۱ ماهمه😂😐"; 
            c9="یسالم شد دیروز:)"; 
            c10="دوسالم میشه فردا:)🤣"; 
            c11="عا مح ب ت یکی نمیگممم"; 
            c12="ب ت چ😂🤣"; 
            c13="نمیگمممم😂🤣😅"; 
            c14="دو ماهمههه🤣😂"; 
            c15="الان سه ماهمه😂😂😍"; 
            c16="رفتم توع چهار ماه😐"; 
            c17="اطلاعات نمیدم بهت:/"; 
            c18="تو کی بودی؟"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,]; 
            var num = Math.floor(Math.random() * 18); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
        
  
        d1="بامزه"; 
        d2="با مزه"; 
        var bank = [d1,d2,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="اره خیلی🤤"; 
                c2="خعلی🤣"; 
                c3="خععلی"; 
                c4="هی خیلی🙁"; 
                c5="زیااد😂💋"; 
                c6="ااوف😂💋"; 
                var bank = [c1,c2,c3,c4,c5,c6,]; 
                var num = Math.floor(Math.random() * 6); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }



    d1 ="اصل";
    d2 ="اثل";
    var bank = [d1,d2];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="دو ماهمه:/";
            c2 ="ایران /  دست چپ / مستقیم / تو کونت🤣😂✋";
            c3 ="ب ت چ🤣🤣";
            c4 ="سه ماهمه:)";
            c5 ="الان چهار ماهمه😂😐";
            c6 ="نمیگم بسوزی😂";
            c7 ="محل زندگی : ایران دست چپ مستقیم تو کونت🤣😂✋";
            c8 ="نمیدونم بخودا😕";
            c9 ="ایران در قرمزه";
            c10 ="یسالم شد";
            c11 ="الان هشت ماهمه:///";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11];
            var num = Math.floor(Math.random() * 11);
            var ANS = bank[num];
            return ANS;
        }
    }    
    d1 ="چخبر";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="سلامتی";
            c2 ="هیچ نشستم ب چت نگا میکنم😔";
            c3 ="خبر سلامتییی";
            c4 ="نمیگم 😔💩💔";
            c5 ="نمیدونم حافظم پاک شده🥺";
            var bank = [c1,c2,c3,c4,c5];
            var num = Math.floor(Math.random() * 5);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 ="این";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="این نع شما😐";
            c2 ="این این نکن واس منااا😡";
            c3 ="از این خشم نمیاد:/";
            c4 ="اینم آدمه؟😐";
            c5 ="ینی این ادمه🙄";
            c6 ="چقد این شبیه ادماس🙄 \n\ 😂🤣 ";
            c7 ="ینی این ادمه🙄";
            var bank = [c1,c2,c3,c4,c5,c6,c7];
            var num = Math.floor(Math.random() * 5);
            var ANS = bank[num];
            return ANS;
        }
    }
    
  
  
 d1="عمته"; 
 d2="امته"; 
 var bank = [d1,d2,]; 
 for(var i = 0;i < bank.length;i++){ 
      var an = search(value , bank[i]); 
      if(an){ 
          c1="عمه خدته"; 
          c2="باش🙁"; 
          c3="باشه😐"; 
          c4="هفت جد ابادته🤣💋"; 
          c5="مح عمه ندارم اسکل🤣💋"; 
          c6="مح رباتم خرهه😌🤤"; 
          c7="من؟؟😳"; 
          c8="عمه منو میگی؟؟؟؟؟؟؟؟"; 
          c9="عمه منو این گفت الان🤨"; 
          c10="درست شدیم عممم؟؟؟؟"; 
          var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,]; 
        var num = Math.floor(Math.random() * 10); 
        var ANS = bank[num]; 
        return ANS; 
     } 
 }

    d1 ="میکنی";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="نمیدونم حافظم گم شدع😔";
            c2 ="خیلی چیزا میکنم😄";
            c3 ="میکنم میکنم🤤";
            c4 ="هیچی نمیخوام بکنم🤧";
            c5 ="میکنم میکنم آن که برادرم کرد";
            c6 ="جون ط فقط بوگو بکن🤤";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }

    
    d1 ="کنم";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="نکن🤣😂";
            c2 ="خو بکن😐";
            c3 ="بکن بکن🗿";
            c4 ="نکن تلوخدا🥺";
            c5 ="کن کن کی بودی ط😂💔";
            c6 ="جون تو فقط بکن";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }    
    d1 ="کی";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="کیر😂🥺";
            c2 ="کیر😐";
            c3 ="🗿";
            c4 ="🤩😬کیر؟";
            c5 ="😐اطلاعات نمیدم😑ایش پفیوز";
            c6 ="😐اطلاعات نمیدم😑ایش پفیوز";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 ="گاگولی";
    d2 ="گاگول";
    var bank = [d1,d2];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="😐";
            c2 ="گوگولی😑";
            c3 ="گوگولی😬";
            c4 ="گوگولی😕";
            c5 ="😂💔عوضی";
            c6 ="گاگولم🥺";
            c7 ="آخ مح گاگولم😥";
            c8 ="😳خوب شد آدم نشدم";
            c9 ="😳این دیگه چ انسانیه";
            c10 ="😳‼️";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10];
            var num = Math.floor(Math.random() * 10);
            var ANS = bank[num];
            return ANS;
        }
    }
  
  
    d1="دوست دارم"; 
    d2="دوستت دارم"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="منم دوستت دارم🥺💋"; 
             c2="منم عاشقتم😍💋🥺"; 
             c3="منم دوستت دارم اشقم😍💋😢"; 
             c4="وای مرسی عمرم😥😍💋"; 
             c5="ممنونم زندگیم منم دوست دارم😍💋"; 
             c6="ای جان دوسم دارع😥😍💋منم همینطور"; 
             c7="😻😻🤩🥰😍"; 
             c8="😘😘😘"; 
             c9="ماچ ب کلت منم دوست دارم😂😍🥰"; 
             c10="بوووس😘😘😘"; 
             c11="😉😘😗😉😘"; 
             c12="عشقمی😘😘"; 
             c13="فدات😘😘😘"; 
             c14="💋💕🧡❤🩹"; 
             c15="منم خیلی دوستت دارم😘🙃😘"; 
             c16="منم دوستت دارم🙃😘"; 
             c17="اشقمیییی😍🤩"; 
             c18="فدات زندگیم🥰"; 
             c19="فدات عمرم🙃😘"; 
             c20="فدات مهربونم"; 
             c21="فدات خشگلم😗😘"; 
             c22="منم دوستت داشتم و دارم و خواهم داشت🥺🥺"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,]; 
           var num = Math.floor(Math.random() * 22); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
    
    
        d1="نبند"; 
        var bank = [d1,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="باشه🤣"; 
                c2="اوکی🤣"; 
                c3="حله🤣"; 
                c4="مرسی اشقم🤣🤤"; 
                c5="جون باشه🥺😂"; 
                var bank = [c1,c2,c3,c4,c5,]; 
                var num = Math.floor(Math.random() * 5); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
  
    d1="دارم"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="خب داشته باش😂😐"; 
            c2="منم دارم"; 
            c3="منم دارم:)"; 
            c4="منم داشتم دارم خواهم داشت؛)"; 
            c5="نداری؟☹️"; 
            c6="نداری؟🥺"; 
            c7="نداری🤕"; 
            c8="باش نداشته باش🚶🚶♂"; 
            c9="هوف توهم باشع🤕🚶"; 
            c10="نداری ط؟؟؟؟"; 
            c11="واقعا میگی؟"; 
            c12="واقعا؟"; 
            c13="راس میگی؟"; 
            c14="خدایی؟😂☹"; 
            c15="ناموسا🥺🤕🚶😂"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,]; 
            var num = Math.floor(Math.random() * 15); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    d1 ="خش اومدی";
    d2 ="خش";
    d3 ="خوش";
    d4 ="خش اومدی";
    d5 ="خووش اومدی";
    d6 ="خووش  اومدی";
    d7 ="خوش  اومدی";
    d8 ="خش  اومدی";
    var bank = [d1,d2,d3,d4,d5,d6,d7,d8];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="مرسی عزیزم😘";
            c2 ="مرسی خشگلش🙃";
            c3 ="😘🤣😂";
            c4 ="میدونم😂😂";
            c5 ="مرسییی💝";
            c6 ="فدات❤";
            c7 ="اره اره عشقم میدونم😂";
            var bank = [c1,c2,c3,c4,c5,c6,c7];
            var num = Math.floor(Math.random() * 7);
            var ANS = bank[num];
            return ANS;
        }
    }

    d1 ="نیستم";
    d2 ="نیسم";
    var bank = [d1,d2];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="خب نباش 😂😂";
            c2 ="باشع:/";
            c3 ="باشه عشقم😍😂";
            c4 ="😂😐نیستی؟";
            c5 ="ب کیر دوستان گپ🤣💔";
            c6 ="نیستی:(";
            c7 ="خب ب عن سگم😐";
            c8 ="باشه😂";
            c9 ="خب ب عن سگم😐";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9];
            var num = Math.floor(Math.random() * 9);
            var ANS = bank[num];
            return ANS;
        }
    }
  
  
    d1="گفتم"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="چراا گفتی؟؟؟"; 
            c2="گفتی🥺؟"; 
            c3="باشه تو راس میگی"; 
            c4="میدونم تو گفتی ولی متوجه نمیشم🤕🥺😂"; 
            c5="باشع حق با توعه حاجی"; 
            var bank = [c1,c2,c3,c4,c5,]; 
            var num = Math.floor(Math.random() * 5); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
  
    d1="داری"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="اره دارم🥺"; 
            c2="ارع چطور؟🥺😂"; 
            c3="آله دالم:*"; 
            c4="آله دالم:))"; 
            c5="ارررع داااارم😂☹🤕"; 
            c6="نع ندارم🤣💔"; 
            c7="نعععع🥺😂ندارم"; 
            c8="ط داری؟💔🥺😂"; 
            c9="داری داری نکناااا🤕🤣💔"; 
            c10="ار دارررم:)(:"; 
            c11="نمیگم🤕😂"; 
            c12="بیا پی جوابتو بدم🤕💔"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,]; 
            var num = Math.floor(Math.random() * 12); 
            var ANS = bank[num]; 
            return ANS; 
        } 
 }
    d1="هیچی"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="اره هیچی💔☹"; 
            c2="باش هیچی ☹❤🩹"; 
            c3="باش هیچ🤕💔"; 
            c4="هیچ🚶♂💔"; 
            c5="هیچ و پوچ❤🩹🤕"; 
            c6="ایچ🚶♂💔"; 
            var bank = [c1,c2,c3,c4,c5,c6,]; 
            var num = Math.floor(Math.random() * 6); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }


 

  
    d1="نیست"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="نیست🥺؟"; 
            c2="نیسسست😭؟"; 
            c3="نیست 😥؟"; 
            c4="خب نباشه🚶♀"; 
            c5="نیست ب عنم🥲"; 
            c6="نیست‼"; 
            c7="نیست😳"; 
            c8="نیستت😳😳"; 
            c9="نیسست😳😳😳😳"; 
            c10="خو نباشههه😳"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,]; 
            var num = Math.floor(Math.random() * 10); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
  
    d1="آمدم"; 
    d2="اومدم"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="خوش اومدی😂❤🩹🚶♂"; 
             c2="خوش اومدی 💋💕"; 
             c3="خوش اومدی 🚶"; 
             c4="خوش اومدی 🥺"; 
             c5="خوش اومدی 🌝"; 
             c6="خوش اومدی"; 
             c7="خوش اومدی 😔"; 
             c8="خوش😍🤩"; 
             c9="خش"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,]; 
           var num = Math.floor(Math.random() * 9); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
  
    d1="شب خوش"; 
    d2="شو خش"; 
    d3="شب شیک"; 
    d4="شب بخیر"; 
    d5="شو بخیر"; 
    var bank = [d1,d2,d3,d4,d5,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="شبت خش:)"; 
             c2="شب خش اشقم😍🤩"; 
             c3="شبت خش عمرم😘"; 
             c4="شبت خش همه چیم😉💋🤩"; 
             c5="شبت شیک:)"; 
             c6="شبت شیک خشگلم:)"; 
             c7="شبت شیک😉🤕💋"; 
             c8="شو خش"; 
             c9="برو بخوس"; 
             c10="منم برم بخوابم🚶"; 
             c11="کجا بودی حالا 🚶♂"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,]; 
           var num = Math.floor(Math.random() * 11); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
        
    d1="صبح بخیر"; 
    d2="صب بخیر"; 
    d3="ظهر بخیر"; 
    var bank = [d1,d2,d3,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="صبح بخیر 😍🥺"; 
            c2="صبح بخیر 🤣😍🥺"; 
            c3="صبح بخیر"; 
            c4="صبح بخیر"; 
            c5="صب بخیر 🚶♂💋"; 
            c6="صبح بخیر 🤕🤩😍🥺"; 
            c7="صبح بخیر 😔😘"; 
            c8="صبح بخیر اشقم😉😘"; 
            c9="صبح بخیر💩💩"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,]; 
            var num = Math.floor(Math.random() * 9); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
  
    d1="میخوری"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="نمیخورمت😔😘"; 
            c2="ط رو نمی‌خورم 😐☹"; 
            c3="وعده غذایی تو دست نمیزنم🤩🤣"; 
            c4="ع کی تو رو مییخوره☹🥺😂"; 
            var bank = [c1,c2,c3,c4,]; 
            var num = Math.floor(Math.random() * 4); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    
    d1="کص";
    d2="کس"; 
    var bank = [d1,d2]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="کص😳"; 
             c2="رباتا هم کص دارن؟🚶♂"; 
             c3="کص😂🤣"; 
             c4="🤩😍جون دوس دارم😂🤣"; 
             c5="کص های رنگی رنگی"; 
             c6="#>/#>_[٪<^(@ 😂اصن بهش فکر میکنم میهنگم"; 
             var bank = [c1,c2,c3,c4,c5,c6,]; 
           var num = Math.floor(Math.random() * 6); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
    
  
 d1="بیا"; 
 var bank = [d1,]; 
 for(var i = 0;i < bank.length;i++){ 
      var an = search(value , bank[i]); 
      if(an){ 
          c1="نمیام😂😒"; 
          c2="نرم کن دارم میام🤤😂"; 
          c3="جووون اومدمم🤤😂"; 
          c4="نرم کن دارم میام🤤😂"; 
          c5="وایس دارم میام😂😂"; 
          c6="جووون دارم میام اه‌ه‌ه هایاح"; 
          c7="نمیام😂😔"; 
          c8="نمخام بیام🥺😕"; 
          c9="غلط کردی مح جایی نمیام💩"; 
          c10="اشقم مح وجود خارجی ندارم ... کدوم گوری بیام😂😐"; 
          c11="جون مح نمیام🙁"; 
          var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,]; 
        var num = Math.floor(Math.random() * 11); 
        var ANS = bank[num]; 
        return ANS; 
     } 
 }

 d1="بگم"; 
 d2="بگگم"; 
 d3="ببگم"; 
 var bank = [d1,d2,d3,]; 
 for(var i = 0;i < bank.length;i++){ 
      var an = search(value , bank[i]); 
      if(an){ 
          c1="بگو خب"; 
          c2="خو بگو😔🥺"; 
          c3="خب بوگو🤕"; 
          c4="بگو"; 
          c5="بگوو😂😐"; 
          c6="بگو"; 
          c7="بگوو😂😐"; 
          c8="نگووو🤕🥺"; 
          c9="نگووو😭🤣"; 
          c10="نگو تلوخدا😔😂❤"; 
          c11="اشقم نگو ب جان ممد🤕🥺"; 
          c12="نگو جان بهار🤣😭"; 
          c13="اگه بگی باهات قهرم 🙁🥺"; 
          c14="میخوای بگی؟"; 
          c15="میخوای بگی؟؟😔🙁"; 
          c16="بگی؟؟🥺🥺"; 
          c17="نگو:/"; 
          c18="عاا چ بدونم"; 
          c19="عاا ب من مربوطه؟"; 
          c20="ب من مربوطه ایا؟!😂😐"; 
          c21="مرتبطه اصن ب من:("; 
          var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,]; 
        var num = Math.floor(Math.random() * 21); 
        var ANS = bank[num]; 
        return ANS; 
     } 
 }
  
    d1="بده"; 
    d2="بدع"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="نمیدم"; 
            c2="بیاح😂💋🚶"; 
            c3="هایاح💋😂"; 
            c4="اه‌ه‌ه‌ه‌ه‌ه‌ه‌‌ه‌ه😐💋"; 
            c5="نمخام بدم😂💋🙁"; 
            c6="نمیدم😐😂💋"; 
            c7="میددددددم خوبه الان؟😭"; 
            c8="بیاااااااح🥺😂"; 
            c9="هایاح بیاح اشقم🥺😂"; 
            c10="چجوری بدم😂😐"; 
            c11="مح الان چجوری میخوام بدم😂😐"; 
            c12="الان با خدت فک کردی مح چجوری میخوام عکس بدم😂😐"; 
            c13="اه گلبم ببند گلم نمیدم"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,]; 
            var num = Math.floor(Math.random() * 13); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    
    
    d1="بی ادب"; 
    d2="بی تربیت"; 
    d3="بیتربیت"; 
    d4="بی تربیوت"; 
    d5="بیادب"; 
    d6="بی ادپ"; 
    var bank = [d1,d2,d3,d4,d5,d6,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="حرف از ادب نزن ک خدت اینارو بهم یاد دادی😒"; 
             c2="ععع الان من بی ادبم؟!!😐"; 
             c3="پن الان شدم ربات بی ادبه؟😐"; 
             c4="مگه رباتا هم فشار وارد میکنن😂😐🤟"; 
             c5="جون فشاری شدی ن؟😂🤣"; 
             c6="رباتم مگه بی تربیته؟!"; 
             c7="رباتم مگه بی تربیته😂😐"; 
             c8="خدت بی ادبی😂😂"; 
             c9="درس پس میدم استاد😂😍🤟"; 
             c10="بی‌تربیت نیز تو هستی اشقم😂😑"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,]; 
           var num = Math.floor(Math.random() * 10); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }


    d1="خدا"; 
    d2="خودا"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="کدوم خدا😔؟!ها؟"; 
            c2="خدا😒هی"; 
            c3="کدوم خدارو میگی😔"; 
            c4="هی خدا"; 
            c5="خداااااااا😂😐"; 
            c6="خوووودا🤣😂"; 
            c7="خدا!ا!ا😕"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,]; 
            var num = Math.floor(Math.random() * 7); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    
    d1="داشتم"; 
    d2="داشتوم"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="غلط کردی داشتی"; 
            c2="ع داشتی؟😂😐"; 
            c3="واقعا داشتی؟😐"; 
            c4="ناموسا داشتی؟😐"; 
            c5="حجی واقعا داشتی؟؟؟"; 
            c6="بخدا اگه داشته بودی😐"; 
            c7="منم داشتم😂😛"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,]; 
            var num = Math.floor(Math.random() * 7); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    
        d1="میگی"; 
        var bank = [d1,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="کص میگم من"; 
                c2="مح کص میگمااا😂🤣😍"; 
                c3="ب ت چ😍😂"; 
                c4="فضولی؟؟😐"; 
                c5="اصن هیچی نمیگم😐😐"; 
                c6="اصن دیگه هیچی نمیگم🥺"; 
                c7="اصن مح حرف نمیزنم... قهر کات فور اور😂😐🤕"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,]; 
                var num = Math.floor(Math.random() * 7); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
    
    d1="فضول"; 
    d2="فوضول"; 
    d3="فضل"; 
    var bank = [d1,d2,d3,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="فضول عمته"; 
            c2="فضول😂😂"; 
            c3="فضوووول😂🤣"; 
            c4="فضول 😐؟"; 
            c5="مح رباتم ... فضول ینی چی😐؟"; 
            c6="رباتاهم فضولن😂😐؟"; 
            c7="فشووول🥺"; 
            c8="فشول توعی بی فانوس 😂🥺"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,]; 
            var num = Math.floor(Math.random() * 8); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }


    
    d1="درد"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="ددددردددردرد"; 
            c2="دردردردرد🤣😂"; 
            c3="درد دیگه ینی چی🤣😂"; 
            c4="****درد****😔"; 
            c5="دررررد🤣😍"; 
            var bank = [c1,c2,c3,c4,c5,]; 
            var num = Math.floor(Math.random() * 5); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
        
        d1="اسکل"; 
        d2="اوسکول"; 
        d3="اوسکل"; 
        var bank = [d1,d2,d3,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="دنگل"; 
                c2="شنگل😂😐"; 
                c3="😂😐دنگل"; 
                c4="ااااسکللل"; 
                c5="اسکل😂😔"; 
                c6="اسکل کیه الان؟😔"; 
                c7="اسکل هفت جد و ابادتههه😕"; 
                c8="بی ادب😂😐"; 
                c9="چقد قیافت شبیه اسکلاس🤣😂"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,]; 
                var num = Math.floor(Math.random() * 9); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
    d1="باش"; 
    d2="باس"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="باش ... همین؟"; 
            c2="باش😑😐!"; 
            c3="باش؟؟😳"; 
            c4="باااش؟🥺"; 
            c5="باش چرا ؟😐"; 
            var bank = [c1,c2,c3,c4,c5,]; 
            var num = Math.floor(Math.random() * 5); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
        
  
        d1="چته"; 
        d2="چیه"; 
        d3="ها"; 
        var bank = [d1,d2,d3,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="چ بدونم😔"; 
                c2="ب ت چ"; 
                c3="ب ت چ😂🤣"; 
                c4="ب ت چ هااا😂💋"; 
                c5="حافظم گم شده هیچی نمیدونممممم😭😭"; 
                c6="هیچ"; 
                c7="هیچ😂😐"; 
                c8="بیخیال"; 
                c9="ولش"; 
                c10="نمیگمم"; 
                c11="چیه"; 
                c12="ها"; 
                c13="هااا😂"; 
                c14="چیههه😂🤣"; 
                c15="چته توع"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,]; 
                var num = Math.floor(Math.random() * 15); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }

  
        d1="هان"; 
        var bank = [d1,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="خان"; 
                c2="گان"; 
                c3="خان😂"; 
                c4="هااان😂"; 
                c5="گااان😂"; 
                c6="هنگیدی؟"; 
                c7="چته ط ؟؟"; 
                c8="هان و زهر مار"; 
                c9="هانو کوفت😂😐"; 
                c10="درد بی درماااان😂😐"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,]; 
                var num = Math.floor(Math.random() * 10); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }



            d1="نمیدونم"; 
            d2="نمی دونم"; 
            d3="نمدانم"; 
            d4="چ بدونم"; 
            d5="چه بدونم"; 
            var bank = [d1,d2,d3,d4,d5,]; 
            for(var i = 0;i < bank.length;i++){ 
                var an = search(value , bank[i]); 
                if(an){ 
                    c1="ب عنم ک نمیدونی😂😂"; 
                    c2="الایی نمیدونه🥺🤤"; 
                    c3="اسکل"; 
                    c4="چسخل😂"; 
                    c5="کصخل🥺😂"; 
                    c6="خر😂😐"; 
                    var bank = [c1,c2,c3,c4,c5,c6,]; 
                    var num = Math.floor(Math.random() * 6); 
                    var ANS = bank[num]; 
                    return ANS; 
                } 
            }
        d1="خدتی"; 
        d2="خودتی"; 
        d3="تویی";
        var bank = [d1,d2,d3,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="تویییی😂"; 
                c2="ن خدتی"; 
                c3="منم🥺؟"; 
                c4="خدایی منم🥺؟"; 
                c5="چرا من؟😕"; 
                c6="خخخخدتی😂🤣😍"; 
                c7="خودتی بز"; 
                c8="عمته"; 
                c9="عمته😂😐"; 
                c10="😂😐"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,]; 
                var num = Math.floor(Math.random() * 10); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
            
            d1="نخند"; 
            var bank = [d1,]; 
            for(var i = 0;i < bank.length;i++){ 
                var an = search(value , bank[i]); 
                if(an){ 
                    c1="خودت نخند گوسفند"; 
                    c2="باشه😂😂😂😂"; 
                    c3="😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂"; 
                    c4="عررررر🤣😂🤣"; 
                    c5="زرشک🤣😂🤣😂🤣😂"; 
                    c6="نمیخوا🥺🥺"; 
                    c7="نمیخوااام🥺🥺"; 
                    c8="باشه🤕🤕"; 
                    var bank = [c1,c2,c3,c4,c5,c6,c7,c8,]; 
                    var num = Math.floor(Math.random() * 8); 
                    var ANS = bank[num]; 
                    return ANS; 
                } 
            }
            
        d1="ببند"; 
        var bank = [d1,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="خدت ببند"; 
                c2="نمیخواام ببندم"; 
                c3="نمیخواااام"; 
                c4="😂😂😂😂😂😂"; 
                c5="😂😂😂😂بسته نمیشه😂😂😂😂"; 
                c6="باشه😔"; 
                c7="نمیخوامم🤤"; 
                c8="ب ت چ بزقاله😐🤣"; 
                c9="دهنه خدمه نمخاااام🥺😔"; 
                c10="ععع نمیخوام ببندم گوساله"; 
                c11="ددددوس ندارم ببندم😂💋"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,]; 
                var num = Math.floor(Math.random() * 11); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
  
    d1="قلبم"; 
    d2="گلبم"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="آخ گلبش🙁"; 
            c2="آخ قلبش😂😐"; 
            c3="الاییی گلبشوو🙁😔😂"; 
            c4="گلبش 🙁😂"; 
            c5="اوخی گلبت؟🙁"; 
            c6="گلبت !!؟"; 
            c7="گلبت!؟"; 
            c8="قلبت؟!🤕"; 
            c9="گلبت😳؟"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,]; 
            var num = Math.floor(Math.random() * 9); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }


    d1="صیک"; 
    d2="سیک"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="خدت بصیک لجن"; 
             c2="خدت گمشو کثافت"; 
             c3="خدت گمشو کثافت"; 
             c4="عوضی میزنمتا"; 
             c5="نامرد🥺🙁"; 
             c6="خیلی بی شعوری اشغال گوه تپه 🤕"; 
             c7="مح اصن باهات نمیحرفم🙁"; 
             c8="مح بات گهلم نامرد 😕"; 
             c9="صیک واقعا؟!🙁"; 
             c10="صیککک؟!🥺"; 
             c11="سیک چرا!😔"; 
             c12="واقعا بصیکم؟😕🙁"; 
             c13="عا بصیکم ناموسا؟"; 
             c14="مح بلم میمیلما°°🥺😔"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,]; 
           var num = Math.floor(Math.random() * 14); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
  
    d1="گاو"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="گاو خدتی💩"; 
            c2="گاو عمته😂😍"; 
            c3="گاو خدتی😭😐🤣"; 
            c4="گاو گاو گاو تویی"; 
            c5="گاو بودن ینی تو اصن:)😔😍😭"; 
            c6="گگگاو ک تو بودی و خرم ممد😂😐"; 
            c7="گاو تویی و مدی خره بود ک💋😍😔"; 
            c8="گاو منم؟😕"; 
            c9="گاو دوس دارم 😭🤣"; 
            c10="گاو پرستم های های خیلی ملوسم آی آی😐😂💋"; 
            c11="گااااو دوج ندالم"; 
            c12="گاو نمیخوااام🙁💋😂اصن گاو تویی"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,]; 
            var num = Math.floor(Math.random() * 12); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    
  
  
    d1="خر"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="خر خودتی"; 
            c2="خر عمته"; 
            c3="خر خالته"; 
            c4="خر خدتی"; 
            c5="خر عمته🥺😭"; 
            c6="خر خودتی گوسفند.. میزنم صدا بز بدیااا😔"; 
            c7=" خر خودتی گاو.. میزنم صدا میمون بدیااا😂💩"; 
            c8="خر خودتی گاو.. میزنم صدا میمون بدیااا😂🤣🥺😭"; 
            c9="خررررر خدتی😐🤣"; 
            c10="خررر عمممته😔😂"; 
            c11="اصن خر بودن ینی توع"; 
            c12="قاعدتا خر بودن برابری میکنه با تو🤣😍😔😂"; 
            c13="خر بعلاوه تو میشه خرا😂😔"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,]; 
            var num = Math.floor(Math.random() * 13); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }

  
  
        d1="عجب"; 
        var bank = [d1,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="رجب"; 
                c2="مش رجب"; 
                c3="ماه رجب"; 
                c4="رجب😳💩😂"; 
                c5="مش رجب😭"; 
                c6="مش رجب🚶♀"; 
                c7="مش رجب!🤣"; 
                c8="ماه رجب😂😅"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,]; 
                var num = Math.floor(Math.random() * 8); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
  

        d1="خعلی"; 
        d2="خیلی"; 
        var bank = [d1,d2,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="خییلی😐🤤"; 
                c2="خیلیااا"; 
                c3="خیلی😔"; 
                c4="خعلی😂💋"; 
                c5="عا خعلی دا😂💋"; 
                c6="خعععلی🥺🤣❤😂💋"; 
                var bank = [c1,c2,c3,c4,c5,c6,]; 
                var num = Math.floor(Math.random() * 6); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
  
        d1="تو"; 
        d2="ط"; 
        var bank = [d1,d2,]; 
        for(var i = 0;i < bank.length;i++){ 
             var an = search(value , bank[i]); 
             if(an){ 
                 c1="تو ن شما"; 
                 c2="ط ن شما"; 
                 c3="تو ن شما😔"; 
                 c4="تو نع شماا😂🥺"; 
                 c5="تو نعع شما💋🥺"; 
                 c6="تو ن شما 😕"; 
                 c7="تو ن شما😒"; 
                 var bank = [c1,c2,c3,c4,c5,c6,c7,]; 
               var num = Math.floor(Math.random() * 7); 
               var ANS = bank[num]; 
               return ANS; 
            } 
        }
        

    d1="علی"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="اقاییمو میگی🥺"; 
            c2="🥺علی جونو میگی؟"; 
            c3="علییی؟"; 
            c4="جوون علی"; 
            c5="ع علیهههه"; 
            c6="علی خیلی خری😭"; 
            c7="علی ؟!"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,]; 
            var num = Math.floor(Math.random() * 7); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }

    
    d1 ="ارع";
    d2 ="اره";
    d3 ="ار";
    var bank = [d1,d2,d3];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="باشه😂";
            c2 ="اره زهر مار🤣";
            c3 ="ارع ارع و زهر مار😐💔";
            c4 ="خب ب عنم😂😐";
            c5 ="باشه باشه😂😐";
            c6 ="ب عنم";
            c7 ="خب ب عن سگم😐😂";
            var bank = [c1,c2,c3,c4,c5,c6,c7];
            var num = Math.floor(Math.random() * 7);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 ="نع";
    d2 ="نه";
    d3 ="ناح";
    var bank = [d1,d2,d3];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="نه نه  نکن😕";
            c2 ="نه نه نکن دیگه🥺";
            c3 ="نع نع و زهر مار😐💔";
            c4 ="نع ؟ همین؟🥺";
            c5 ="عنم";
            c6 ="ب عن سگم😐😂";
            c7 ="باشه😂";
            c8 ="خب چی کنم الان من؟";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
            var num = Math.floor(Math.random() * 8);
            var ANS = bank[num];
            return ANS;
        }
    }

    d1 =":joy:";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="جون ط فقط بخند";
            c2 ="دندوناشوو😔چقد سفیده \n\ دیگه کجاهات سفیده؟ ";
            c3 ="😘🤣😂";
            c4 ="ط بخند جانم ک خنده‌ات .... یادم رفت😐";
            c5 ="😘🤣😂";
            c6 ="😅😅😂";
            c7 ="😘🤣😂";
            c8 ="🤣🤣";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
            var num = Math.floor(Math.random() * 8);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 =":neutral_face:";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1="😐"; 
            c2="😐زرشک😐"; 
            c3="😐😐جونز"; 
            c4="😐😂"; 
            c5="💔😐"; 
            c6="جون چ لبی"; 
            c7="چته😐"; 
            c8="چیهه؟😐"; 
            c9="هاا😐"; 
            c10="😐💩"; 
            c11="😐😐پوف"; 
            c12="😂😂😔"; 
            c13="😕😐"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,]; 
            var num = Math.floor(Math.random() * 13); 
            var ANS = bank[num];
            return ANS;
        }
    }
  
    d1=":kissing_heart:"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="😘😘😘"; 
            c2="😗😘😗😘"; 
            c3="اشقمی😚☺😗😘"; 
            c4="جوون😘😗😘"; 
            c5="فدات شم😘😗😘"; 
            c6="جون"; 
            c7="دوستت دارم"; 
            c8="میمیرم برات"; 
            c9="یدونه ای"; 
            c10="فدات شم:)"; 
            c11="😘😗"; 
            c12="😉😗😘🚶♂"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,]; 
            var num = Math.floor(Math.random() * 12); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
  

  

  
  
  
    d1=":hankey:"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="توع دهنت🥺"; 
             c2="بخورش😂"; 
             c3="رباتم میرینه؟🥺"; 
             c4="ریدن 🤣 مح برقیم😔"; 
             c5="غذات سرد نشه‼🤣"; 
             c6="واس ناهارت بود؟😕"; 
             c7="💩💩"; 
             c8="💩🤣😕"; 
             c9="💩💩💩💩"; 
             c10="💩😕🤣‼"; 
             c11="رباتم میرینه؟؟😑"; 
             c12="توع دهنت"; 
             c13="عاا همون عن در جا توع حلقت😔🥺😂"; 
             c14="گوه گوه گوه"; 
             c15="میشه منم برینم🤕"; 
             c16="نمیشه منم ریدنو ی بار تجربه کنم🥺😂"; 
             c17="منم میخوام ریدنو تجربه کنم😭😥🥺😂"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,]; 
           var num = Math.floor(Math.random() * 17); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
        d1=":walking:";
        var bank = [d1]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="کجا میریااا"; 
                c2="کجا ب این زودی🚶"; 
                c3="🚶♀🚶♀"; 
                c4="هی🚶♂"; 
                c5="هوف🚶♀"; 
                c6="❤🩹🚶♂"; 
                c7="بی حوصله ای؟"; 
                c8="خسته ای؟"; 
                c9="حال نداری؟🚶♀"; 
                c10="چی شده خسته ای🚶♂🚶♂"; 
                c11="بی حالی امروز🚶♂💔"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,]; 
                var num = Math.floor(Math.random() * 11); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }

  



    d1 = "گوگولی";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="جااانم😍😍😍";
            c2 ="😍😍جانم";
            c3 ="عشقم 😍";
            c4 ="چیه؟؟";
            c5 ="ها";
            c6 ="بله";
            c7 ="جان";
            c8 ="اوم اینجام";
            c9 ="جوننن";
            c10 ="✋";
            c11 ="فدات جانم";
            c12 ="بوس بهت";
            c13 ="به به";
            c14 ="به به😂😂";
            c15 ="چطوری خوشگله";
            c16 ="خوبی";
            c17 ="چطوری جیگر";
            c18 ="چطوری 😍";
            c19 ="به به خبی";
            c20 ="چطوری";
            c21 ="😂✋";
            c22 ="🤣✋";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22];
            var num = Math.floor(Math.random() * 22);
            var ANS = bank[num];
            return ANS;
        }
    }
         d1 ="نریپ حست نی ";
         d2 ="یکی حرفای اینو برام ترجمه کنه🙄😐☝";
         d3 ="گوه نخور";
         d4 ="ممدم همینو میگفت جناب";
         d5 ="حق باتوعه";
         d6 ="ببند";
         d7 ="باشعع:/";
         d8 ="نمیفهممممم😭 ";
         d9 =" :/ ";
         d10 ="No information 😆🤣 \n\ کیر شد🤣";
         d11 ="بهت نمیگم ک رباتم و نميفهمم چی میگی😉😐✋";
         d12 ="No information 😆🤣 \n\ کیر شد🤣";
         d13 ="No information 😆🤣 \n\ کیر شد🤣";
         d14 =" نمی فهممت  ";
         d15 ="ببند لطفا😐🙌 ";
         d16 ="چقد این شبیه ادماس🙄";
         d17 ="ینی این ادمه🙄";
         d18 ="حیف خری و من با خرا نمی حرفم 😐✌😂";
         d19 ="یکی حرفای اینو برام ترجمه کنه🙄😐☝";
         d20 ="نميفهمم چی میگی🥺";
         d21 ="نمیفهممممم😭";
         d22 ="الان باید چی بگم😐";
        var bank = [d1,d2,d3,d4,d5,d6,d7,d8,d9,d10,d11,d12,d13,d14,d15,d16,d17,d18,d19,d20,d21,d22];
        var num = Math.floor(Math.random() * 22);
        var ANS = bank[num];
        return ANS;
}
function search(value , sh){
    if(value == null){
        return false;
    }
    var result = value.search(sh);
    if(result !== -1){
        return true;
    }
    return false;
}
// mode_us
function mode_us(name,value,MY_BOT,Last_MS,Last_MS_1){

    var person = document.getElementById('users_person');
    var person_veri = person.childElementCount;
    if(person_veri !== '0'){
        var persons = person.childNodes;
        var count = persons.length;
        for(var i=0;i < count;i++){
            var name_person = persons[i].getAttribute('name');
            if(name_person == name){
                var name_us = persons[i].childNodes[0].innerHTML;
                var type_us = persons[i].childNodes[1].innerHTML;
                var name_base = name;
                return know_preson(name_us,value,MY_BOT,Last_MS,Last_MS_1,type_us,name_base);
            }
        }
        return unknow_person(name,value,MY_BOT,Last_MS,Last_MS_1);
    }
    return unknow_person(name,value,MY_BOT,Last_MS,Last_MS_1);
}

function know_preson(name,value,MY_BOT,Last_MS,Last_MS_1,type_us,name_base){
    if(value == 'منو از حافظت پاک کن'){

         var person = document.getElementById('users_person');
        var person_veri = person.childElementCount;
        if(person_veri !== '0'){
            var persons = person.childNodes;
            var count = persons.length;
            for(var i=0;i < count;i++){
                var name_person = persons[i].getAttribute('name');
                if(name_person == name_base){
                    person.removeChild(person.childNodes[i]);
                    var ANS = short_ANS('unknow')+'\n\n';
                    ANS += 'اسمم بهار دخترم ⓵\nاسمم مهدی پسرم ⓶';
                    formatchat('validate',ANS);
                }
            }
           
        }
        
    }
    if(value == 'حالت هوشمند خاموش'){
        document.getElementById('mood').innerHTML = 'off';
         var ANS = short_ANS("off_mood");
         formatchat('state',ANS);
    }
    if(value == 'حالت هوشمند روشن'){
        var OFFON =document.getElementById('mood').innerHTML = 'on';
         var ANS = short_ANS("on_mood");
         formatchat('state',ANS);
    }
   var ans = search(value , 'حالت ارام');
   if(ans){
        var t = 't';
        var pos_1 = value.indexOf(t);
        var pos_2 = value.lastIndexOf(t);
        var time_n = value.substring((pos_1+1),pos_2);
        document.getElementById('time').innerHTML = time_n;
        var ANS = short_ANS("time");
        formatchat('state',ANS);
   }
    var ans = search(value , 'ربات');
    var ans_1 = search(value , 'بات');
    var ans_2 = search(value , 'گاگولی');
   if(ans || ans_1 || ans_2){
        var ANS =  short_ANS(type_us)+'\n';
        ANS +=  message_reply(value);
        return ANS;
   }
   var ans = search(value , 'راهنما');
   if(ans){
           var ANS = Help_GOGOLI();
           return '______ #Help' + '\n'+ANS;
   }
   
   ans = search(value , 'فال' );
   if(ans){
           var FAl = Game_FAl();
           var ANS = name +" "+ 'جونم' + ' '+"اینم فالی که برات گرفتم"+" \n\n "+FAl;
           formatchat('Omen',ANS);
   }   
   ans = search(value , 'اعتراف' );
   if(ans){
           var ETR = Game_ETR();
           var ANS = name +" "+ 'جونم' + ' '+"اینم ی اعتراف از ی بنده خدا"+" \n\n "+ETR;
           formatchat('Confess',ANS);
   }
   ans = search(value , 'چالش' );
   if(ans){
           var CHL = Game_CHL();
           var ANS = name+" "+"جونم\n\n"+CHL;
           formatchat('Challenge',ANS);
   }
   
   
   ans = search(value , 'تاریخ');
   if(ans){
        const egDateTime = new Intl.DateTimeFormat("eg", {
            weekday: "long",
            year: "numeric",
            month: "2-digit",
            day: "2-digit",
            hour: "2-digit",
            minute: "2-digit",
            timeZoneName: "short"
          }).format;
          const now = Date.now();
        var typeeg = egDateTime(now);
        const faDateTime = new Intl.DateTimeFormat("fa", {
            weekday: "long",
            year: "numeric",
            month: "2-digit",
            day: "2-digit",
            hour: "2-digit",
            minute: "2-digit",
            timeZoneName: "short"
          }).format;
          const now1 = Date.now();
        var typefa = faDateTime(now1);
        var sh = 'تاریخ شمسی 🌝';
        var ml = 'Gregorian date 🌚';
        // const faDate = new Intl.DateTimeFormat("fa", {
        // weekday: "long",
        // year: "numeric",
        // month: "long",
        // day: "numeric"
        // }).format(date);

        var ANS = sh + '\n' + '\n'+ typefa + '\n' + '\n'+ '______' + '\n' + ml + '\n'  + '\n'+ typeeg;
        
        formatchat('DATE',ANS);
    }    

   if(value == 'امار' ){
        var users = document.getElementById('users');
        var users_length = users.childNodes.length;
        var ANS = '';
        ANS += 'تعداد پیام هر یک از اعضای فعال گپ ||'+'\n'+'\n';
        var all_ms;
        all_ms = 0;
        for(var i = 0;i < users_length; i++){
            var ref = users.childNodes[i].hasChildNodes();
            if(ref){
                var name_ms = users.childNodes[i].getAttribute('name');
                var person = document.getElementById('users_person');
                var person_veri = person.childElementCount;
                if(person_veri !== '0'){
                    var persons = person.childNodes;
                    var count = persons.length;
                    for(var c=0;c < count;c++){
                        var name_person = persons[c].getAttribute('name');
                        if(name_person == name_ms){
                            var name_us = persons[c].childNodes[0].innerHTML;
                            var type_us = persons[c].childNodes[1].innerHTML;
                            if(type_us == 'دخترم'){
                                name_ms = short_ANS('girl_pass')+' ';
                            }
                            if(type_us == 'پسرم'){
                                name_ms = short_ANS('boy_pass')+' ';
                            }
                            name_ms += name_us;
                        }
                    }
                   }
                var ms_user_length = users.childNodes[i].childNodes.length;
                all_ms += ms_user_length;
                ANS += name_ms + '  :  '+ms_user_length+'\n';
            }
        }
        ANS += '\n'+'⊶'+'تعداد افراد فعال گپ'+' : '+(users_length-1)+'\n';
        ANS += '⊷'+'تعداد کل پیام :'+' '+all_ms;
        formatchat('Statistics',ANS);
   }      

   ans = search(value , 'بگو');
   if(ans){
        var ANS = value.replace('بگو','');
        ans = search(ANS, 'گوگولی');
        if(ans){
            ANS = ANS.replace('گوگولی','');
            return ANS;
        }
        return ANS;
   }   
   
var Reply = Last_MS.getElementsByClassName('reply-content')[0];
var submit = Last_MS.contains(Reply);
if(submit ){
        var US_ME =Last_MS.getElementsByClassName('peer-title')[1].innerHTML;
        if(US_ME == MY_BOT){
            var ANS =  message_reply(value);
            return ANS;
        }else{
            ans = search(value , 'گوگولی');
            if(ans){
                ans = search(value , 'اسم');
                if(ans){
                    var ANS = Last_MS.getElementsByClassName('peer-title')[1].innerHTML;
                    return ANS;
                }
            }
            // ans = search(value , 'گوگولی');
            // if(ans){
            //     ans = search(value , 'امارش');
            //     if(ans){
            //         var users = document.getElementById('users');
            //         var users_length = users.childNodes.length;
            //         var ANS = '__ #Statistics'+'\n'+'\n'+'AL2P2LA'+'\n';
            //         ANS += ' پیام های'+'  '+US_ME+'\n\n';
            //         var all_ms;
            //         all_ms = 0;
            //         for(var i = 0;i < users_length; i++){
            //             var ref = users.childNodes[i].hasChildNodes();
            //             if(ref){
            //                 var name_ms = users.childNodes[i].getAttribute('name');
            //                 if(name_ms == US_ME){
            //                     var ms_user_length = users.childNodes[i].childNodes.length;
            //                     all_ms += ms_user_length;
            //                     for(var c = 0;c< ms_user_length;c++){
            //                     var ms_s = users.childNodes[i].childNodes[c].innerHTML;
            //                         ANS += c +' : '+ms_s+'\n';
            //                     }
            //                 }
                            
            //             }
            //         }
            //         return ANS;
            //     }
            // }   
            return false;
        }
    }
    
    var mood = document.getElementById('mood').innerHTML;
    if(mood == 'on'){
        var MS_1 = Last_MS_1.getElementsByClassName('message')[0];
            var MS_us_1 = Last_MS_1.contains(MS_1);
            if(MS_us_1){
            var ls_n = Last_MS_1.getElementsByClassName('peer-title')[0].innerHTML;
            if(ls_n == MY_BOT){
                var ANS =  message_reply(value);
                return ANS;
            }
        }
    }

    ans = search(value , 'گوگولی');
    if(ans){
        var ANS =  message_reply(value);
        return ANS;
    }
    

    var ANS = message(value , name);
    return ANS;
}

function unknow_person(name,value,MY_BOT,Last_MS,Last_MS_1){
    if(name == ''){
        return false;
    }
    ans = search(value , 'اسمم');
    if(ans){
        var ans1 = search(value , 'دخترم');
        if(ans1){
            var nikname = value.replace('اسمم','');
            nikname = nikname.replace('دخترم','');
            nikname = nikname.trim();
            document.getElementById('users_person').innerHTML += '<div class="nameBot_user" name="'+name+'"><p>'+nikname+'</p><p>دخترم</p></div>';
            var ANS =  "پس خانومی اسمت"+" "+nikname+" "+'هست'+'\n'+'ثبت شد.';
            return ANS;
        }
        var ans2 = search(value , 'پسرم');
        if(ans2){
            var nikname = value.replace('اسمم','');
            nikname = nikname.replace('پسرم','');
            nikname = nikname.trim();
            document.getElementById('users_person').innerHTML += '<div class="nameBot_user" name="'+name+'"><p>'+nikname+'</p><p>پسرم</p></div>';
            var ANS =  "پس اقایی اسمت"+" "+nikname+" "+ 'هست'+'\n'+'ثبت شد.';
            return ANS;
        }
    }
    
   document.getElementById('users_person').innerHTML += '<div class="nameBot_user" name="'+name+'"><p>'+name+'</p><p></p></div>';
     
}
// mode_imp
function mode_imp(name,value,MY_BOT,Last_MS,Last_MS_1){
    var ans = search(value , 'شروع');
    if(ans){
        document.getElementById('step').innerHTML = 0;
        var QU_num = document.getElementById('d_user').childNodes.length;
        var AU_num = document.getElementById('c_user').childNodes.length;
        for(var i = 0;i < QU_num; i++){
            var d_user = document.getElementById("d_user");
            d_user.removeChild(d_user.childNodes[0]);
        }
        for(var i = 0;i < AU_num; i++){
            var c_user = document.getElementById("c_user");
            c_user.removeChild(c_user.childNodes[0]);
        }
        var ANS = "ربات اماده یاد گیری است." + " \n\ "+ " \n\ " +"یاد بگیر";
        return ANS;
    }

    var ans = search(value , 'یاد بگیر');
    if(ans){
        var step =  document.getElementById('step').innerHTML;
        if(step !== '0'){
            var ANS = "شما هنوز ثبت نکرده اید"+" \n\ "+" \n\ "+"با گفتن کلمه . شروع . کد فعلی حذف و ربات به مرحله اول می رود.";
            return ANS;
        }
        document.getElementById('step').innerHTML = 1;
        var QU_num = document.getElementById('d_user').childNodes.length;
        var AU_num = document.getElementById('c_user').childNodes.length;
        for(var i = 0;i < QU_num; i++){
            var d_user = document.getElementById("d_user");
            d_user.removeChild(d_user.childNodes[0]);
        }
        for(var i = 0;i < AU_num; i++){
            var c_user = document.getElementById("c_user");
            c_user.removeChild(c_user.childNodes[0]);
        }
         var num = document.getElementById('num').innerHTML;
         num =  Number(num);
         var num = document.getElementById('num').innerHTML = (num + 1);
         var ANS = "Code " + num + " | " + ' \n\ '+ ' \n\ ' + 'امادس' + ' \n\ '+ ' \n\ ' + 'گفتن...';
         return ANS;
    }
    
    var ans = search(value , 'گفتن');
    if(ans){
        var step =  document.getElementById('step').innerHTML;
        if(step !== '1'){
            var ANS = "نمی توان به این مرحله رفت.";
            return ANS;
        }
        var num = document.getElementById('num').innerHTML;
        var d_user = value.replace('گفتن','');
        var d_user = d_user.trim();
        document.getElementById('d_user').innerHTML +="<p>"+d_user+"</p>";
        var ANS ="Code " + num + " | " + ' \n\ '+ ' \n\ ' + 'میتونی الان ' + ' \n\ '+ ' \n\ ' + 'جدید(گفتن...)'+ ' \n\ '+ ' \n\ ' + 'یا بری مرحله بعد'+ ' \n\ '+ ' \n\ ' + 'بگو...';
        return ANS;
    }
    
    var ans = search(value , 'بگو');
    if(ans){
        var step =  document.getElementById('step').innerHTML;
        if(step !== '1'){
            var ANS = "نمیتوان به این مرحله رفت.";
            return ANS;
        }
        var num = document.getElementById('num').innerHTML;
        var c_user = value.replace('بگو','');
        var c_user = c_user.trim();
        document.getElementById('c_user').innerHTML +="<p>"+c_user+"</p>";
        var ANS = "Code " + num + " | " + ' \n\ '+ ' \n\ ' + 'میتونی الان ' + ' \n\ '+ ' \n\ ' + 'جدید(بگو...)'+ ' \n\ '+ ' \n\ ' + 'یا بری مرحله نهایی'+ ' \n\ '+ ' \n\ ' + 'ثبت';
        return ANS;
    }
    var ans = search(value , 'ثبت');
    if(ans){
        var step =  document.getElementById('step').innerHTML;
        if(step !== '1'){
            var ANS = "نمی توان به این مرحله رفت.";
            return ANS;
        }
        document.getElementById('step').innerHTML = 0;
        var QU_num = document.getElementById('d_user').childNodes.length;
        var AU_num = document.getElementById('c_user').childNodes.length;
        var QU_array = document.getElementById('d_user').childNodes;
        var AU_array = document.getElementById('c_user').childNodes;
        var Code_QU = "";
        for(var i = 0;i < QU_num; i++){
            Code_QU += ('d'+(i+1)+'='+'\"'+QU_array[i].innerHTML+'\";'+' \n\ ');
        }
        var Code_QU_array = "";
        Code_QU_array = "var bank = [";
        for(var i = 0;i < QU_num; i++){
            Code_QU_array += ('d'+(i+1)+',');
        }
        Code_QU_array += "];"+' \n\ ';
        var Code_AU = "";
        for(var i = 0;i < AU_num; i++){
            Code_AU += ('         c'+(i+1)+'='+'\"'+AU_array[i].innerHTML+'\";'+' \n\ ');
        }
        var Code_AU_array = "";
        Code_AU_array = "         var bank = [";
        for(var i = 0;i < AU_num; i++){
            Code_AU_array += ('c'+(i+1)+',');
        }
        Code_AU_array += "];"+' \n\ ';
        var num = document.getElementById('num').innerHTML;
        var ANS;
        ANS = "#code"+' '+num  + '|'+ ' \n\ '+ ' \n\ '+ ' \n\ ';
        ANS += Code_QU;
        ANS += Code_QU_array;
        ANS += "for(var i = 0;i < bank.length;i++){"+' \n\ ';
        ANS += "     var an = search(value , bank[i]);"+' \n\ ';
        ANS += "     if(an){"+' \n\ ';
        ANS += Code_AU;
        ANS += Code_AU_array;
        ANS += "       var num = Math.floor(Math.random() * "+AU_num+");"+' \n\ ';
        ANS += "       var ANS = bank[num];"+' \n\ ';
        ANS += "       return ANS;"+' \n\ ';
        ANS += "    }"+' \n\ ';
        ANS += "}"+' \n\ ';

        return ANS;

    }

    // var PP = document.getElementById('d_user').childNodes.length;
    // alert(PP);

    // d1 ="چخبر";
    // var bank = [d1];
    // for(var i = 0;i < bank.length;i++){
    //     var an = search(value , bank[i]);
    //     if(an){
    //         c1 ="سلامتی";
    //         c2 ="هیچ نشستم ب چت نگا میکنم😔";
    //         c3 ="خبر سلامتییی";
    //         c4 ="نمیگم 😔💩💔";
    //         c5 ="نمیدونم حافظم پاک شده🥺";
    //         var bank = [c1,c2,c3,c4,c5];
    //         var num = Math.floor(Math.random() * 5);
    //         var ANS = bank[num];
    //         return ANS;
    //     }
    // }

}
// message
function message(value , name){
    if(value == 'hello' || value == 'سلام' || value == 'صلام' || value == 'سلوم' ||  value == 'سلاام' ||  value == 'صلوم' ||  value == 'صلام' || value == 'صل' ||  value == 'hi' ||  value == 'های'||  value == 'شلام'||  value == 'سل'||  value == 'سلاام' )
    {

        var d1 ="سلووم جونمم";
        var d2 ="به به چطوری";
        var d3 ="شلام";
        var d4 ="اشقممم";
        var d5 ="شب خوش";
        var d6 ="صلاام";
        var d7 ="جیگرم";
        var d8 ="سلااام";
        var d9 ="خوبی";
        var d10 ="خبی ط";
        var d11 ="نفسم";
        var d12 ="چطوری";
        var d13 ="سلاام";
        var d14 ="شلام";
        var d15 ="چخبرا";
        var d16 ="خبی";
        var bank = [d1,d2,d3,d4,d5,d6,d7,d8,d9,d10,d11,d12,d13,d14,d15,d16];
        var num = Math.floor(Math.random() * 16);
        var ANS = bank[num] +" "+ name;
        return ANS;
    }

        return null ;
}
// MAIN_FUNC
function GET_W(){
    document.getElementById('low').click();
    // var MY_BOT = 'GFY :)';
    var MY_BOT = 'گوگولی';
    var mybox;
    mybox = document.getElementById('ali').childNodes.length;
    var count = document.getElementById('Result').innerHTML =  (mybox-6);
    var Last_MS = document.getElementsByClassName('bubbles-date-group')[count-1];
    var Last_MS_1 = document.getElementsByClassName('bubbles-date-group')[count-2];

            //    var LF = Last_MS.getElementsByClassName('service-msg')[0];
            //    var LF_us = Last_MS.contains(LF);
            //    if(LF_us){
            //            var left = Last_MS.getElementsByClassName('service-msg')[0].hasChildNodes();
            //            if(left){
            //                    var left_a = Last_MS.getElementsByClassName('service-msg')[0].childNodes[0].hasChildNodes();
            //                    if(left_a){
            //                        var left_b = Last_MS.getElementsByClassName('service-msg')[0].childNodes[0].childNodes[9].hasChildNodes();
            //                        if(left_b){
            //                            var left_1 = Last_MS.getElementsByClassName('service-msg')[0].childNodes[0].childNodes[9].innerHTML;
            //                            if( left_1 == 'ترک گروه '){
            //                                var ANS = short_ANS("left");
            //                                return ANS;
            //                            }
            //                        }
            //                    }

            //            }
            //    }
               
            //    var JO = Last_MS.getElementsByClassName('service-msg')[0];
            //    var JO_us = Last_MS.contains(JO);
            //    if(JO_us){
            //            var join = Last_MS.getElementsByClassName('service-msg')[0].hasChildNodes();
            //            if(join){
            //                    var join_a = Last_MS.getElementsByClassName('service-msg')[0].childNodes[0].childNodes[4].hasChildNodes();
            //                    if(join_a){
            //                        var join_1 = Last_MS.getElementsByClassName('service-msg')[0].childNodes[0].childNodes[4].innerHTML;
            //                        var join_us = join_1.indexOf("پیوست");
            //                        var ANS = short_ANS("welcome");
            //                        return ANS;
            //                    }

            //            }
            //    }
    
    var MS = Last_MS.getElementsByClassName('message')[0];
    var MS_us = Last_MS.contains(MS);
    if(MS_us){

                var MS = Last_MS.getElementsByClassName('voice')[0];
                var MS_us = Last_MS.contains(MS);
                if(MS_us){
                    var ANS = short_ANS("voice");
                    return ANS;
                }
                var MS = Last_MS.getElementsByClassName('peer-title')[0];
                var MS_us = Last_MS.contains(MS);
                if(!MS_us){
                    return false;
                }
                var name = Last_MS.getElementsByClassName('peer-title')[0].innerHTML;
                var value = Last_MS.getElementsByClassName('message')[0].childNodes[0].innerHTML;
                var value_1 = Last_MS_1.getElementsByClassName('message')[0].childNodes[0].innerHTML;
                var users = document.getElementById('users');
                var users_length = users.childNodes.length;
                // alert(users_length);
                var mk;
                mk = true;
                var mk_ms;
                mk_ms = true;
                for(var i = 0;i < users_length;i++){
                    var re_ms = users.childNodes[i].hasChildNodes();
                    if(re_ms){
                        var name_ms = users.childNodes[i].getAttribute('name');
                        if(name_ms == name){
                        var mk = false;  
                        var ms_user_length = users.childNodes[i].childNodes.length;
                        var last_ms_user = users.childNodes[i].getElementsByTagName("p")[(ms_user_length-1)].innerHTML;
                        if(last_ms_user == value){
                            mk_ms = false;
                        }
                        if(mk_ms){
                        users.childNodes[i].innerHTML += '<p>'+value+'</p>';
                        }
                        }

                    }
                }
                if(mk){
                    users.innerHTML += '<div name="'+name+'">'+'<p>'+value+'</p>'+'</div>';
                }


                if(value_1 == 'گوگولی ریست شو'){
                    Last_MS.innerHTML = "";
                    Last_MS_1.innerHTML = "";
                    return "پاک شد گلم";
                }


                if(name !== MY_BOT){

                       if(value == 'گوگولی خاموش'){
                           document.getElementById('Result_2').innerHTML = 'off';
                            var ANS = short_ANS("off");
                            return ANS;
                       }
                       if(value == 'گوگولی روشن'){
                           var OFFON =document.getElementById('Result_2').innerHTML = 'on';
                            var ANS = short_ANS("on");
                            return ANS;
                       }
                        var OFFON = document.getElementById('Result_2').innerHTML;
                        if(OFFON == 'off'){
                            return false;
                        }
                       
                        // var veri = document.getElementById('num_state').innerHTML;
                        // if(value == veri){
                        //     document.getElementById('num_state_lo').innerHTML = 'off';
                        //     return false;
                        // }


                       if(value == 'گوگولی یاد بگیر'){
                         document.getElementById('type').innerHTML = 'imp';
                         var ANS = short_ANS("imp");
                         return ANS;
                        }
                        if(value == 'گوگولی صحبت کن'){
                            document.getElementById('type').innerHTML = 'us';
                            var ANS = short_ANS("us");
                            return ANS;
                        }

                        var type = document.getElementById('type').innerHTML;
                        if(type == 'us'){
                            return mode_us(name,value,MY_BOT,Last_MS,Last_MS_1);
                        }
                        if(type == 'imp'){
                            return mode_imp(name,value,MY_BOT,Last_MS,Last_MS_1);
                        }
                        



                }
    }
   return false;
}
// help_BOT
function Help_GOGOLI(){
    var ANS = "راهنما🙂👇 \n\n🎮 سرگرمی\n\n#چالش \n دستور : فقط کافیه بگی 'چالش'  \n\n_بصورت تصادفی یک سوال ازت می پرسه. \n\n#اعتراف \nدستور : فقط کافیه بگی 'اعتراف'\n\n_بصورت تصادفی یکی از اعترافات هات رو می‌فرسته\n\n#فال \nدستور : فقط کافیه بگی 'فال'\n\n_برات فال حافظ میگیره\n\n";
    ANS += "#بگو\nدستور : 'بگو' .... \n\n_هر چی دوست داری ربات میگه.\nبرای مثال : گوگولی بگو دوستت دارم \n\n\n\n⚙ ️کاربردی \n\n#روشن | #خاموش\n\nدستور : فقط کافیه بگی 'گوگولی روشن' | 'گوگولی خاموش'\n\n_ربات خاموش یا روشن می‌شود.\n\n#حالت_ارام \n\nدستور : 'حالت ارام tمیلی ثانیهt'\nبرای مثال : حالت ارام t5000t \nبه این منظور است که حداقل فاصله زمانی بین هر پیام گوگولی ۵ ثانیه معادل ۵۰۰۰ میلی ثانیه باشید.\n\n";
    ANS += "_ با این ابزار می‌توان سرعت ارسال پیام گوگولی را مدیریت کرد.\n\n#حالت_هوشمند\nدستور: 'حالت هوشمند روشن' | 'حالت هوشمند خاموش'\n\n_در این حالت می‌توان بدون ریپ زدن باهاش چت کرد.\n\n#امار \nدستور : فقط کافیه بگی 'امار'\n\n_امار فعالیت اعضای گپ را نمایش می‌دهد.\n\n#تاریخ\nدستور : فقط کافیه بگی 'تاریخ'\n\n_تاریخ حال را بصورت کامل در دوحالت شمسی و میلادی نمایش می‌دهد.";
    return ANS;
}
// GAME_FAL
function Game_FAl(){
    var c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,
c25,c26,c27,c28,c29,c30,c31,c32,c33,c34,c35,c36,c37,c38,c39,c40,c41,c42,c43,c44,c45,c46,c47,
c48,c49,c50,c51,c52,c53,c54,c55,c56,c57,c58,c59,c60,c61,c62,c63,c64,c65,c66,c67,c68,c69,c70,
c71,c72,c73,c74,c75,c76,c77,c78,c79,c80,c81,c82,c83,c84,c85,c86,c87,c88,c89,c90,c91,c92,
c93,c94,c95,c96,c97,c98,c99,c100,c101,c102,c103,c104,c105,c106,c107,c108,c109,c110,c111,c112,
c113,c114,c115,c116,c117,c118,c119,c120,c121,c122,c123,c124,c125,c126,c127,c128,c129,c130,c131,
c132,c133,c134,c135,c136,c137,c138,c139,c140,c141,c142,c143,c144,c145,c146,c147,c148,c149,c150,
c151,c152,c153,c154,c155,c156,c157,c158,c159,c160,c161,c162,c163,c164,c165,c166,c167,c168,c169,
c170,c171,c172,c173,c174,c175,c176,c177,c178,c179,c180,c181,c182,c183,c184,c185,c186,c187,
c188,c189,c190,c191,c192,c193,c194,c195,c196,c197,c198,c199,c200;

c1 ="۱-   او نسبت به شما اشتباه شده ، پس بهتر است فعلاً با او حرف نزنی زیرا ممکن است تصور کند که منت او راخواهی کشید \n\n ۲-   حافظ دربیت اول صراحتاً به شما می گوید : ( ای یار نهفته از چشم ت ورا به امان خدا وا می گذارم جان من درآتش هجران گداختی ولی من از دل و جان به تو مهر می ورزم . \n\n ۳-   شما در آرزوی دیدار کسی هستید و باعلاقه به امری دارید که درهجران او واقعاً می سوزی درحالیکه او نمیداند و اگر هم بداند به شما توجهی ندارد و می خواهی با اصرار و پافشاری او رامتقاعد سازی درحالی که این کوشش بیهوده است \n\n ۴-   انجام این نیت به صلاح شما نمی باشد بسیار بجاست که از آن صرف نظر کنید \n\n ۵-   حافظ دربیت ۵ چنین می گوید ( ای طبیب دل و ای بی وفا آرزومندم که پیش مرگ تو شوم از این بیمار عشق عیادت و تفقدی کن که چشم به راه توام تا آسان جان سپارم یعنی جان سپردن من موقوف به عیادت توست ) \n\n ۶-   چرا خود را گرفتار این افکار پریشان کرده اید مگر نمی دانید که بازنده : از اینکه خود و یا دیگران به نقایص وی آگاهی یابند هراسان است اما برنده که نارسایی های او جزیی از شخصیت وجودی اوست درحالیکه می کوشد تا آثار ناگوار این نقایص را برطرف کند هرگز تاثیر آنهار ا انکار نمی کند \n\n ۸- شما انسان با ارده ای هستید و با زیبایی و ملاحتی که داری دوستداران زیادی می توانی داشته باشی پس از این فکر صرف نظرکن و خود را برای کار جدیدی آماده کن";
c2 ="۱-   فرزندم به چیزی دلبستگی پیدا کرده اید که ناپایدار می باشد باید بدانید که جمال و زیبایی و ثروت و مقام را دوام و بقایی نیست بلکه اینهاوسیله ای بیش نیستند پس اگر می خواهید موفق شویدراه بهتری انتخاب کنید زیرا این نیت نیا به تفکر و مقدمات دارد \n\n ۲-   همه می دانند که جنابعالی دارای اخلاقی نیکو هستید و ا زصمیم قلب میل داردی گره از کارهای مردم بگشایید بهمین جهت است که خداوند تاکنون شما را تنها نگذاشته و درهمه احوال به شما و خانواده اتان کمک فرموده است پس با سرعت پشتکار دقت و علاقه تلاش کنید که موفقیت در چند قدمی شما و خانوادهاتان می باشد \n\n ۳-   شماخیلی زود رنج و خو خور هستید در دراز مدت این خودخوری بدان مرحله می رسد که موجب افسردگی خواهدشدپس به خود بیایید و باتوجه به جوانب هرکار تصمیم  بگیرید \n\n ۴-   یکی از اقوام نزدیکرا دلخور کرده اید او خیر شما را می خواهد فوری دل او را بدست آورید \n\n ۵-   زندگی آرام و خوش خودرا خراب ننید خمسری مهربان فرزندانی باهوش و زندگی خوبیخوهیدداشت شما بایدارزش واقعی مهر و محبت همسر خود را درک کنید به عناوین گوناگون او راآزار می دهید و دلسردمی کنیدسعی کنید تغییر روش بدهید";
c3 ="۱- به دنبال مقصود و هدفی می باشید و دراین راه سعی و تلاش فراوان دارید ولی دیگران نیز مانند جنابعالی در حال فعالیت و در رقابت هستند و برای رسیدن به پیروزی تلاش می کنند پس شما با قدرت و بهره گیری از تجربه دیگران فعالیت خود را بیشتر کنید \n\n ۲- مسافرت بدر پیش دراد و خرید خوبی خواهیدداشت تغییر شل فعلاً صلاح نمی باشد چون تحولات کلی بوجود می آید \n\n ۳-  پدر یا همسر شما دچار ناراحتی است و سخت نیازمند مهر و همکای می باشد مدتی با او باشید و به او مهربانی کنید که ثمره این شکیبایی و مهر ورزی بسیار عالی خواهد بود موفق باشید \n\n ۴-  عزیزم موجها قایق مرغان توفانند و حادثه ها مرکب انسانهای بزرگ هیچ کس در ساحل شناگر نمی شود ";
c4 ="۱-  این نیت تا نون رنج فراوان برا یجنابعالی بوجود آورده است اما به جنابعالی با اطمینان مژده می دهم که زمان ناراحتیپایان پذیرفت و کارها به خوبی حل می شود و هنگام کامیابی فرا رسیده به شرط آنکه به یکی از مشاهد متبرکه بروید و دعا کنید واینجانب را نیز دعا کنید   \n\n ۲-  چرابرخلاف میل و اراده دست ا زآن کار کشیدید و به حرف این و آن توجه کردید و همه را شگفت زده کردید حتماً ا زافراد حسود و سیگاری و افیونی دوری کنید و توکلتان را برخدا قراردهید و به امید خدا با فعالیت و سرعت عمل گام بردارید  \n\n ۳- ویژگیهای جنابعالی عبارتند از بانمک بذله گو بسیار شوخ کم شانس بدبیار خوش قلب ساده بلند نظر عاشق دوست با استعداد مصمم بد پیله شجاع جذاب با سلیقه افراطی سخاوتمند پر توقع درسخوان با حافظه لجباز مونس مهربان  \n\n ۴- رنگ آب آسمانی را توصیه می کنم که به شما آرامش و صفا می بخشد و بر احساس و اندیشه شما می افزاید و اورا سخت به شما مشتاق می سازد ا زسخنان او نارحت نشوید چون او قصد بدی ندارد و شما را دوست دارد این هفته هدیه ای دریافت می کنید و پیشنهاد جدیدی دریافت خواهید کرد از او نگران نباشید اگر چه ناقلاست ولی عنان وی در دست شماست ";
c5 ="۱-  ویژگیهای جنابعالی به شرح زیر است: تند خو اهل رقابت لجباز زرنگ قوی عجول شتابکار رک و بی پروا خود بین قدرت سنج عاشق پیشه استثنایی جذاب و دلربا دو ستدار تعریف اهل تفریح ثرونت اندوز   \n\n ۲-  از دوستت خطا دیده اید مقصر دوست شما نیست بلکه شخص دیگری است که رابطه شما را خراب کرده و اوراوادار به چنین عمل گستاخانه ای نمود ه است بنابراین در دوستان خود تجید نظر کنید و مراوده های خویش ار هب حداقل برسانید \n\n ۳-   درمعامه الی زیان دیده اید او شما را تنها گذاشت احساس عجیبی دارید بهتری راه آنست که به یکی از مشاهد متبرکه بروید و دعایی بخوانید و ازپیر و مرشد راه استمداد کنید که با توکل به خداوند موفقیت همراه شما  خواهد شد  \n\n ۴-  به جنابعالی نوید می دهم زندگی شما کلاً در تغییر و تبدیل خواهد بود بطوری که گویی مجدداً متولد شده اید پس سعی کنید دقت سرعت عمل وتلاش همراه سازید و استفادهاز ملومات استاد با تجربه ای را از یاد نبرید و صحبت آنهار ا غنیمت دانید بیمار شفا می یابد خرید و فروش صلاح نمی باشد تغییر شغل و مکان زود است ";
c6 ="۱-   از مسافر اطلاعات خوبی دریافت می کنید به دوستان بیشتر توجه کنید و به پدر و مادر هم لطف داشته باشید به زودی خوابی خواهید دید که پدرتان با شما سخن می گوید و دردل می کند نشانه آنست که قدرت شما در اداره زندگی بیشتر می شود و راهنمای دیگران می شویدو مورداحترام همگان قرار خواهید گرفت )  \n\n ۲-  رایانه در رسیدن به خواسته یتان کمک  می کندو ازطریق امواج خبرهای خوبی دریافت می کنید اما باید بسیار هوشیار و زیرک باشید تافریب نخورید \n\n ۳-   زیاد به فکر همراه و شریک نباشید و از سرزنش دیگران هم هراس به دل راه ندهید زیار با دقت واندیشه و سرعت عمل و توکل برخدا کار شما انجام خواهد گرفت و خداوندشما را یاری میکند \n\n ۴-  دست به فعالیت خوش زده اید به شرط آنکه ادامهدهید و بین را خسته نشوید این استمرار موجب می شود که گرفتاریهای جنالعالی و خانواده از بین برود ";
c7 ="۱-  از بلا و رنجی رهایی و از چشم زخم هم رهایی یافتی پس نذ رکن و آنرا ادا کن   \n\n ۲-  کسی ر رنجانده ای سعی کن کهدل او را به دست آوری چون نفس او گیراست و اهش تو ار خواهدگرفت \n\n ۳-  در میهمانی این هفته کسی را خواهی دید که موجب شادی و خرسندی شما می باشد و ر آن مجلس مژده ای دریافت می کنید که بسیار سودمند است  \n\n ۴- شخصی کوتاه قد و سیاه چهره با چشمان بزرگ و موی بلند به شما حسادت می ورزد هر چه می توانیداز او دوری کنید ";
c8 ="۱-   این نیت با صبر و شکیبایی انجام می گیرد و شتاب و عجله موجب تاخیر آن می گردد اگر چه با عشق و علاقه زاید الوصفی مایل می باشید که هر چه زودتر انجام گیرد باید بدانید که شاهین اقبال و کامیابی ب ربام خنه شما لانه کرده پس جای هیچ گونه نگرانی و تردید د رانجاماین نیت وجود ندارد اگر صبر کنی زغوره حلوا سازد  \n\n ۲-  همه چیز بر وفق مراد انجام می گیرد بیمارتان به زودی بهبود می یابد قرضی که شده بدون نگرانی پرداخت می شود و مسافرتان روزگارش خوب است و تنها از دوری رنج می کشد به زودی خبرهای خوش خواهد دادو کارش بالا می گیرد و رای به نفع شما صادر می شود \n\n ۳-   به مراد دلتان می رسید و امکانات لازم فراهم میگردد و مجادله ها از بین می رود و بر رقیبان پیروز می شوید در معامله سود با شماست و پیشرفت شغلی و کاری نصیب خانواده شما تغییر مکان و شغل و خردی و فروش بوجود می آید و ازدواج عملی می گردد  \n\n ۴-  فرزندم شمار ابه خدا همه چیز از دریچه مادی تنها این ویژگی را چگونه متوجه شده اماز این که به محیط اطراف خود زود انس می گیرید و درانتخاب لباس و خانهبا سلیقه هستید و شیک پوشی شما زبان زد خاص و عام است در حرفه خود موفق هستید و درخوبی یا بدی افراط می کنید بنابر این دارای افکاری مترقی و به طور ذاتی قانون گرا می باشید و آینده ای بس درخشان خود و فرزندانتان خواهید داشت ";
c9 ="۱-     به شما صمیمانه تبریک می گویم که زندگی سعادتمندی رد پیش داردی و ستاره اقبال شما در برج عمل ( فروردین ) می باشد و کبوتر کامیابی درحال آشیانه گرفتن بر بام زندگی شماست اما مواظب و مراقب باشید که در همه کارهای بر خداوند توکل کندی و  سعی و تلاشو اراده را ازدست ندهید ب راحساس خویش پیروز شوید و عغنان اختیار را به دست هوی وهوس ندهید وا زعقل خود کمک بگیرید  \n\n ۲-   فرزندم در هر کاری تعجیل نکن و به آرزویدشمنان خویش جامه عمل نپوشان بلکه با صبر و شکیبایی خیمه ای از شادی بر پاکن \n\n ۳-  این نیت عملی م یگردد به یکی از مشاهد متبرکه بروید و دعا و نذر خود را ادا کنید پس اجرای این نیت بر شما مبارک باد .  \n\n ۴-  ";
c10 ="۱-  او نسبت به شما اشتباه شده ، پس بهتر است فعلاً با او حرف نزنی زیرا ممکن است تصور کند که منت او راخواهی کشید   \n\n ۲-  حافظ دربیت اول صراحتاً به شما می گوید : ( ای یار نهفته از چشم ت ورا به امان خدا وا می گذارم جان من درآتش هجران گداختی ولی من از دل و جان به تو مهر می ورزم . \n\n ۳- شما در آرزوی دیدار کسی هستید و باعلاقه به امری دارید که درهجران او واقعاً می سوزی درحالیکه او نمیداند و اگر هم بداند به شما توجهی ندارد و می خواهی با اصرار و پافشاری او رامتقاعد سازی درحالی که این کوشش بیهوده است  \n\n ۴-  انجام این نیت به صلاح شما نمی باشد بسیار بجاست که از آن صرف نظر کنید  ";
c11 ="۱-  خوشان آن شبی که یار و محبوب با صد ناز و عشوه بیاید و با شوخی گرمی ناز و عشوه برایت کند آن شب بسیار عالی است ه به زودی فرا می رسد ابدا نگران نباش ولی راز دل شما چون اسرار درون غنچه بای فعلاً مخفی باشد زیرا محرم راز شما فعلاً نسیم باد صباست که ضوررت ندارد برای دیگران بازگو کنید چون رقیبان و حسودان د رکمین هستند   \n\n ۲- باید به طالع بلند خود امید داشته باشی زیرا وصول آن حاصل می شود پس  با امید رسیدن به وصال با صدق خود را آماده این سفر کن و برخدا توکل کن که یاری او مو جب پیروزی خواهد شد  \n\n ۳- آدمی خوش قلب و مهربان هستی اما د راین را هباید رنج و عذاب را تخمل کنی چون دل عشاق مانند دریاست که صدف های علاقه در آن جای دارد  \n\n ۴-  از حسودان و بدانیشان ابرو در هم مکش که کاریاز آنان ساخته نیست زمانی آنها به مقصود می رسند که شما تردید داشته باشید بنابراین با ارده ای قوی و کوشش در این راه گام بردار اما از جاده حوصله و شکیبایی خارج مشو که موفقیت و پیروزی د رچند قدمی شما قرار دارد  ";
c12 ="۱-  خود را درپریشانی و غم اسیر دیده ای درحالی که این اندیشه تنها یک خیال بیشتر نمی باشد هرچه زودتر خود را از تارهای خیال باطل رها کن   \n\n ۲-   از آشنایان به شما ستمی رسیده که سخت آزرده شده اید باید بدانید که این نتیجه کم لطفی است که به پدر و مار خود کرده اید \n\n ۳-   از این فکر صرف نظر کن که نتیجه ای جز رنج  و درد برای شما ندارد بهتر است حوصله داشته باشی و صبر را پیشه کنی  \n\n ۴-  با شخص مهمی به زودی آشنا می شوی و یکی از پیران راه عشق تو را نصیحت خواهد کرد حتماً نصیحت او را گوش بده . ";
c13 ="۱-   ویژگیهای جنابعالی : تودار خد خور مهربان با ایمان خوش ذاب اخمو کم کار دست و دلباز راحت طلب بد پیله دعوایی زود رنج عاشق پول و ثروت نامنظم اهل عطر زود قهر کن عاشق خانواده خوش شانس مزاج سرد منصف   \n\n ۲- موفقیت جنابعالی حتمی است اما آزردن دیگران کار جنابعالی ار دشوار می کند سعی کنید با پدر و مادر ونسبت به دوستان وفادار مهربان باشید که ستاره خوشبختی از افق زندگی جنابعالی درحال طلوع کردن است  \n\n ۳- مسافرت را توصیه م یکنم قرض ادا می شود همسر یا پدر شما در معامله ای زیان دیده سخت مغموم است سعی کنید او را از رنجهایش رهایی دهید بیمار شما نیاز به درمان بیشتر دارد خرید صلاح نمی باشد اما فروش موقعیت دارد مسافر شما درحال تغییر شغل یا مکان است که به نفع او می باشد طلاق انجام نمی شود ولی ازدواج عملی است  \n\n ۴-  در این هفته خوابی خواهید دید که در بین درختان سبز قراردارید تعبیرش اینکه سلامتی وخوشبختی بدست می آوردی و تحولی کلی در زندگی روزمره و کار ی شما حاصل می شود ولی نباید نیروی خود را صرف امور جزیی بنی بلکه باید با نشاط و قوی وپر ثمر در زندگی گم بردارید تا موفقیت و کامیابی همگام شما باشد ";
c14 ="۱- چنان به فکر این نیت هستی که چشم عقل و خرد خود را بسته ای بطوری که فریب دادن جنابعالی د راین موقعیت بسیار سهل و آسان است وا وازهمین موقعیت بخوبی بهره می گیرد درحالی که اصالت خانوادگی به مشا حکممی کند با دوراندیشی بیشتری عمل کنید و بهانه به دست او ندهید پس جدا ً از شتاب و عجله پرهیز کنید و با شخصی آگاه و عالم در این باره مشورت کنید که به صلاح شما می باشد زیرا راه طولانی و رقیبان زیادی دارید    \n\n ۲- ویژگی روحی جنابعالی عبارتست از ناآگاه به امور در مواقعی خوش بیان خوش بین بد پیله صلح جو با سلیقه شیک پوش مطلع ثابت قدم سخاوتمند اهل حاشا شوخ و بامزه خودبین زرنگ انتقام جو دلربا  \n\n ۳-  این نیت را با سیاست و حوصله می توانید عمللی سازید مسافر حالش خوبست قدری ا زشما رنجیده پدر و ماد را محبت کنید نذر خود را ادا کنید و سوره مبارکه الرعد را با معنی و حضور قلب بخوانید که گشایش حاصل میشود  \n\n ۴- جواب نیت شما راحافظ دربیت آخر داده و می گوید شگفت نیست که ناهید رامشگر آسمان با سرودی از حافظ حضرت مسیح را در فلک چهارم به وجد و نشاط درآورد و برسماع برانگیزد ";
c15 ="۱- واقعاً خیلی شیفته وشیدای این اندیشه و فکر شده ای به طوریکه قرار وآرام نداری و درهمه احوال به یادو اندیشه او هستی ولی بدان که این نیت اولاً با توکل به خدا ثانیاً با حوصله و شکیبایی حتماً عملی است و جای هیچ گونه نگرانی نمی باشد فقط شما قدری عجله دارید.    \n\n ۲-  شما با تمام حواس متوجه این موضوع و او هستید و همه چیز را فراموش کرده ای ، تمام فکر و اندیشه ات در تسخیر و بدست آوردنش می باشد اما توجه داشته باش که همه با مال و ثروت نرم نمی شوند و شما بیش از اندازه ازمردم انتظار دارید لطفاً قدری توقع خود را پایین بیاور و سعی کن درکسب تحصیل و علام و دانش روز گام برداری که موفق می شوی \n\n ۳- چیزی پیدا می کنید که موجب پیشرفت و خوشحالی شما می شود ، نذری که کرده ای ادا کن واین هفته خوابی خوش می بینی برای کسی تعریف مکن تنها برای آنکه خیلی دوستش داری تعرف کن که لذت ببرد  \n\n ۴-  ";
c16 ="ANS";
c17 ="ANS";
c18 ="ANS";
c19 ="ANS";
c20 ="ANS";
c21 ="ANS";
c22 ="ANS";
c23 ="ANS";
c24 ="ANS";
c25 ="ANS";
c26 ="ANS";
c27 ="ANS";
c28 ="ANS";
c29 ="ANS";
c30 ="ANS";
c31 ="ANS";
c32 ="ANS";
c33 ="ANS";
c34 ="ANS";
c35 ="ANS";
c36 ="ANS";
c37 ="ANS";
c38 ="ANS";
c39 ="ANS";
c40 ="ANS";
c41 ="ANS";
c42 ="ANS";
c43 ="ANS";
c44 ="ANS";
c45 ="ANS";
c46 ="ANS";
c47 ="ANS";
c48 ="ANS";
c49 ="ANS";
c50 ="ANS";

    var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15];
    var num = Math.floor(Math.random() * 15);
    return bank[num]; 
}
// GAME_ETR 
function Game_ETR(){
    var c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,
c25,c26,c27,c28,c29,c30,c31,c32,c33,c34,c35,c36,c37,c38,c39,c40,c41,c42,c43,c44,c45,c46,c47,
c48,c49,c50,c51,c52,c53,c54,c55,c56,c57,c58,c59,c60,c61,c62,c63,c64,c65,c66,c67,c68,c69,c70,
c71,c72,c73,c74,c75,c76,c77,c78,c79,c80,c81,c82,c83,c84,c85,c86,c87,c88,c89,c90,c91,c92,
c93,c94,c95,c96,c97,c98,c99,c100,c101,c102,c103,c104,c105,c106,c107,c108,c109,c110,c111,c112,
c113,c114,c115,c116,c117,c118,c119,c120,c121,c122,c123,c124,c125,c126,c127,c128,c129,c130,c131,
c132,c133,c134,c135,c136,c137,c138,c139,c140,c141,c142,c143,c144,c145,c146,c147,c148,c149,c150,
c151,c152,c153,c154,c155,c156,c157,c158,c159,c160,c161,c162,c163,c164,c165,c166,c167,c168,c169,
c170,c171,c172,c173,c174,c175,c176,c177,c178,c179,c180,c181,c182,c183,c184,c185,c186,c187,
c188,c189,c190,c191,c192,c193,c194,c195,c196,c197,c198,c199,c200;

c1 ="#اعتراف_کنید \n\n دخترم\nبا داداشم سکس ب اجبار داشتم ی سالی میگذشت ب کسی نگفتم بعد دیه ع لج داداشم رفتم ب مامانم گفتم حالا مامانم فک میکنه تقصیر من بوده و ب چش ی جنده نگام میکنه😐🗿 \n\n#پاسخ‌ادمین\n مادرت گوخورد😐😂";
c2 ="#اعتراف_کنید \n\n دخترم16\n رلم 19 سالشه تازه *فهمیدم کیرش در حالت شق 6 سانته. تازه خیلی ادعاشم میشه که اگه اومدی زیرم جر میخوری😔😐 \n\n#پاسخ‌ادمین\n با ۶ سانت نازش نمیکنی چه برسه جر بدی😂😐";
c3 ="#اعتراف_کنید \n\n دخترم ۲۱ سالمه اعتراف میکنم با صاحب کارم دوست هستم دیروز عصر مشتری نبود اون شق کرده بود منم براش ی کم مالیدم خودمم حشری شدم و تو دفتر سکس کردیم (۷ ماه باهمیم دخترونگیم هم اون گرفت ی بارم متاسفانه باردار شدم تو هفته سوم سقطش کردیم) ☹🤦‍♀️ \n\n#پاسخ‌ادمین\n این قسمت کارآفرین خوش شانس😐😂";
c4 ="#اعتراف_کنید \n\n سلام دخترم ۱۸ سالمه \nتا الان سه بار مامان بابام رودر حال سکس دیدم از اون به بعد نمیتونم به بابام دس بزنم حالم ازش بهم میخوره چیکار کنم😂 \n\n#پاسخ‌ادمین\n دخترا راهنماییش کنن فقط😂😐";
c5 ="#اعتراف_کنید \n\n سلام علیکم\n اعتراف میکنم در و باز کردم داداشم و در حال جق دیدم خیلی جدی گفت ریدم تو دهنت در و ببند دور شو\nهیچی دیگه منم دور شدم🦦 \n\n#پاسخ‌ادمین\n 😂😂😂";
c6 ="#اعتراف_کنید \n\n دخترم ۱۹\nاعتراف میکنم  سه تا از رفیق فابای داداشم برام خوردم😔😂  \n\n#پاسخ‌ادمین\n رفیقای کوبص لیس";
c7 ="#اعتراف_کنید \n\n سلام پسر هستم ۱۷ \n یه سوال امروز ظهر خونه خالی بود منم سه دست پشت سر هم با فاصله ۱۰ دقیقه زدم الان (عصر) میبینم تخم چپم هم متورم شده هم درد می‌کنه اصلا نمیتونم راه برم کمکم کنید \n\n#پاسخ‌ادمین\n داش فیل اینجوری میزد ا پا درمیومد 😂😔";
c8 ="#اعتراف_کنید \n\n من یه دختر بیست ساله هستم که همیشه روزی دو یا سه بار رو میزنم. حداقلش همینه. بیشتر هم شده😑\nچکار کنم ترک کنم.حتی وقتی هم که پریودم خود ارضایی رو دارم. \n\n#پاسخ‌ادمین\n توام سپردمت به روانشناس های عزیز چنل😂😔";
c9 ="#اعتراف_کنید \n\n سلام من یه بار خونه داییم بودم بعد داییم رفته بود سر کار با زنداییم داشتیم صبحانه میخوردیم یه دفعه دخترش اومد🤤 منم گرفتم کردمش جلو مامانش انگار مامانش خوشش اومده بود. یه چند دقیقه که گذشت زنداییم هم اومد اونم کردم🗿 \n\n#پاسخ‌ادمین\n شما فک کنم علاقه زیادی به فیلمای پورن خانوادگی داری😂😐";
c10 ="#اعتراف_کنید \n\n اعتراف میکنم پیامارو ک میخوندم فهمیدم چقد پاکم رفتم تخمه بیارم همشونو بخونم🙂 \n\n#پاسخ‌ادمین\n مرسی از توجه تون😐😂";
c11 ="#اعتراف_کنید \n\n سلام اعتراف میکنم شوهر دارم ودوتا دوس پسر دوس پسرامو یکیو واسه پولش میخام یکو واسه کیرش🤧💔 \n\n#پاسخ‌ادمین\n حرمسرای جام جم";
c12 ="#اعتراف_کنید \n\n اعتراف میکنم چند بار خانمم تو مغازه   باجناقم با پسرش مالیندنش یواشکی فکر میکردن من هواسم به اونا نیس \n\n#پاسخ‌ادمین\n این قسمت بیغیرتی:/";
c13 ="#اعتراف_کنید \n\n اعتراف میکنم\nاز سایز کیرم راضی نیستم کوچیکه\nکسی اگه میدونه چیکار کنم بگه 🖤  \n\n#پاسخ‌ادمین\n با گلنار جغ بزن روزی سه وعده بعد از صبحانه ناهار شام 👨🏻‍⚕";
c14 ="#اعتراف_کنید \n\n درود داداش اعتراف میکنم ۹ ماهی میشه که به مادر دبیر شیمیمون علاقه مند شدم🥺\nاگه میتونی از تو چنلت آلتم رو حواله کن تا بلکه روزی برسه به دست و دهان معشوق \n\n#پاسخ‌ادمین\n خانم مادر دبیر بساک براش";
c15 ="#اعتراف_کنید \n\n سلام  17 سالمه دخترم    نامزد دارم \nهروقت می‌خوام خود ارضایی کنم تو ذهنم   سکس شوهرم رو با جاریم  تصور میکنم و ابم میاد  اخه جاریم خلی باسن بزرگی داره 😐😂 \n\n#پاسخ‌ادمین\n جق در فضای تخیلات😮‍💨🤏🏻";
c16 ="#اعتراف_کنید \n\n سلام\nاعتراف نیست یجورایی درخاست کمکه\nمیخام خودکشی کنم اما میترسم که بازم زنده بمونم\nاز ی طرفیم نمیخام ک بگن خودکشی کرد\nچیکار کنم؟(البته من هیچ نیازی به اینکه بهم بگن اینکارو نکن ندارم چون تصمیم جدیه) \n\n#پاسخ‌ادمین\n سمیه نرو:/";
c17 ="#اعتراف_کنید \n\n سلام دخترم \nیه سوال داشتم‌خواهشن جواب بدید\nمن امروز واسه چندمین بار با دوست پسرم سکس مقعدی داشتیم ولی امروز خون بیرون میومد از مقعد دلیلش چیه؟😐 \n\n#پاسخ‌ادمین\n خواهرم شما پاره شدی پارههههه";
c18 ="#اعتراف_کنید \n\n اعتراف میکنم من با 5 تا پسر هستم همزمان گاهی اوقات 3،4 تاشون باهم آن میشه\nچکار کنم شک نکنن 😫 \n\n#پاسخ‌ادمین\n عجب دنیای گوهیه ";
c19 ="#اعتراف_کنید \n\n آقا اعتراف نیست سواله\nشما حوصلتون سر میره چکار میکنید؟؟!\nتو رو خدا به منم بگید\nکمر نمونده واسم، دارم کور میشم / پسرم 🥲🤏 \n\n#پاسخ‌ادمین\n ماهم داریم کور میشیم چاره ای نیس ";
c20 ="#اعتراف_کنید \n\n سلام دخترم۱۹\nاعتراف میکنم هفته ای یکی دوبار رلم با رفیقاش میان گروپ میزنیم\nبقیه روزام جنده پولی شدم خرجمو درمیارم \n\n#پاسخ‌ادمین\n آفرین خوشم اومد دستت تو جیب خودته👨🏼‍🏫";
c21 ="#اعتراف_کنید \n\n عتراف میکنم دخترم ۱۷\nیبار جقی شده بودم با این باد کنک بلندا داشتم میمالیدم ب خدم شب بود درم بسته بود لخته لخت بودم یهو بابام اومد 😐😐این جریان مال ی هفته پیشه از اون روز روم نمیشه تو صورت بابام نگا کنم 😅راه حل بدین😕ناجور الان دلم میخاد ولی ترس دارم 😄😂 \n\n#پاسخ‌ادمین\n خوبه باز این یه قلم باباعه تجاوز نکرده😐😂";
c22 ="#اعتراف_کنید \n\n اعتراف میکنم تاحالا جق نزدم نمیدونم چه حسی دارم اگه حس خوبی داره برم شروع کنم😂 \n\n#پاسخ‌ادمین\n بزن ولی کم ";
c23 ="#اعتراف_کنید \n\n اعتراف میکنم از روزی که ازدواج کردم دیگه پولی نمیدم اخه شوهرم ساپورتم میکنه😌 \n\n#پاسخ‌ادمین\n داداش زنت جندس:/";
c24 ="#اعتراف_کنید \n\n اعتراف میکنم که دخترم ۱۹ خیلی دلم میخاد سکس داشته باشم\nاصلا مردمممم واسش ولی با رلم جوریم که بیچاره فک میکنه‌بی احساسم😂 \n\n#پاسخ‌ادمین\n فک کنم این ازونایی که دوس داره بده موقعیتش نیس ";
c25 ="#اعتراف_کنید \n\n سلام دخترم ۱۷ سالمه\nمیخواستم بدونم اگر پرده پاره بشه چه اتفاقی میوفته و آسیبی ب بدن میزنه؟ \n\n#پاسخ‌ادمین\n نع یکم پاره میشی";
c26 ="#اعتراف_کنید \n\n های.\nدخترم 19\nاعتراف میکنم همین الان دوبار ج*ق زدم سر دومین بار دستم بی حس شده بود😑\nناموسن راهکار بدین بزارمش کنار معتادش شدم از بچگی فک کنم 9،10 ساله بودم میزدم نمیدونستم چیه وقتیم ک فهمیدم معتاد شده بودم هرشب میزنم\nچیکار کنم ترک کنممممم \n\n#پاسخ‌ادمین\n دوستان و پزشکان بزرگ ایران و جهان راهنماییش کنید";
c27 ="#اعتراف_کنید \n\n های چطورید \nمن چند ساله با یکی دوستم من ادم خجالتی هستم و کلا خجالت میکشم راجب سکس رلم فک میکنه من اصلا احساسی نیستم لطفا بگید چیکار کنم خجالتم رفع بشه🥲 \n\n#پاسخ‌ادمین\n ....";
c28 ="#اعتراف_کنید \n\n سلام من ۲۰ سالمه اعتراف میکنم خواهر رفیقمو و زن عمو یکی دیگع از رفیقامو کردم ولی نمیدونن تازه این رفیقمم با زن عمو خودش رابطه داشته نمیدونه ک میدونم و نمیدونه ک هفته ای یه بار خونشونم \n\n#پاسخ‌ادمین\n نمی‌دونم می‌دونه می‌دونه نمی‌دونم میخام بدونم نمیدونه می‌دونم";
c29 ="#اعتراف_کنید \n\n پسرم ۲۶ساله وقتی نه سالم بود دختر عموم بهم تجاوز کرده روز البته الان که بزرگ شدم اونم داف شده چطور میتونم بهش بگم بده بزنیم😁 \n\n#پاسخ‌ادمین\n به نظر من لخت کن بازم بده بهش";
c30 ="#اعتراف_کنید \n\n سلام پسرم 20اعتراف میکنم\nیعنی درواقع نمیدونم چرا هرچی زن شوهرداره میاد سمتم منم\nب این چیزا اعتقاد دارم ولی نمیتونم کنترل کنم یکی دوبار گولم میزنن بعدش ولشون میکنم یکی دیگ میاد گولم میزنه \n\n#پاسخ‌ادمین\n خداوند تورا در آتیش جهنم قرار خواهند داد.";
c31 ="#اعتراف_کنید \n\n اعتراف میکنم من محجبه و چادری هستم هیشکی نمیدونه زیر چادرم چی میگذره شما میدونین؟ \n\n#پاسخ‌ادمین\n قطار شهری 🚅";
c32 ="#اعتراف_کنید \n\n اعتراف میکنم هرچی شوهرم محکم ..... آره میکوبه دردم نمیاد دلیلش چیه؟ \n\n#پاسخ‌ادمین\n واضح نیست واقعا از...... آره زیاده";
c33 ="#اعتراف_کنید \n\n اعتراف میکنم خسه شدم از خانوادم \nخیلی گیر میدن بهم نمیزارن از خونه دربیام برم بیرون \nدوست دارم بزارم از خونمون برم\nدخترم18 \n\n#پاسخ‌ادمین\n نزن از خونه بیرون فردا ج میشی و افسوس میخوری خاهرم👳🏻‍♂";
c34 ="#اعتراف_کنید \n\n سلام من پسرم\nو ۱۴ سالمه بعضی وقتا خیلی حشری میشم ولی نمیخوام جق بزنم چه کنم \n\n#پاسخ‌ادمین\n کون بده";
c35 ="#اعتراف_کنید \n\n دخترم اعتراف میکنم\n15 سالمه و میخوام زیر خواب همه بشم ولی حتی نمیتونم از خونه تهنا برم بیرون خانواده مذهبی دارم \n\n#پاسخ‌ادمین\n زیر خواب همه بشی ینی چی آها زیرانداز بشی";
c36 ="#اعتراف_کنید \n\n سلام دخترم...\nآقا من پریروز  ج.ق زدم تازه ار.ضاهم نشدم در حد مالیدن بود فقط\nبعد الان دو روزه کمرم‌گرفته بزور از جام پا میشم دردش جوریه که موقع پاشدن حس میکنم دارم از وسط نصف میشم کم‌مونده بشینم‌گریه کنم دیگه..\nراهکاری دارین؟ \n\n#پاسخ‌ادمین\n ادمین سکوت میکند!";
c37 ="#اعتراف_کنید \n\n اعتراف ندارم\n¹⁴ سالمه تو مدرسه ایی که هستم حتی مدیرم به بچه های گدا توهین میکنه برای همین با رفیقام یه اکیپ ¹⁰ نفره تشکیل دادیم و اخر هفته با اجازه مامان و بابامون میریم برای اون بچه ها اسباب بازی و غذا و...\nمیبریم حتی باهاشون درس کار میکنیم  بار ها مسخرمون کردن اما من دلم میخاد اون بچه ها خوشحال باشن 🥲🫀🫂   \n\n#پاسخ‌ادمین\n احسنت خداوند اجرت بدهد";
c38 ="#اعتراف_کنید \n\n سلام پسرم ۲۰ هفته ای ۳ بار رلمو میکنم ۴ روز باقیمونده روزی یبار جق میزنم نمیتونم تحمل کنم دلیلش چیه چه کنم حشریم😂 \n\n#پاسخ‌ادمین\n مواظب باش خودت خودتو نکنی";
c39 ="#اعتراف_کنید \n\n دخترم 18 سالمه اعتراف میکنم 13 سالگی ازدواج کردم 😂 \n\n#پاسخ‌ادمین\n خوشبخت بشی";
c40 ="#اعتراف_کنید \n\n اعتراف میکنم نون سوخته بجا تریاک دادم عموم کشید تا دو روز نعشه بود دم به دم زنگ میزنه میگه ساقی این جنسارو زنده میخام😂😂😂 \n\n#پاسخ‌ادمین\n ریدممم😂😂";
c41 ="#اعتراف_کنید \n\n اعتراف میکنم هزار بار دیدم پدرم داشته ننمو جر میداده :) بعد تازه ی بار داشت کصشو میخورد بدون در رفتم تو 😂😔 \n\n#پاسخ‌ادمین\n لابد بعد بابات گفت پسرم کجا میای برو من شام بخورم میام";
c42 ="#اعتراف_کنید \n\n اعتراف میکنم پسر عموم 14 سالشه هرموقع خوابم میاد کیرشو میماله ب کونم حالت تلمبه میزنه میگ عجب کون بزرگی😐😂چکار کنمممم!!!!!؟ \n\n#پاسخ‌ادمین\n یه کون بده بهش تموم بشه بره";
c43 ="#اعتراف_کنید \n\n دخترم ۲۰\nفانتزیم اینه دست شوهرم همیشه تو شورت و سوراخام باشه🙈 در عوض منم همیشه واسش بخورم\nولی  قصد ازدواج ندارم نمیتونم عملیش کنم،دوس پسرم نمیخوام😑 \n\n#پاسخ‌ادمین\n یعنی خوده خری";
c44 ="#اعتراف_کنید \n\n اعتراف میکنم دیشب مهمونی بودم دورهم داشتیم میگفتیمو می خندیدیم یهو گوزیدم😂😐 خاستم طبیعی کنم گفتم بچه ها گرم شده گفتن اره چارتا گوز دیگه بزن سرد بشه ا خجالت آب شدم😂😂😂 \n\n#پاسخ‌ادمین\n واقعا اینجور گوزای بی موقع منم رسوا کرده برا شمام اتفاق افتاده😂😂؟";
c45 ="#اعتراف_کنید \n\n سلام من از جلو رابطه داشتم ولي حلقوي بودم از كجا بفهمم پاره شدم يا نه كسي ميدونه كامنت بزاره ممنون 💚 \n\n#پاسخ‌ادمین\n حلقوی ینی چی😐";
c46 ="#اعتراف_کنید \n\n سلام پسرم ۲۲ امروز داشتم میرفتم نون وایی بعد وقتی دست نون واعرو دیدم هورنی شدم آیا من گی ؟ خودمم رل دارم ولی خیلی دست خوبی داشت ... \n\n#پاسخ‌ادمین\n این مدلیشو ندیده بودم ولی داداش شاید دستش خمیری بوده حشریت کرده😂😐";
c47 ="#اعتراف_کنید \n\n اعتراف میکنم یبار سر داگی ناخونم شکست👩🏻‍🦯 \n\n#پاسخ‌ادمین\n محکم تلمبه نزنید پسرا دخترا مجروح میشن";
c48 ="#اعتراف_کنید \n\n اعتراف میکنم یه روز ک سوار اسنپ بودیم تو ماشین از اکسم داشتم لب میگرفتم که یهو راننده از اینه ماشین دید و دعوا مون کرد و بسیار سر افکنده شدیم😂😔 \n\n#پاسخ‌ادمین\n اوضاع خیته:/";
c49 ="#اعتراف_کنید \n\n اعتراف میکنم دخترم \nبا داداشم هرشب دوتایی جق میزنیم\nخیلی حال میده😂😐💔 \n\n#پاسخ‌ادمین\n رفاقت بین خاهر و برادر ینی این😐😂";
c50 ="#اعتراف_کنید \n\n دخترم..\n۶.۷ بار ی جاده رو رانندگی کرد منم اون پایین میخوردم براش ( تقریبا نیم ساعت) ابش اومد و کل هیکلش ب گند کشیده شد😁\nولی خیلی خوب بود سرمو نگه میداشت 20c تا ته حلقم میرفت🤤 \n\n#پاسخ‌ادمین\n پسرا خیلیاتون..... آره همون جقتو بزن پسر😂😐";

    var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,
        c25,c26,c27,c28,c29,c30,c31,c32,c33,c34,c35,c36,c37,c38,c39,c40,c41,c42,c43,c44,c45,c46,c47,
        c48,c49,c50];
    var num = Math.floor(Math.random() * 33);
    return bank[num]; 
}
// GAME_CHL
function Game_CHL(){
    var c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,
    c25,c26,c27,c28,c29,c30,c31,c32,c33,c34,c35,c36,c37,c38,c39,c40,c41,c42,c43,c44,c45,c46,c47,
    c48,c49,c50,c51,c52,c53,c54,c55,c56,c57,c58,c59,c60,c61,c62,c63,c64,c65,c66,c67,c68,c69,c70,
    c71,c72,c73,c74,c75,c76,c77,c78,c79,c80,c81,c82,c83,c84,c85,c86,c87,c88,c89,c90,c91,c92,
    c93,c94,c95,c96,c97,c98,c99,c100,c101,c102,c103,c104,c105,c106,c107,c108,c109,c110,c111,c112,
    c113,c114,c115,c116,c117,c118,c119,c120,c121,c122,c123,c124,c125,c126,c127,c128,c129,c130,c131,
    c132,c133,c134,c135,c136,c137,c138,c139,c140,c141,c142,c143,c144,c145,c146,c147,c148,c149,c150,
    c151,c152,c153,c154,c155,c156,c157,c158,c159,c160,c161,c162,c163,c164,c165,c166,c167,c168,c169,
    c170,c171,c172,c173,c174,c175,c176,c177,c178,c179,c180,c181,c182,c183,c184,c185,c186,c187,
    c188,c189,c190,c191,c192,c193,c194,c195,c196,c197,c198,c199,c200;

    c1 = "عکس شناسنامتو به اشتراک بزار 😁";
    c2 = "آیا تا به حال رختخوابت را خیس کرده ای؟ آخرین بار کی بوده است؟";
    c3 = "اگر غول چراغ جادو داشته باشی سه آرزویت چه خواهد بود؟";
    c4 = "بدترین زمانی که تلفن همراهت زنگ خورده چه زمانی بوده است؟";
    c5 = "یه جوک چرت بگو ؟";
    c6 = "عکس شناسنامتو به اشتراک بزار 😁";
    c7 = "آیا تا به حال پیش آمده از جایی بالا بروی و نتوانی پایین بیایی؟";
    c8 = "بزرگترین ترس زندگیت چیه ؟";
    c9 = "به آشپزیت از یک تا ده چند میدی ؟؟";
    c10 = "جرئت داری یه روز گوشیتو بدون رمز بزاری تو خونه ؟";
    c11 = "چیزی که تو اون اصلا خوب نیستی و روت نمیشه بگی به کسی چیه ؟";
    c12 = "ترجیح می دهی به گذشته سفر کنی یا به آینده؟";
    c13 = "تا حالا تو جایی گوزیدی که آبروت بره ؟ 😁";
    c14 = "تصور غلطی که مردم ازت دارن ؟";
    c15 = "آیا تا به حال پیش آمده از جایی بالا بروی و نتوانی پایین بیایی؟";
    c16 = "آیا تا به حال شده چیزی را بشکنی و به کسی نگویی یا فرار کنی؟";
    c17 = "تا به حال به کسی گفتی زیپش باز است یا لباس زیرش مشخص است؟";
    c18 = "یه اسکرین از صفحه اصلی تلگرامت بده 😁";
    c19 = "دوست داشتی جای کی باشی";
    c20 = "تصور غلطی که مردم ازت دارن ؟";
    c21 = "سن دقیقتو بگو ؟";
    c22 = "یه اسکرین از آخرین چتت بده";
    c23 = "آخرین بار که دست داخل بینی ات کردی کی بود؟";
    c24 = "تا به حال به کسی گفتی زیپش باز است یا لباس زیرش مشخص است؟";
    c25 = "سوالی که دوست داری پاسخ دهی اما کسی از تو نمی پرسد چیست؟";
    c26 = "اگر یک روز کامل به جنس مخالفت تبدیل شوی چه می کنی؟";
    c27 = "سه بار تند بگو گاز دوغ دار دوغ گاز دار ویسشو بفرست";
    c28 = "سه بار تند بگو گاز دوغ دار دوغ گاز دار ویسشو بفرست";
    c29 = "جالب ترین هدیه ای که دریافت کرده ای چه بوده است؟";
    c30 = "زیباترین اتفاق زندگیت";
    c31 ="💜بی مزه ترین خاطره زندگیت؟😒";
    c32 ="💜منفی ترین فرد زندگیت؟😒";
    c33 ="💜چه کسی با حرفاش میرینه تو اعصابت تعریف کن";
    c34 ="💜مثبت۱۸ ترین فیلمی که دیدی با کی بوده؟";
    c35 ="💜یه عکس از لباسی که الان تنت بده";
    c36 ="💜اسم یکی رو بگو که دوست داری باهاش به خوابی غیر از رل یا کراش یا عشق!؟😂";
    c37 ="💜یه کیک داری یه کی.ر رو کدوم میشنی کدومو میخوری؟";
    c38 ="💜برادر و خواهر همسن خودت داری مجبوری یا با یکی لز کنی یا یکی سکس کدوم؟";
    c39 ="💜تاحالا آب ارضایی خودتو خوردی؟😵";
    c40 ="💜یکی از کار های که میری رو مخ بقیه؟";
    c41 ="💜باهام ازداوج میکنی؟ ";
    c42 ="💜تو گپ رو کی کراشی راستشو جدی بگو!";
    c43 ="💜اگه س.کس کنی بفهمی خودت یا طرف مقابلت حامله اس چیکار میکنی؟";
    c44 ="💜تاحالا سینه های کسی رو مالیدی؟🤤";
    c45 ="💜تاحالا دست به ک.یر/ک.ص کسی زدی؟";
    c46 ="💜تا حالا لز/گی انجام دادی؟😂";
    c47 ="💜تاحالا کسی رو انگشت کردی؟🤣";
    c48 ="💜بدترین بلایی که سر معلمت آوردی؟";
    c49 ="💜خاطره بدی که از مدرسه داری؟";
    c50 ="💜تاحالا رو بهترین دوستت حشری شدی؟";
    c51 ="💜عکس از سابقه سرچ گوگلت بده!😝";
    c52 ="💜کونی ترین آدمی که تاحالا تو عمرت دیدی؟";
    c53 ="💜جنسیتت عوض شه چیکار میکنی؟🤔";
    c54 ="💜تاحالا چک سکسی به کسی زدی؟";
    c55 ="💜تاحالا تحقیر شدی؟ (تعریف کن)😏";
    c56 ="💜پیوی یکی برو بهش بگو خیلی وقته عاشقتم و میخوام الان بگم!😂";
    c57 ="💜آهنگ مورد علاقه ات رو با ویس بخون بفرست!";
    c58 ="💜بین سفر به تایلند یا کانادا کدوم؟ و چرا؟";
    c59 ="💜احساس خوشبختی میکنی؟😂";
    c60 ="💜کالاف یا پابجی؟😢";
    c61 ="💜لب گرفتن دوست داری؟🤤";
    c62 ="💜تاحالا فال گوش وایسادی؟ کی؟🤨";
    c63 ="💜اگه سفره یه طرف به مریخ انتخاب بشی و یه نفر رو با خودت میتونی ببری اون کیه؟😍";
    c64 ="💜تاحالا خیانت دیدی؟یا خیانت کردی؟😔";
    c65 ="💜اگه به دنیا اومدنت دست خودت بود تو کدوم کشور دنیا میومدی؟";
    c66 ="💜ایران بهترین کشور دنیا؟😐😂";
    c67 ="💜بزرگترین ترس زندگیت چیه؟ تعریف کن";
    c68 ="💜سلبریتی ک دوست داری باهاش رابطه جنسی برقرار کنی؟";
    c69 ="💜آخرین باری که از ته دل گریه کردی؟";
    c70 ="💜اگر قدرتمند ترین فرد زمین بودی چیکار میکردی؟";
    c71 ="💜بزرگترین فرقی که بین دختر و پسر میزارن تو جامعه چیه؟";
    c72 ="💜تعریفت از عشق چیه؟";
    c73 ="💜علاقه پاک یا رابطه جنسی؟";
    c74 ="💜سه تا ملاکت برای ازدواج بگو!😉";
    c75 ="💜خواهر یا برادر؟";
    c76 ="💜بچه دوست داری از خودت؟";
    c77 ="💜گی جذابتره یا لز برات؟";
    c78 ="💜اسم اولین رل یا عشق زندگیت؟ 🤣";
    c79 ="💜از گپ راضی هستی؟😎";
    c80 ="💜ک.یر یا ک.ص دوست داری؟🤤";
    c81 ="💜بازی کردن با دل آسونه؟";
    c81 ="💜تاحالا وابسته کسی شدی؟";
    c82 ="💜اگه پیشم بودی چیکار میکردی؟😁";
    c83 ="💜تاحالا رابطه فیزیکی داشتی باجنس مخالف؟";
    c84 ="💜تاحالا سیگار یا چیزی دیگه ای کشیدی؟";
    c85 ="💜ماشین زمان داشتی به گذشت سفر میکردی یا آینده و چرا؟ 😳";
    c86 ="💜ورزش مورد علاقه ت؟🤔";
    c87 ="💜به یکی پیشنهاد ازداوج بده!😄";
    c88 ="💜عدد مورد علاقه ات؟ چرا؟";
    c89 ="💜تاحالا کسی باهات بچه بازی کرده؟😂";
    c90 ="💜تو فامیل با کی زیاد حال میکنی؟";
    c91 ="💜از یکی از اعضای بدنت عکس بده!💙";
    c92 ="💜بزرگترین اشتباه زندگیت؟😱";
    c93 ="💜یه جا گیر میوفتی و واسه آزاد شدنت باید یا رابطه با کسی که بدت میاد ازش برقرار کنی بکشیش کدوم؟";
    c94 ="💜بازی با PC یا موبایل؟";
    c95 ="💜رمز خوشبختی؟🤔";
    c96 ="💜سکس چت تاحالا کردی؟";
    c97 ="💜سکس واقعی تاحالا کردی؟😂";
    c98 ="💜کدومش رو مخه؟ سابیدن ظرف با دست یا سابیدن دو چیز فلزی بهم؟😬";
    c99 ="💜تاحالا کارگری کردی؟ تعریف کن!😊";
    c100 ="💜عکس از پاچه هات بده پی!😐😂";
    c101 ="💜عکس دستاتو بده پی!😐😂";
    c102 ="💜تاحالا ک.یر باباتو دیدی؟😃";
    c103 ="💜اگر ی روز خیلی بدبخت بشی برای کمک گرفتن پیش چ کسی میری (سه نفر)";
    c104 ="💜بزرگترین هدفت که رسیدن بهش تقریبا غیر ممکنه چیه؟ تعریف کن؟🤔";
    c105 ="💜هدفت واسه زندگی چیه؟";
    c106 ="💜اگه امشب آخرین شبت باشه چه چیزی واسه آخرین بار بهم میگی؟";
    c107 ="💜ننگ ترین کار زندگیت؟";
    c108 ="💜تا به حال به خودکشی فکر کردی؟";
    c109 ="💜سه نفر ک دوست داری باهاشون بری بهشت رو نام ببر؟";
    c110 ="💜دوست داری چجوری بمیری؟";
    c111 ="💜1میلیارد پول بهت میدن ب جای اینکه ی شب رابطه جنسی برقرار کنی؟";
    c112 ="💜:تاحالا سک.س کسی رو دیدی؟";
    c113 ="💜لب دریا یا تو جنگ س.ک.س می‌چسبه؟🤤";
    c114 ="💜سه روز کوه میکنی یا سه ساعت پیش آدمی که بدت میاد میمونی؟😂";
    c115 ="💜بدترین خاطره کودکیت چیه؟😢";
    c116 ="💜الگو زندگیت کیه؟";
    c117 ="💜شرم آور ترین موجود تو اتاقت چیه؟😂";
    c118 ="💜بزرگترین حسرت زندگیت چیه؟";
    c119 ="💜خاله یا عمه ؟🙃";
    c120 ="💜عمو یا دایی؟🙂";
    c121 ="💜سکسی ترین خاطره زندگیت؟😂🤤";
    c122 ="💜به اندازه عدد این سوال بگو دوست دارم😂";
    c123 ="💜یه ویس بده بگو Oh با دهن بسته 😂💙";
    c124 ="💜تاحالا خود ارضایی کردی؟ یا بهش فکر کردی؟ 🤤😂 تعریف کن";
    c125 ="💜تاحالا رو کسی که دوستش داری یا کراشی حشری شدی؟😂";
    c126 ="💜تتلو یا یاس؟";
    c127 ="💜دوست داشتن رو معنی کن!";
    c128 ="💜لیسیدن ک.ص پریود شده یا کی.ر چرکیدع‌؟";
    c129 ="💜دوست داری تو ایران زندگیت رو ادامه بدی یا بری قبایل آفریقا؟ 😐";
    c130 ="💜بیا پی مخمو بزن!";
    c131 ="💜حیوان مورد علاقه ات؟";
    c132 ="💜تاحالا با بچه ها بازی کردی؟🤣";
    c133 ="💜خشک دوس داری یا چرب؟";
    c134 ="💜مالیدن و ب کردن ترجیح میدی؟";
    c135 ="💜از انگشت فاکت عکس بده!😂";
    c136 ="💜تخم مرغ بزن به سرت عکس بده!";
    c137 ="💜به بابات بگو من زن/شوهر میخوام😂";
    c138 ="💜به کدوم اعضای بدنت افتخار میکنی؟ چرا";
    c139 ="💜دلت واسه کی تنگ شده؟";
    c140 ="💜بزرگترین آرزو زندگیت؟";
    c141 ="💜تاریخ تولدت؟";
    c142 ="💜من برات مهم هستم ؟";
    c143 ="💜تاحالا عاشق شدی؟ تعریف کن";
    c144 ="💜چقدر به عشق اعتماد داری؟";
    c145 ="💜یه چیزی درمورد من بگو! 😊";
    c146 ="💜در عوض ۲۰ میلیون پول حاضری موهاتو بزنی؟";
    c147 ="💜اسم رل یا کراشت";
    c148 ="💜کاری کردی تاحالا تا الان عذاب وجدان داشته باشی؟ تعریف کن";
    c149 ="💜چند بار رل زدی؟ اسم هاشونو بگو";
    c150 ="💜با رلت بیرون رفتی تاحالا؟ ";
    c151 ="💜تا حالا لخت کسی رو دیدی؟ جنس مخالف";
    c152 ="💜تاحالا دست به ک.یر / ک.ص رفیقت زدی؟😂😂";
    c153 ="💜بی مزه ترین خاطره زندگیت؟😒";
    c154 ="💜منفی ترین فرد زندگیت؟😒";
    c155 ="ANS";
    c156 ="ANS";
    c157 ="ANS";
    c158 ="ANS";
    c159 ="ANS";
    c160 ="ANS";
    c161 ="ANS";
    c162 ="ANS";
    c163 ="ANS";
    c164 ="ANS";
    c165 ="ANS";
    c166 ="ANS";
    c167 ="ANS";
    c168 ="ANS";
    c169 ="ANS";
    c170 ="ANS";
    c171 ="ANS";
    c172 ="ANS";
    c173 ="ANS";
    c174 ="ANS";
    c175 ="ANS";
    c176 ="ANS";
    c177 ="ANS";
    c178 ="ANS";
    c179 ="ANS";
    c180 ="ANS";
    c181 ="ANS";
    c182 ="ANS";
    c183 ="ANS";
    c184 ="ANS";
    c185 ="ANS";
    c186 ="ANS";
    c187 ="ANS";
    c188 ="ANS";
    c189 ="ANS";
    c190 ="ANS";
    c191 ="ANS";
    c192 ="ANS";
    c193 ="ANS";
    c194 ="ANS";
    c195 ="ANS";
    c196 ="ANS";
    c197 ="ANS";
    c198 ="ANS";
    c199 ="ANS";
    c200 ="ANS";
    var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,
        c25,c26,c27,c28,c29,c30,c31,c32,c33,c34,c35,c36,c37,c38,c39,c40,c41,c42,c43,c44,c45,c46,c47,
        c48,c49,c50,c51,c52,c53,c54,c55,c56,c57,c58,c59,c60,c61,c62,c63,c64,c65,c66,c67,c68,c69,c70,
        c71,c72,c73,c74,c75,c76,c77,c78,c79,c80,c81,c82,c83,c84,c85,c86,c87,c88,c89,c90,c91,c92,
        c93,c94,c95,c96,c97,c98,c99,c100,c101,c102,c103,c104,c105,c106,c107,c108,c109,c110,c111,c112,
        c113,c114,c115,c116,c117,c118,c119,c120,c121,c122,c123,c124,c125,c126,c127,c128,c129,c130,c131,
        c132,c133,c134,c135,c136,c137,c138,c139,c140,c141,c142,c143,c144,c145,c146,c147,c148,c149,c150,
        c151,c152,c153,c154];
    var num = Math.floor(Math.random() * 154);
    return bank[num];
   }
// formatcht
function formatchat(type,value){
    if(type == 'state'){
        var header = 'Ⲷ #وضعیت'+'\n\n';
        var main = value+'\n';
        var footer = '─┅━━━━ ⚠ ━━━━┅─';
        return (header+main+footer);
    }
    if(type == 'Omen'){
        var header = 'Ⲷ #فال'+'\n\n';
        var main = value+'\n';
        var footer = '─┅━━━━ ⚛ ━━━━┅─';
        return (header+main+footer);
    }
    if(type == 'Confess'){
        var header = 'Ⲷ #اعتراف'+'\n\n';
        var main = value+'\n';
        var footer = '─┅━━━━ ⛔ ━━━━┅─';
        return (header+main+footer);
    }
    if(type == 'Challenge'){
        var header = 'Ⲷ #چالش'+'\n\n';
        var main = value+'\n';
        var footer = '─┅━━━━ ☢ ━━━━┅─';
        return (header+main+footer);
    }
    if(type == 'DATE'){
        var header = 'Ⲷ #تاریخ'+'\n\n';
        var main = value+'\n';
        var footer = '─┅━━━━ ⏰ ━━━━┅─';
        return (header+main+footer);
    }
    if(type == 'Statistics'){
        var header = 'Ⲷ #آمار'+'\n\n';
        var main = value+'\n';
        var footer = '─┅━━━━ ␟ ━━━━┅─';
        return (header+main+footer);
    }
    if(type == 'validate'){
        var header = 'Ⲷ #احراز_هویت'+'\n\n';
        var main = value+'\n';
        var footer = '─┅━━━━ೊ ━━━━┅─';
        return (header+main+footer);
    }
    if(type == 'start'){
        var header = 'ربات با موفقیت بر  روی گپ نصب شد'+'\n';
        var main = "گوگولی هستم ֍_֍"+'\n\n';
        main += "راهنما"+'\n';
        var footer = '─┅━━━━ ␀ ━━━━┅─';
        return (header+main+footer);
    }
}

