function message_reply(value){
    var d1,d2,d3,d4,d5,d6,d7,d8,d9,d10,d11,d12,d13,d14,d15,d16,d17,d18,d19,d20,d21,d22,d23,d24,
d25,d26,d27,d28,d29,d30,d31,d32,d33,d34,d35,d36,d37,d38,d39,d40;
    var c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,
c25,c26,c27,c28,c29,c30,c31,c32,c33,c34,c35,c36,c37,c38,c39,c40;
d1="سلام"; 
d2="صلاممم"; 
d3="شلامم"; 
var bank = [d1,d2,d3,]; 
for(var i = 0;i < bank.length;i++){ 
     var an = search(value , bank[i]); 
     if(an){ 
         c1=" شلاااااام"; 
         c2=" گوه نخوررر"; 
         var bank = [c1,c2,]; 
       var num = Math.floor(Math.random() * 2); 
       var ANS = bank[num]; 
       return ANS; 
    } 
}
    d1 ="ربات";
    d2 ="بات";
    d3 ="robat";
    d4 ="robot";
    var bank = [d1,d2,d3,d4];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="عشقم اسم دارم  بوگو گوگولی";
            c2 ="ربات اسم دارع 🙂 گوگولیم";
            c3 ="گوگولی 😔 بوگو گوگولی";
            c4 ="ای بابا میگم اسمم گوگولیه";
            c5 ="😂یکی بهش بگه من گوگولیم";
            var bank = [c1,c2,c3,c4,c5];
            var num = Math.floor(Math.random() * 5);
            var ANS = bank[num];
            return ANS;
        }
    }
    
    d1 ="خوبی";
    d2 ="خبی";
    d3 ="چطوری";
    d4 ="khb";
    var bank = [d1,d2,d3,d4];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="خبم مرسی❤";
            c2 ="اره اشقم 😙";
            c3 ="ب ت چ🤣🤣";
            c4 ="یسسس😂💔";
            c5 ="ارع گوگولی خوبه";
            c6 ="😕نمیگم";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }

  
    
    d1="اصل بده"; 
    d2="اصل بنواز"; 
    d3="اصل بنال"; 
    d4="اصلت"; 
    var bank = [d1,d2,d3,d4,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="گاه نخور عشقام ک نمگم"; 
            c2="دو روزمه!"; 
            c3="دو سه ماهمه😂😑😐"; 
            c4="نمیدونم درباره این اطلاعاتی ندارم😐😂"; 
            c5="ععاا مح رل دارم مزاحم نشوو"; 
            c6="روم کراشی؟!😂😐"; 
            c7="توع گوه خوری؟"; 
            c8="۱۱ ماهمه😂😐"; 
            c9="یسالم شد دیروز:)"; 
            c10="دوسالم میشه فردا:)🤣"; 
            c11="عا مح ب ت یکی نمیگممم"; 
            c12="ب ت چ😂🤣"; 
            c13="نمیگمممم😂🤣😅"; 
            c14="دو ماهمههه🤣😂"; 
            c15="الان سه ماهمه😂😂😍"; 
            c16="رفتم توع چهار ماه😐"; 
            c17="اطلاعات نمیدم بهت:/"; 
            c18="تو کی بودی؟"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,]; 
            var num = Math.floor(Math.random() * 18); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
        
    d1 ="اصل";
    d2 ="اثل";
    var bank = [d1,d2];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="دو ماهمه:/";
            c2 ="ایران /  دست چپ / مستقیم / تو کونت🤣😂✋";
            c3 ="ب ت چ🤣🤣";
            c4 ="سه ماهمه:)";
            c5 ="الان چهار ماهمه😂😐";
            c6 ="نمیگم بسوزی😂";
            c7 ="محل زندگی : ایران دست چپ مستقیم تو کونت🤣😂✋";
            c8 ="نمیدونم بخودا😕";
            c9 ="ایران در قرمزه";
            c10 ="یسالم شد";
            c11 ="الان هشت ماهمه:///";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }    
    d1 ="چخبر";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="سلامتی";
            c2 ="هیچ نشستم ب چت نگا میکنم😔";
            c3 ="خبر سلامتییی";
            c4 ="نمیگم 😔💩💔";
            c5 ="نمیدونم حافظم پاک شده🥺";
            var bank = [c1,c2,c3,c4,c5];
            var num = Math.floor(Math.random() * 5);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 ="این";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="این نع شما😐";
            c2 ="این این نکن واس منااا😡";
            c3 ="از این خشم نمیاد:/";
            c4 ="اینم آدمه؟😐";
            c5 ="ینی این ادمه🙄";
            c6 ="چقد این شبیه ادماس🙄 \n\ 😂🤣 ";
            c7 ="ینی این ادمه🙄";
            var bank = [c1,c2,c3,c4,c5,c6,c7];
            var num = Math.floor(Math.random() * 5);
            var ANS = bank[num];
            return ANS;
        }
    }
    
    
    d1 ="میکنی";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="نمیدونم حافظم گم شدع😔";
            c2 ="خیلی چیزا میکنم😄";
            c3 ="میکنم میکنم🤤";
            c4 ="هیچی نمیخوام بکنم🤧";
            c5 ="میکنم میکنم آن که برادرم کرد";
            c6 ="جون ط فقط بوگو بکن🤤";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }

    
    d1 ="کنم";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="نکن🤣😂";
            c2 ="خو بکن😐";
            c3 ="بکن بکن🗿";
            c4 ="نکن تلوخدا🥺";
            c5 ="کن کن کی بودی ط😂💔";
            c6 ="جون تو فقط بکن";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }    
    d1 ="کی";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="کیر😂🥺";
            c2 ="کیر😐";
            c3 ="🗿";
            c4 ="🤩😬کیر؟";
            c5 ="😐اطلاعات نمیدم😑ایش پفیوز";
            c6 ="😐اطلاعات نمیدم😑ایش پفیوز";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 ="گاگولی";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="😐";
            c2 ="گوگول😑";
            c3 ="گوگول😬";
            c4 ="گوگول😕";
            c5 ="😂💔عوضی";
            var bank = [c1,c2,c3,c4,c5];
            var num = Math.floor(Math.random() * 5);
            var ANS = bank[num];
            return ANS;
        }
    }

    d1 ="خش اومدی";
    d2 ="خش";
    d3 ="خوش";
    d4 ="خش اومدی";
    d5 ="خووش اومدی";
    d6 ="خووش  اومدی";
    d7 ="خوش  اومدی";
    d8 ="خش  اومدی";
    var bank = [d1,d2,d3,d4,d5,d6,d7,d8];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="مرسی عزیزم😘";
            c2 ="مرسی خشگلش🙃";
            c3 ="😘🤣😂";
            c4 ="میدونم😂😂";
            c5 ="مرسییی💝";
            c6 ="فدات❤";
            c7 ="اره اره عشقم میدونم😂";
            var bank = [c1,c2,c3,c4,c5,c6,c7];
            var num = Math.floor(Math.random() * 7);
            var ANS = bank[num];
            return ANS;
        }
    }

    d1 ="نیستم";
    d2 ="نیسم";
    var bank = [d1,d2];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="خب نباش 😂😂";
            c2 ="باشع:/";
            c3 ="باشه عشقم😍😂";
            c4 ="😂😐نیستی؟";
            c5 ="ب کیر دوستان گپ🤣💔";
            c6 ="نیستی:(";
            c7 ="خب ب عن سگم😐";
            c8 ="باشه😂";
            c9 ="خب ب عن سگم😐";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9];
            var num = Math.floor(Math.random() * 9);
            var ANS = bank[num];
            return ANS;
        }
    }

    d1 ="ارع";
    d2 ="اره";
    d3 ="ار";
    var bank = [d1,d2,d3];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="باشه😂";
            c2 ="اره زهر مار🤣";
            c3 ="ارع ارع و زهر مار😐💔";
            c4 ="خب ب عنم😂😐";
            c5 ="باشه باشه😂😐";
            c6 ="ب عنم";
            c7 ="خب ب عن سگم😐😂";
            var bank = [c1,c2,c3,c4,c5,c6,c7];
            var num = Math.floor(Math.random() * 7);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 ="نع";
    d2 ="نه";
    d3 ="ناح";
    var bank = [d1,d2,d3];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="نه نه  نکن😕";
            c2 ="نه نه نکن دیگه🥺";
            c3 ="نع نع و زهر مار😐💔";
            c4 ="نع ؟ همین؟🥺";
            c5 ="عنم";
            c6 ="ب عن سگم😐😂";
            c7 ="باشه😂";
            c8 ="خب چی کنم الان من؟";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
            var num = Math.floor(Math.random() * 8);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 =":joy:";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="جون ط فقط بخند";
            c2 ="دندوناشوو😔چقد سفیده \n\ دیگه کجاهات سفیده؟ ";
            c3 ="😘🤣😂";
            c4 ="ط بخند جانم ک خنده‌ات .... یادم رفت😐";
            c5 ="😘🤣😂";
            c6 ="😅😅😂";
            c7 ="😘🤣😂";
            c8 ="🤣🤣";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
            var num = Math.floor(Math.random() * 8);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 =":neutral_face:";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="😐😐";
            c2 ="😐";
            c3 ="😘🤣😂";
            c4 ="😐";
            c5 ="😐";
            c6 ="😅😅😂";
            c7 ="😘🤣😂";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
            var num = Math.floor(Math.random() * 8);
            var ANS = bank[num];
            return ANS;
        }
    }

    
    d1 ="گوگولی";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="جااانم😍😍😍";
            c2 ="😍😍جانم";
            c3 ="عشقم 😍";
            c4 ="چیه؟؟";
            c5 ="ها";
            c6 ="بله";
            c7 ="جان";
            c8 ="اوم اینجام";
            c9 ="جوننن";
            c10 ="✋";
            c11 ="فدات جانم";
            c12 ="بوس بهت";
            c13 ="به به";
            c14 ="به به😂😂";
            c15 ="چطوری خوشگله";
            c16 ="خوبی";
            c17 ="چطوری جیگر گوگولی";
            c18 ="چطوری 😍";
            c19 ="به به خبی";
            c20 ="چطوری";
            c21 ="😂✋";
            c22 ="🤣✋";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22];
            var num = Math.floor(Math.random() * 22);
            var ANS = bank[num];
            return ANS;
        }
    }
         d1 ="نریپ حست نی ";
         d2 ="یکی حرفای اینو برام ترجمه کنه🙄😐☝";
         d3 ="گوه نخور";
         d4 ="ممدم همینو میگفت جناب";
         d5 ="حق باتوعه";
         d6 ="ببند";
         d7 ="باشعع:/";
         d8 ="نمیفهممممم😭 ";
         d9 =" :/ ";
         d10 ="No information 😆🤣 \n\ کیر شد🤣";
         d11 ="بهت نمیگم ک رباتم و نميفهمم چی میگی😉😐✋";
         d12 ="No information 😆🤣 \n\ کیر شد🤣";
         d13 ="No information 😆🤣 \n\ کیر شد🤣";
         d14 =" نمی فهممت  ";
         d15 ="ببند لطفا😐🙌 ";
         d16 ="چقد این شبیه ادماس🙄";
         d17 ="ینی این ادمه🙄";
         d18 ="حیف خری و من با خرا نمی حرفم 😐✌😂";
         d19 ="یکی حرفای اینو برام ترجمه کنه🙄😐☝";
         d20 ="نميفهمم چی میگی🥺";
         d21 ="نمیفهممممم😭";
         d22 ="الان یاید چی بگم😐";
        var bank = [d1,d2,d3,d4,d5,d6,d7,d8,d9,d10,d11,d12,d13,d14,d15,d16,d17,d18,d19,d20,d21,d22];
        var num = Math.floor(Math.random() * 22);
        var ANS = bank[num];
        return ANS;
}

function search(value , sh){
    var result = value.search(sh);
    if(result !== -1){
        return true;
    }
    return false;
}

