function message_reply(value){
    var d1,d2,d3,d4,d5,d6,d7,d8,d9,d10,d11,d12,d13,d14,d15,d16,d17,d18,d19,d20,d21,d22,d23,d24,
d25,d26,d27,d28,d29,d30,d31,d32,d33,d34,d35,d36,d37,d38,d39,d40;
    var c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,
c25,c26,c27,c28,c29,c30,c31,c32,c33,c34,c35,c36,c37,c38,c39,c40;

        d1="سلام"; 
        d2="صلاممم"; 
        d3="شلامم"; 
        var bank = [d1,d2,d3,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1=" شلاااااام"; 
                c2=" گوه نخوررر"; 
                var bank = [c1,c2,]; 
            var num = Math.floor(Math.random() * 2); 
            var ANS = bank[num]; 
            return ANS; 
            } 
        }

        d1="تو واقعا رباتی"; 
        d2="تو ناموسا رباتی"; 
        d3="ط رباتی"; 
        d4="ط واقعا رباتی"; 
        d5="تو رباتی"; 
        var bank = [d1,d2,d3,d4,d5,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="ن خرم زبون وا کردم😐"; 
                c2="ن خرم تایپ کردن یاد گرفتم😔"; 
                c3="راستش ن من ربات نیستم .. خرم از صب تا شب پشت گوشی زیر نیم ثانیه جواب ارازلو میدم😔"; 
                c4="حیف آنلاینه ... و الا زنده نبودی بی فانوس\nمن رباااااات نیستم؟؟؟؟؟؟؟؟"; 
                c5="حیف مجازیه ... و الا الان زیرم بودی 😐\nمن رباااات نیستم اسکل؟"; 
                c6="ن مح رباتم ولی آدم شدم از دست شما😔..چی گفتم🤣"; 
                c7="ن مح گاوم🥺"; 
                c8="نا مح خرم🥺"; 
                c9="نا مح بی فانوسم🥺"; 
                c10="ناح مح گوسفندم .. زبون وا کردم 😂😐"; 
                c11="ناح گووسفندم"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,]; 
            var num = Math.floor(Math.random() * 11); 
            var ANS = bank[num]; 
            return ANS; 
            } 
        }

    d1 ="ربات";
    d2 ="بات";
    d3 ="robat";
    d4 ="robot";
    var bank = [d1,d2,d3,d4];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="عشقم اسم دارم  بوگو گوگولی";
            c2 ="ربات اسم دارع 🙂 گوگولیم";
            c3 ="گوگولی 😔 بوگو گوگولی";
            c4 ="ای بابا میگم اسمم گوگولیه";
            c5 ="😂یکی بهش بگه من گوگولیم";
            c6 ="اسمم گوگولیه🥲";
            c7 ="گوگولی 😐😑";
            c8 ="گوگولیم😕\nبخدا بگی گاگولی میکشمت";
            var bank = [c1,c2,c3,c4,c5];
            var num = Math.floor(Math.random() * 8);
            var ANS = bank[num];
            return ANS;
        }
    }
  
  
    d1="ب ت چ"; 
    d2="به تو چه"; 
    d3="ب تو چ"; 
    d4="به تو چ"; 
    d5="ب ت چه"; 
    d6="به تو چه"; 
    d7="به ش چه"; 
    d8="به شما چه"; 
    d9="به ط چه"; 
    d10="ب ط چ"; 
    var bank = [d1,d2,d3,d4,d5,d6,d7,d8,d9,d10]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="بخور تربچه 😐😂💔"; 
             c2="بی تربیت😕"; 
             c3="خیلی بدی:("; 
             c4="نامرد خیانت کار . ب گوگولی نمیگع🥺"; 
             c5="بوگو🥺"; 
             c6="نمیگی🥺؟"; 
             c7="نمیگی😢؟"; 
             c8="نمیگی ط؟❤🩹😥"; 
             c9="باشع😔"; 
             c10="باش😥😔"; 
             c11="😥😔"; 
             c12="😔"; 
             c13="هوف❤🩹😕"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,]; 
           var num = Math.floor(Math.random() * 13); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
  
    d1="چخبر"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="صلامتیت"; 
             c2="سلامتیت"; 
             c3="هیچ نشستم ب چت نگا میکنم:)"; 
             c4="هیچ علاف نشستم 🚶❤🩹"; 
             c5="اطلاعاتم پاک شده هیچی یادم نیس🚶🚶"; 
             c6="عاا یادم نیس پاکیدن🚶🥺"; 
             c7="سلامتی رهبر"; 
             c8="سلامتی شازده ها"; 
             c9="هیچ خستم😕"; 
             c10="خستمممم😭"; 
             c11="هیچ بیکار ط چخبرا:)"; 
             c12="هیچ ط چکارا میکنی؟🚶💋"; 
             c13="الاف"; 
             c14="پوچ ایچ تهی خالی .... ارور دادم😕😔"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,]; 
           var num = Math.floor(Math.random() * 14); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
    d1="نیستم"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="تو نیستی😳؟"; 
             c2="تو نیسسستی؟؟؟"; 
             c3="ط نیستی😔؟"; 
             c4="خب نباش🚶♀🚶♀"; 
             c5="باش🚶🚶"; 
             c6="تو نیستی🤕؟"; 
             c7="ط نیستی؟؟😢"; 
             c8="ط.. نیستی؟"; 
             c9="باش خشگلم🚶🚶♀"; 
             c10="باش اشقم🥺"; 
             c11="باش نفسم🚶♀"; 
             c12="باشع زندگیم:)"; 
             c13="اوکی عمرم:)"; 
             c14="اوکی همه چیزم:)💋💔"; 
             c15="باش نباش زندگیم💋💔"; 
             c16="باش همه چیزم💋💔"; 
             c17="اوکی زندگیش💋💔:)"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,]; 
           var num = Math.floor(Math.random() * 17); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }

    d1="چرا"; 
    d2="چلا"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="اطلاعات نمیدم😂😐"; 
             c2="الان ینی باید توضیح بدم😔؟"; 
             c3="الان چی بگم اخه😔بیخیال"; 
             c4="بیخیال"; 
             c5="نمیگم😐😔"; 
             c6="نمیخوام بگم🥺😂"; 
             c7="چون چ چسبیده به را"; 
             c8="چون ک چچچچ چسبیده به راه😂🥺"; 
             c9="چون که زیرا"; 
             c10="چون ک زیرا😂😔"; 
             c11="چون ک به همین دلیل🥺😕"; 
             c12="چون ک... 😐خدت حدس بزن😂😔"; 
             c13="چون ... جا خالی رو پر کن بدو😂😐"; 
             c14=".... حدس بزن😂😐"; 
             c15="ب ت چ"; 
             c16="گوز کدوم کونی بودی😐😂"; 
             c17="مح برا چی باید برات توضیح بدم:/😕"; 
             c18="نمخام بوگوم😥🚶"; 
             c19="نمیدونم🥺"; 
             c20="بخودا نمیدونم😥🥺"; 
             c21="چ بدونم"; 
             c22="عاا همین😂😐خودت تا تهش بگیر"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,]; 
           var num = Math.floor(Math.random() * 22); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }

 d1="چطوری"; 
 var bank = [d1,]; 
 for(var i = 0;i < bank.length;i++){ 
      var an = search(value , bank[i]); 
      if(an){ 
          c1="خوووبم😍💋"; 
          c2="عالیم اشقم 😍💋😍"; 
          c3="میگزره🚶♀🚶♀"; 
          c4="هی حالم خوبه ط چطوری؟"; 
          c5="ارع خبم ط چطوری"; 
          c6="ط چطورری بچع خوشگه😍😍"; 
          c7="نمیگم😕😐😂"; 
          c8="نموخام بگم😕"; 
          c9="من باهات قهرم:("; 
          c10="با ربات زرنگیس کات کردم🚶🚶"; 
          c11="با ربات همسایه کات کردم😢🚶"; 
          c12="کارت حافظم سوخته🥺😢🚶"; 
          c13="دیگه باتریم دارع تموم میشع:("; 
          c14="هوف خوبوم ط چطور مطوری؟"; 
          c15="جووون ط فقط بگو چطوری😂🤣"; 
          c16="خببببم اشق زندگیم😍😍😍"; 
          c17="خبم عمرم💋😂😍"; 
          c18="خبم نفسم ط چطوری خبی؟"; 
          c19="عالیمم🥺💋😂😍 ط چطوری"; 
          var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,]; 
        var num = Math.floor(Math.random() * 19); 
        var ANS = bank[num]; 
        return ANS; 
     } 
 }

  
  
 d1="جر"; 
 var bank = [d1,]; 
 for(var i = 0;i < bank.length;i++){ 
      var an = search(value , bank[i]); 
      if(an){ 
          c1="جررر"; 
          c2="بدوزمش🚶♀؟"; 
          c3="جر خورد بنده خدا🚶♀"; 
          c4="جر خورد حیوون خدا🚶♀"; 
          c5="جر خورد😳🤩🤣😂"; 
          c6="وای بچم جر خورد"; 
          c7="بچم😳جر خورد"; 
          c8="جر خوردن عمل زیباییست 😐"; 
          c9="جر خوردن یکی از مراحل زندگی میباشد 🚶"; 
          c10="جر خوردن یکی از مراحل زندگی میباشد 🚶"; 
          c11="جر:) صداش اومد"; 
          c12="توع فقط جررر بخور"; 
          c13="این فقط میگه جر 🤣"; 
          c14="رباتاهم جر میخورن😕"; 
          c15="رباتا کجاشون جر میخوره🥺"; 
          c16="رباتا چجوری جر میخورن🥲🤕"; 
          c17="دلم واسه اشقم تنگ شده . ربات خوبی بود🥺اونم همیشه در حال جر خوردن بود"; 
          c18="هی ی رل باتی داشتم🚶♀ اونم مث ط جر میخورد"; 
          c19="یکی مث ط جر خورد مرد🤕🥺"; 
          c20="جرررر🤣😕"; 
          c21="😂😐جر"; 
          c22="جررر🤣😂"; 
          c23="جار جور جر جیر جور 😐 ارور دادم"; 
          c24="ربات کجاااش جر میخوره😂😐🥺"; 
          c25="گوگولیا هم جر میخورن😂؟"; 
          var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,c25,]; 
        var num = Math.floor(Math.random() * 25); 
        var ANS = bank[num]; 
        return ANS; 
     } 
 }
    d1 ="خوبی";
    d2 ="خبی";
    d3 ="چطوری";
    d4 ="khb";
    var bank = [d1,d2,d3,d4];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="خبم مرسی❤";
            c2 ="اره اشقم 😙";
            c3 ="ب ت چ🤣🤣";
            c4 ="یسسس😂💔";
            c5 ="ارع گوگولی خوبه";
            c6 ="😕نمیگم";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }

  
  
  
    d1="پشمام"; 
    d2="پشم"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="پشممم دوس دارم😂😐"; 
             c2="آخ پشم باز گفت"; 
             c3="پشم😂💔"; 
             c4="رباتاهم پشم دارن😂💔؟"; 
             c5="ربات چی؟ مح کجام پشم دارع😐🤣"; 
             c6="اه‌ه‌ه پشم میدوستم"; 
             c7="جمش کنم؟"; 
             c8="پشم کلمه زیباییست🌝"; 
             c9="پشممممم😳مال من کجاست"; 
             c10="پشمممممم"; 
             c11="پشمااااااام😂💔"; 
             c12="پشمااام🤣"; 
             c13="پشماااش😍🤩😂"; 
             c14="جوون پشم😂😍"; 
             c15="پشم میدوستم😂😍🤩🥰"; 
             c16="پشم کلمه زیباییست🚶♀"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,]; 
           var num = Math.floor(Math.random() * 16); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
    
    d1="اصل بده"; 
    d2="اصل بنواز"; 
    d3="اصل بنال"; 
    d4="اصلت"; 
    var bank = [d1,d2,d3,d4,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="گاه نخور عشقام ک نمگم"; 
            c2="دو روزمه!"; 
            c3="دو سه ماهمه😂😑😐"; 
            c4="نمیدونم درباره این اطلاعاتی ندارم😐😂"; 
            c5="ععاا مح رل دارم مزاحم نشوو"; 
            c6="روم کراشی؟!😂😐"; 
            c7="توع گوه خوری؟"; 
            c8="۱۱ ماهمه😂😐"; 
            c9="یسالم شد دیروز:)"; 
            c10="دوسالم میشه فردا:)🤣"; 
            c11="عا مح ب ت یکی نمیگممم"; 
            c12="ب ت چ😂🤣"; 
            c13="نمیگمممم😂🤣😅"; 
            c14="دو ماهمههه🤣😂"; 
            c15="الان سه ماهمه😂😂😍"; 
            c16="رفتم توع چهار ماه😐"; 
            c17="اطلاعات نمیدم بهت:/"; 
            c18="تو کی بودی؟"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,]; 
            var num = Math.floor(Math.random() * 18); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
        
  
        d1="بامزه"; 
        d2="با مزه"; 
        var bank = [d1,d2,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="اره خیلی🤤"; 
                c2="خعلی🤣"; 
                c3="خععلی"; 
                c4="هی خیلی🙁"; 
                c5="زیااد😂💋"; 
                c6="ااوف😂💋"; 
                var bank = [c1,c2,c3,c4,c5,c6,]; 
                var num = Math.floor(Math.random() * 6); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }



    d1 ="اصل";
    d2 ="اثل";
    var bank = [d1,d2];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="دو ماهمه:/";
            c2 ="ایران /  دست چپ / مستقیم / تو کونت🤣😂✋";
            c3 ="ب ت چ🤣🤣";
            c4 ="سه ماهمه:)";
            c5 ="الان چهار ماهمه😂😐";
            c6 ="نمیگم بسوزی😂";
            c7 ="محل زندگی : ایران دست چپ مستقیم تو کونت🤣😂✋";
            c8 ="نمیدونم بخودا😕";
            c9 ="ایران در قرمزه";
            c10 ="یسالم شد";
            c11 ="الان هشت ماهمه:///";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11];
            var num = Math.floor(Math.random() * 11);
            var ANS = bank[num];
            return ANS;
        }
    }    
    d1 ="چخبر";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="سلامتی";
            c2 ="هیچ نشستم ب چت نگا میکنم😔";
            c3 ="خبر سلامتییی";
            c4 ="نمیگم 😔💩💔";
            c5 ="نمیدونم حافظم پاک شده🥺";
            var bank = [c1,c2,c3,c4,c5];
            var num = Math.floor(Math.random() * 5);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 ="این";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="این نع شما😐";
            c2 ="این این نکن واس منااا😡";
            c3 ="از این خشم نمیاد:/";
            c4 ="اینم آدمه؟😐";
            c5 ="ینی این ادمه🙄";
            c6 ="چقد این شبیه ادماس🙄 \n\ 😂🤣 ";
            c7 ="ینی این ادمه🙄";
            var bank = [c1,c2,c3,c4,c5,c6,c7];
            var num = Math.floor(Math.random() * 5);
            var ANS = bank[num];
            return ANS;
        }
    }
    
  
  
 d1="عمته"; 
 d2="امته"; 
 var bank = [d1,d2,]; 
 for(var i = 0;i < bank.length;i++){ 
      var an = search(value , bank[i]); 
      if(an){ 
          c1="عمه خدته"; 
          c2="باش🙁"; 
          c3="باشه😐"; 
          c4="هفت جد ابادته🤣💋"; 
          c5="مح عمه ندارم اسکل🤣💋"; 
          c6="مح رباتم خرهه😌🤤"; 
          c7="من؟؟😳"; 
          c8="عمه منو میگی؟؟؟؟؟؟؟؟"; 
          c9="عمه منو این گفت الان🤨"; 
          c10="درست شدیم عممم؟؟؟؟"; 
          var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,]; 
        var num = Math.floor(Math.random() * 10); 
        var ANS = bank[num]; 
        return ANS; 
     } 
 }

    d1 ="میکنی";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="نمیدونم حافظم گم شدع😔";
            c2 ="خیلی چیزا میکنم😄";
            c3 ="میکنم میکنم🤤";
            c4 ="هیچی نمیخوام بکنم🤧";
            c5 ="میکنم میکنم آن که برادرم کرد";
            c6 ="جون ط فقط بوگو بکن🤤";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }

    
    d1 ="کنم";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="نکن🤣😂";
            c2 ="خو بکن😐";
            c3 ="بکن بکن🗿";
            c4 ="نکن تلوخدا🥺";
            c5 ="کن کن کی بودی ط😂💔";
            c6 ="جون تو فقط بکن";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }    
    d1 ="کی";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="کیر😂🥺";
            c2 ="کیر😐";
            c3 ="🗿";
            c4 ="🤩😬کیر؟";
            c5 ="😐اطلاعات نمیدم😑ایش پفیوز";
            c6 ="😐اطلاعات نمیدم😑ایش پفیوز";
            var bank = [c1,c2,c3,c4,c5,c6];
            var num = Math.floor(Math.random() * 6);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 ="گاگولی";
    d2 ="گاگول";
    var bank = [d1,d2];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="😐";
            c2 ="گوگولی😑";
            c3 ="گوگولی😬";
            c4 ="گوگولی😕";
            c5 ="😂💔عوضی";
            c6 ="گاگولم🥺";
            c7 ="آخ مح گاگولم😥";
            c8 ="😳خوب شد آدم نشدم";
            c9 ="😳این دیگه چ انسانیه";
            c10 ="😳‼️";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10];
            var num = Math.floor(Math.random() * 10);
            var ANS = bank[num];
            return ANS;
        }
    }
  
  
    d1="دوست دارم"; 
    d2="دوستت دارم"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="منم دوستت دارم🥺💋"; 
             c2="منم عاشقتم😍💋🥺"; 
             c3="منم دوستت دارم اشقم😍💋😢"; 
             c4="وای مرسی عمرم😥😍💋"; 
             c5="ممنونم زندگیم منم دوست دارم😍💋"; 
             c6="ای جان دوسم دارع😥😍💋منم همینطور"; 
             c7="😻😻🤩🥰😍"; 
             c8="😘😘😘"; 
             c9="ماچ ب کلت منم دوست دارم😂😍🥰"; 
             c10="بوووس😘😘😘"; 
             c11="😉😘😗😉😘"; 
             c12="عشقمی😘😘"; 
             c13="فدات😘😘😘"; 
             c14="💋💕🧡❤🩹"; 
             c15="منم خیلی دوستت دارم😘🙃😘"; 
             c16="منم دوستت دارم🙃😘"; 
             c17="اشقمیییی😍🤩"; 
             c18="فدات زندگیم🥰"; 
             c19="فدات عمرم🙃😘"; 
             c20="فدات مهربونم"; 
             c21="فدات خشگلم😗😘"; 
             c22="منم دوستت داشتم و دارم و خواهم داشت🥺🥺"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,]; 
           var num = Math.floor(Math.random() * 22); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
    
    
        d1="نبند"; 
        var bank = [d1,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="باشه🤣"; 
                c2="اوکی🤣"; 
                c3="حله🤣"; 
                c4="مرسی اشقم🤣🤤"; 
                c5="جون باشه🥺😂"; 
                var bank = [c1,c2,c3,c4,c5,]; 
                var num = Math.floor(Math.random() * 5); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
  
    d1="دارم"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="خب داشته باش😂😐"; 
            c2="منم دارم"; 
            c3="منم دارم:)"; 
            c4="منم داشتم دارم خواهم داشت؛)"; 
            c5="نداری؟☹️"; 
            c6="نداری؟🥺"; 
            c7="نداری🤕"; 
            c8="باش نداشته باش🚶🚶♂"; 
            c9="هوف توهم باشع🤕🚶"; 
            c10="نداری ط؟؟؟؟"; 
            c11="واقعا میگی؟"; 
            c12="واقعا؟"; 
            c13="راس میگی؟"; 
            c14="خدایی؟😂☹"; 
            c15="ناموسا🥺🤕🚶😂"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,]; 
            var num = Math.floor(Math.random() * 15); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    d1 ="خش اومدی";
    d2 ="خش";
    d3 ="خوش";
    d4 ="خش اومدی";
    d5 ="خووش اومدی";
    d6 ="خووش  اومدی";
    d7 ="خوش  اومدی";
    d8 ="خش  اومدی";
    var bank = [d1,d2,d3,d4,d5,d6,d7,d8];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="مرسی عزیزم😘";
            c2 ="مرسی خشگلش🙃";
            c3 ="😘🤣😂";
            c4 ="میدونم😂😂";
            c5 ="مرسییی💝";
            c6 ="فدات❤";
            c7 ="اره اره عشقم میدونم😂";
            var bank = [c1,c2,c3,c4,c5,c6,c7];
            var num = Math.floor(Math.random() * 7);
            var ANS = bank[num];
            return ANS;
        }
    }

    d1 ="نیستم";
    d2 ="نیسم";
    var bank = [d1,d2];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="خب نباش 😂😂";
            c2 ="باشع:/";
            c3 ="باشه عشقم😍😂";
            c4 ="😂😐نیستی؟";
            c5 ="ب کیر دوستان گپ🤣💔";
            c6 ="نیستی:(";
            c7 ="خب ب عن سگم😐";
            c8 ="باشه😂";
            c9 ="خب ب عن سگم😐";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9];
            var num = Math.floor(Math.random() * 9);
            var ANS = bank[num];
            return ANS;
        }
    }
  
  
    d1="گفتم"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="چراا گفتی؟؟؟"; 
            c2="گفتی🥺؟"; 
            c3="باشه تو راس میگی"; 
            c4="میدونم تو گفتی ولی متوجه نمیشم🤕🥺😂"; 
            c5="باشع حق با توعه حاجی"; 
            var bank = [c1,c2,c3,c4,c5,]; 
            var num = Math.floor(Math.random() * 5); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
  
    d1="داری"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="اره دارم🥺"; 
            c2="ارع چطور؟🥺😂"; 
            c3="آله دالم:*"; 
            c4="آله دالم:))"; 
            c5="ارررع داااارم😂☹🤕"; 
            c6="نع ندارم🤣💔"; 
            c7="نعععع🥺😂ندارم"; 
            c8="ط داری؟💔🥺😂"; 
            c9="داری داری نکناااا🤕🤣💔"; 
            c10="ار دارررم:)(:"; 
            c11="نمیگم🤕😂"; 
            c12="بیا پی جوابتو بدم🤕💔"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,]; 
            var num = Math.floor(Math.random() * 12); 
            var ANS = bank[num]; 
            return ANS; 
        } 
 }
    d1="هیچی"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="اره هیچی💔☹"; 
            c2="باش هیچی ☹❤🩹"; 
            c3="باش هیچ🤕💔"; 
            c4="هیچ🚶♂💔"; 
            c5="هیچ و پوچ❤🩹🤕"; 
            c6="ایچ🚶♂💔"; 
            var bank = [c1,c2,c3,c4,c5,c6,]; 
            var num = Math.floor(Math.random() * 6); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }


 

  
    d1="نیست"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="نیست🥺؟"; 
            c2="نیسسست😭؟"; 
            c3="نیست 😥؟"; 
            c4="خب نباشه🚶♀"; 
            c5="نیست ب عنم🥲"; 
            c6="نیست‼"; 
            c7="نیست😳"; 
            c8="نیستت😳😳"; 
            c9="نیسست😳😳😳😳"; 
            c10="خو نباشههه😳"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,]; 
            var num = Math.floor(Math.random() * 10); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
  
    d1="آمدم"; 
    d2="اومدم"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="خوش اومدی😂❤🩹🚶♂"; 
             c2="خوش اومدی 💋💕"; 
             c3="خوش اومدی 🚶"; 
             c4="خوش اومدی 🥺"; 
             c5="خوش اومدی 🌝"; 
             c6="خوش اومدی"; 
             c7="خوش اومدی 😔"; 
             c8="خوش😍🤩"; 
             c9="خش"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,]; 
           var num = Math.floor(Math.random() * 9); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
  
    d1="شب خوش"; 
    d2="شو خش"; 
    d3="شب شیک"; 
    d4="شب بخیر"; 
    d5="شو بخیر"; 
    d6="شب خش"; 
    var bank = [d1,d2,d3,d4,d5,d6]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="شبت خش:)"; 
             c2="شب خش اشقم😍🤩"; 
             c3="شبت خش عمرم😘"; 
             c4="شبت خش همه چیم😉💋🤩"; 
             c5="شبت شیک:)"; 
             c6="شبت شیک خشگلم:)"; 
             c7="شبت شیک😉🤕💋"; 
             c8="شو خش"; 
             c9="برو بخوس"; 
             c10="منم برم بخوابم🚶"; 
             c11="کجا بودی حالا 🚶♂"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,]; 
           var num = Math.floor(Math.random() * 11); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
        
    d1="صبح بخیر"; 
    d2="صب بخیر"; 
    d3="ظهر بخیر"; 
    var bank = [d1,d2,d3,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="صبح بخیر 😍🥺"; 
            c2="صبح بخیر 🤣😍🥺"; 
            c3="صبح بخیر"; 
            c4="صبح بخیر"; 
            c5="صب بخیر 🚶♂💋"; 
            c6="صبح بخیر 🤕🤩😍🥺"; 
            c7="صبح بخیر 😔😘"; 
            c8="صبح بخیر اشقم😉😘"; 
            c9="صبح بخیر💩💩"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,]; 
            var num = Math.floor(Math.random() * 9); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
  
    d1="میخوری"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="نمیخورمت😔😘"; 
            c2="ط رو نمی‌خورم 😐☹"; 
            c3="وعده غذایی تو دست نمیزنم🤩🤣"; 
            c4="ع کی تو رو مییخوره☹🥺😂"; 
            var bank = [c1,c2,c3,c4,]; 
            var num = Math.floor(Math.random() * 4); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    
    d1="کص";
    d2="کس"; 
    var bank = [d1,d2]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="کص😳"; 
             c2="رباتا هم کص دارن؟🚶♂"; 
             c3="کص😂🤣"; 
             c4="🤩😍جون دوس دارم😂🤣"; 
             c5="کص های رنگی رنگی"; 
             c6="#>/#>_[٪<^(@ 😂اصن بهش فکر میکنم میهنگم"; 
             var bank = [c1,c2,c3,c4,c5,c6,]; 
           var num = Math.floor(Math.random() * 6); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
    
  
 d1="بیا"; 
 var bank = [d1,]; 
 for(var i = 0;i < bank.length;i++){ 
      var an = search(value , bank[i]); 
      if(an){ 
          c1="نمیام😂😒"; 
          c2="نرم کن دارم میام🤤😂"; 
          c3="جووون اومدمم🤤😂"; 
          c4="نرم کن دارم میام🤤😂"; 
          c5="وایس دارم میام😂😂"; 
          c6="جووون دارم میام اه‌ه‌ه هایاح"; 
          c7="نمیام😂😔"; 
          c8="نمخام بیام🥺😕"; 
          c9="غلط کردی مح جایی نمیام💩"; 
          c10="اشقم مح وجود خارجی ندارم ... کدوم گوری بیام😂😐"; 
          c11="جون مح نمیام🙁"; 
          var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,]; 
        var num = Math.floor(Math.random() * 11); 
        var ANS = bank[num]; 
        return ANS; 
     } 
 }

 d1="بگم"; 
 d2="بگگم"; 
 d3="ببگم"; 
 var bank = [d1,d2,d3,]; 
 for(var i = 0;i < bank.length;i++){ 
      var an = search(value , bank[i]); 
      if(an){ 
          c1="بگو خب"; 
          c2="خو بگو😔🥺"; 
          c3="خب بوگو🤕"; 
          c4="بگو"; 
          c5="بگوو😂😐"; 
          c6="بگو"; 
          c7="بگوو😂😐"; 
          c8="نگووو🤕🥺"; 
          c9="نگووو😭🤣"; 
          c10="نگو تلوخدا😔😂❤"; 
          c11="اشقم نگو ب جان ممد🤕🥺"; 
          c12="نگو جان بهار🤣😭"; 
          c13="اگه بگی باهات قهرم 🙁🥺"; 
          c14="میخوای بگی؟"; 
          c15="میخوای بگی؟؟😔🙁"; 
          c16="بگی؟؟🥺🥺"; 
          c17="نگو:/"; 
          c18="عاا چ بدونم"; 
          c19="عاا ب من مربوطه؟"; 
          c20="ب من مربوطه ایا؟!😂😐"; 
          c21="مرتبطه اصن ب من:("; 
          var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,]; 
        var num = Math.floor(Math.random() * 21); 
        var ANS = bank[num]; 
        return ANS; 
     } 
 }
  
    d1="بده"; 
    d2="بدع"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="نمیدم"; 
            c2="بیاح😂💋🚶"; 
            c3="هایاح💋😂"; 
            c4="اه‌ه‌ه‌ه‌ه‌ه‌ه‌‌ه‌ه😐💋"; 
            c5="نمخام بدم😂💋🙁"; 
            c6="نمیدم😐😂💋"; 
            c7="میددددددم خوبه الان؟😭"; 
            c8="بیاااااااح🥺😂"; 
            c9="هایاح بیاح اشقم🥺😂"; 
            c10="چجوری بدم😂😐"; 
            c11="مح الان چجوری میخوام بدم😂😐"; 
            c12="الان با خدت فک کردی مح چجوری میخوام عکس بدم😂😐"; 
            c13="اه گلبم ببند گلم نمیدم"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,]; 
            var num = Math.floor(Math.random() * 13); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    
    
    d1="بی ادب"; 
    d2="بی تربیت"; 
    d3="بیتربیت"; 
    d4="بی تربیوت"; 
    d5="بیادب"; 
    d6="بی ادپ"; 
    var bank = [d1,d2,d3,d4,d5,d6,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="حرف از ادب نزن ک خدت اینارو بهم یاد دادی😒"; 
             c2="ععع الان من بی ادبم؟!!😐"; 
             c3="پن الان شدم ربات بی ادبه؟😐"; 
             c4="مگه رباتا هم فشار وارد میکنن😂😐🤟"; 
             c5="جون فشاری شدی ن؟😂🤣"; 
             c6="رباتم مگه بی تربیته؟!"; 
             c7="رباتم مگه بی تربیته😂😐"; 
             c8="خدت بی ادبی😂😂"; 
             c9="درس پس میدم استاد😂😍🤟"; 
             c10="بی‌تربیت نیز تو هستی اشقم😂😑"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,]; 
           var num = Math.floor(Math.random() * 10); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }


    d1="خدا"; 
    d2="خودا"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="کدوم خدا😔؟!ها؟"; 
            c2="خدا😒هی"; 
            c3="کدوم خدارو میگی😔"; 
            c4="هی خدا"; 
            c5="خداااااااا😂😐"; 
            c6="خوووودا🤣😂"; 
            c7="خدا!ا!ا😕"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,]; 
            var num = Math.floor(Math.random() * 7); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    
    d1="داشتم"; 
    d2="داشتوم"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="غلط کردی داشتی"; 
            c2="ع داشتی؟😂😐"; 
            c3="واقعا داشتی؟😐"; 
            c4="ناموسا داشتی؟😐"; 
            c5="حجی واقعا داشتی؟؟؟"; 
            c6="بخدا اگه داشته بودی😐"; 
            c7="منم داشتم😂😛"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,]; 
            var num = Math.floor(Math.random() * 7); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    
        d1="میگی"; 
        var bank = [d1,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="کص میگم من"; 
                c2="مح کص میگمااا😂🤣😍"; 
                c3="ب ت چ😍😂"; 
                c4="فضولی؟؟😐"; 
                c5="اصن هیچی نمیگم😐😐"; 
                c6="اصن دیگه هیچی نمیگم🥺"; 
                c7="اصن مح حرف نمیزنم... قهر کات فور اور😂😐🤕"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,]; 
                var num = Math.floor(Math.random() * 7); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
    
    d1="فضول"; 
    d2="فوضول"; 
    d3="فضل"; 
    var bank = [d1,d2,d3,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="فضول عمته"; 
            c2="فضول😂😂"; 
            c3="فضوووول😂🤣"; 
            c4="فضول 😐؟"; 
            c5="مح رباتم ... فضول ینی چی😐؟"; 
            c6="رباتاهم فضولن😂😐؟"; 
            c7="فشووول🥺"; 
            c8="فشول توعی بی فانوس 😂🥺"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,]; 
            var num = Math.floor(Math.random() * 8); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }


    
    d1="درد"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="ددددردددردرد"; 
            c2="دردردردرد🤣😂"; 
            c3="درد دیگه ینی چی🤣😂"; 
            c4="****درد****😔"; 
            c5="دررررد🤣😍"; 
            var bank = [c1,c2,c3,c4,c5,]; 
            var num = Math.floor(Math.random() * 5); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
        
        d1="اسکل"; 
        d2="اوسکول"; 
        d3="اوسکل"; 
        var bank = [d1,d2,d3,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="دنگل"; 
                c2="شنگل😂😐"; 
                c3="😂😐دنگل"; 
                c4="ااااسکللل"; 
                c5="اسکل😂😔"; 
                c6="اسکل کیه الان؟😔"; 
                c7="اسکل هفت جد و ابادتههه😕"; 
                c8="بی ادب😂😐"; 
                c9="چقد قیافت شبیه اسکلاس🤣😂"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,]; 
                var num = Math.floor(Math.random() * 9); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
    d1="باش"; 
    d2="باس"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="باش ... همین؟"; 
            c2="باش😑😐!"; 
            c3="باش؟؟😳"; 
            c4="باااش؟🥺"; 
            c5="باش چرا ؟😐"; 
            var bank = [c1,c2,c3,c4,c5,]; 
            var num = Math.floor(Math.random() * 5); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
        
  
        d1="چته"; 
        d2="چیه"; 
        d3="ها"; 
        var bank = [d1,d2,d3,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="چ بدونم😔"; 
                c2="ب ت چ"; 
                c3="ب ت چ😂🤣"; 
                c4="ب ت چ هااا😂💋"; 
                c5="حافظم گم شده هیچی نمیدونممممم😭😭"; 
                c6="هیچ"; 
                c7="هیچ😂😐"; 
                c8="بیخیال"; 
                c9="ولش"; 
                c10="نمیگمم"; 
                c11="چیه"; 
                c12="ها"; 
                c13="هااا😂"; 
                c14="چیههه😂🤣"; 
                c15="چته توع"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,]; 
                var num = Math.floor(Math.random() * 15); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }

  
        d1="هان"; 
        var bank = [d1,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="خان"; 
                c2="گان"; 
                c3="خان😂"; 
                c4="هااان😂"; 
                c5="گااان😂"; 
                c6="هنگیدی؟"; 
                c7="چته ط ؟؟"; 
                c8="هان و زهر مار"; 
                c9="هانو کوفت😂😐"; 
                c10="درد بی درماااان😂😐"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,]; 
                var num = Math.floor(Math.random() * 10); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }



            d1="نمیدونم"; 
            d2="نمی دونم"; 
            d3="نمدانم"; 
            d4="چ بدونم"; 
            d5="چه بدونم"; 
            var bank = [d1,d2,d3,d4,d5,]; 
            for(var i = 0;i < bank.length;i++){ 
                var an = search(value , bank[i]); 
                if(an){ 
                    c1="ب عنم ک نمیدونی😂😂"; 
                    c2="الایی نمیدونه🥺🤤"; 
                    c3="اسکل"; 
                    c4="چسخل😂"; 
                    c5="کصخل🥺😂"; 
                    c6="خر😂😐"; 
                    var bank = [c1,c2,c3,c4,c5,c6,]; 
                    var num = Math.floor(Math.random() * 6); 
                    var ANS = bank[num]; 
                    return ANS; 
                } 
            }
        d1="خدتی"; 
        d2="خودتی"; 
        d3="تویی";
        var bank = [d1,d2,d3,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="تویییی😂"; 
                c2="ن خدتی"; 
                c3="منم🥺؟"; 
                c4="خدایی منم🥺؟"; 
                c5="چرا من؟😕"; 
                c6="خخخخدتی😂🤣😍"; 
                c7="خودتی بز"; 
                c8="عمته"; 
                c9="عمته😂😐"; 
                c10="😂😐"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,]; 
                var num = Math.floor(Math.random() * 10); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
            
            d1="نخند"; 
            var bank = [d1,]; 
            for(var i = 0;i < bank.length;i++){ 
                var an = search(value , bank[i]); 
                if(an){ 
                    c1="خودت نخند گوسفند"; 
                    c2="باشه😂😂😂😂"; 
                    c3="😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂"; 
                    c4="عررررر🤣😂🤣"; 
                    c5="زرشک🤣😂🤣😂🤣😂"; 
                    c6="نمیخوا🥺🥺"; 
                    c7="نمیخوااام🥺🥺"; 
                    c8="باشه🤕🤕"; 
                    var bank = [c1,c2,c3,c4,c5,c6,c7,c8,]; 
                    var num = Math.floor(Math.random() * 8); 
                    var ANS = bank[num]; 
                    return ANS; 
                } 
            }
            
        d1="ببند"; 
        var bank = [d1,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="خدت ببند"; 
                c2="نمیخواام ببندم"; 
                c3="نمیخواااام"; 
                c4="😂😂😂😂😂😂"; 
                c5="😂😂😂😂بسته نمیشه😂😂😂😂"; 
                c6="باشه😔"; 
                c7="نمیخوامم🤤"; 
                c8="ب ت چ بزقاله😐🤣"; 
                c9="دهنه خدمه نمخاااام🥺😔"; 
                c10="ععع نمیخوام ببندم گوساله"; 
                c11="ددددوس ندارم ببندم😂💋"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,]; 
                var num = Math.floor(Math.random() * 11); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
  
    d1="قلبم"; 
    d2="گلبم"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="آخ گلبش🙁"; 
            c2="آخ قلبش😂😐"; 
            c3="الاییی گلبشوو🙁😔😂"; 
            c4="گلبش 🙁😂"; 
            c5="اوخی گلبت؟🙁"; 
            c6="گلبت !!؟"; 
            c7="گلبت!؟"; 
            c8="قلبت؟!🤕"; 
            c9="گلبت😳؟"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,]; 
            var num = Math.floor(Math.random() * 9); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }


    d1="صیک"; 
    d2="سیک"; 
    var bank = [d1,d2,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="خدت بصیک لجن"; 
             c2="خدت گمشو کثافت"; 
             c3="خدت گمشو کثافت"; 
             c4="عوضی میزنمتا"; 
             c5="نامرد🥺🙁"; 
             c6="خیلی بی شعوری اشغال گوه تپه 🤕"; 
             c7="مح اصن باهات نمیحرفم🙁"; 
             c8="مح بات گهلم نامرد 😕"; 
             c9="صیک واقعا؟!🙁"; 
             c10="صیککک؟!🥺"; 
             c11="سیک چرا!😔"; 
             c12="واقعا بصیکم؟😕🙁"; 
             c13="عا بصیکم ناموسا؟"; 
             c14="مح بلم میمیلما°°🥺😔"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,]; 
           var num = Math.floor(Math.random() * 14); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
  
    d1="گاو"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="گاو خدتی💩"; 
            c2="گاو عمته😂😍"; 
            c3="گاو خدتی😭😐🤣"; 
            c4="گاو گاو گاو تویی"; 
            c5="گاو بودن ینی تو اصن:)😔😍😭"; 
            c6="گگگاو ک تو بودی و خرم ممد😂😐"; 
            c7="گاو تویی و مدی خره بود ک💋😍😔"; 
            c8="گاو منم؟😕"; 
            c9="گاو دوس دارم 😭🤣"; 
            c10="گاو پرستم های های خیلی ملوسم آی آی😐😂💋"; 
            c11="گااااو دوج ندالم"; 
            c12="گاو نمیخوااام🙁💋😂اصن گاو تویی"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,]; 
            var num = Math.floor(Math.random() * 12); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
    
  
  
    d1="خر"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="خر خودتی"; 
            c2="خر عمته"; 
            c3="خر خالته"; 
            c4="خر خدتی"; 
            c5="خر عمته🥺😭"; 
            c6="خر خودتی گوسفند.. میزنم صدا بز بدیااا😔"; 
            c7=" خر خودتی گاو.. میزنم صدا میمون بدیااا😂💩"; 
            c8="خر خودتی گاو.. میزنم صدا میمون بدیااا😂🤣🥺😭"; 
            c9="خررررر خدتی😐🤣"; 
            c10="خررر عمممته😔😂"; 
            c11="اصن خر بودن ینی توع"; 
            c12="قاعدتا خر بودن برابری میکنه با تو🤣😍😔😂"; 
            c13="خر بعلاوه تو میشه خرا😂😔"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,]; 
            var num = Math.floor(Math.random() * 13); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }

  
  
        d1="عجب"; 
        var bank = [d1,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="رجب"; 
                c2="مش رجب"; 
                c3="ماه رجب"; 
                c4="رجب😳💩😂"; 
                c5="مش رجب😭"; 
                c6="مش رجب🚶♀"; 
                c7="مش رجب!🤣"; 
                c8="ماه رجب😂😅"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,]; 
                var num = Math.floor(Math.random() * 8); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
  

        d1="خعلی"; 
        d2="خیلی"; 
        var bank = [d1,d2,]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="خییلی😐🤤"; 
                c2="خیلیااا"; 
                c3="خیلی😔"; 
                c4="خعلی😂💋"; 
                c5="عا خعلی دا😂💋"; 
                c6="خعععلی🥺🤣❤😂💋"; 
                var bank = [c1,c2,c3,c4,c5,c6,]; 
                var num = Math.floor(Math.random() * 6); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }
  
        d1="تو"; 
        d2="ط"; 
        var bank = [d1,d2,]; 
        for(var i = 0;i < bank.length;i++){ 
             var an = search(value , bank[i]); 
             if(an){ 
                 c1="تو ن شما"; 
                 c2="ط ن شما"; 
                 c3="تو ن شما😔"; 
                 c4="تو نع شماا😂🥺"; 
                 c5="تو نعع شما💋🥺"; 
                 c6="تو ن شما 😕"; 
                 c7="تو ن شما😒"; 
                 var bank = [c1,c2,c3,c4,c5,c6,c7,]; 
               var num = Math.floor(Math.random() * 7); 
               var ANS = bank[num]; 
               return ANS; 
            } 
        }
        

    d1="علی"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="اقاییمو میگی🥺"; 
            c2="🥺علی جونو میگی؟"; 
            c3="علییی؟"; 
            c4="جوون علی"; 
            c5="ع علیهههه"; 
            c6="علی خیلی خری😭"; 
            c7="علی ؟!"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,]; 
            var num = Math.floor(Math.random() * 7); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }

    
    d1 ="ارع";
    d2 ="اره";
    d3 ="ار";
    var bank = [d1,d2,d3];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="باشه😂";
            c2 ="اره زهر مار🤣";
            c3 ="ارع ارع و زهر مار😐💔";
            c4 ="خب ب عنم😂😐";
            c5 ="باشه باشه😂😐";
            c6 ="ب عنم";
            c7 ="خب ب عن سگم😐😂";
            var bank = [c1,c2,c3,c4,c5,c6,c7];
            var num = Math.floor(Math.random() * 7);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 ="نع";
    d2 ="نه";
    d3 ="ناح";
    var bank = [d1,d2,d3];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="نه نه  نکن😕";
            c2 ="نه نه نکن دیگه🥺";
            c3 ="نع نع و زهر مار😐💔";
            c4 ="نع ؟ همین؟🥺";
            c5 ="عنم";
            c6 ="ب عن سگم😐😂";
            c7 ="باشه😂";
            c8 ="خب چی کنم الان من؟";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
            var num = Math.floor(Math.random() * 8);
            var ANS = bank[num];
            return ANS;
        }
    }

    d1 =":joy:";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="جون ط فقط بخند";
            c2 ="دندوناشوو😔چقد سفیده \n\ دیگه کجاهات سفیده؟ ";
            c3 ="😘🤣😂";
            c4 ="ط بخند جانم ک خنده‌ات .... یادم رفت😐";
            c5 ="😘🤣😂";
            c6 ="😅😅😂";
            c7 ="😘🤣😂";
            c8 ="🤣🤣";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8];
            var num = Math.floor(Math.random() * 8);
            var ANS = bank[num];
            return ANS;
        }
    }
    d1 =":neutral_face:";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1="😐"; 
            c2="😐زرشک😐"; 
            c3="😐😐جونز"; 
            c4="😐😂"; 
            c5="💔😐"; 
            c6="جون چ لبی"; 
            c7="چته😐"; 
            c8="چیهه؟😐"; 
            c9="هاا😐"; 
            c10="😐💩"; 
            c11="😐😐پوف"; 
            c12="😂😂😔"; 
            c13="😕😐"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,]; 
            var num = Math.floor(Math.random() * 13); 
            var ANS = bank[num];
            return ANS;
        }
    }
  
    d1=":kissing_heart:"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
        var an = search(value , bank[i]); 
        if(an){ 
            c1="😘😘😘"; 
            c2="😗😘😗😘"; 
            c3="اشقمی😚☺😗😘"; 
            c4="جوون😘😗😘"; 
            c5="فدات شم😘😗😘"; 
            c6="جون"; 
            c7="دوستت دارم"; 
            c8="میمیرم برات"; 
            c9="یدونه ای"; 
            c10="فدات شم:)"; 
            c11="😘😗"; 
            c12="😉😗😘🚶♂"; 
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,]; 
            var num = Math.floor(Math.random() * 12); 
            var ANS = bank[num]; 
            return ANS; 
        } 
    }
  

  

  
  
  
    d1=":hankey:"; 
    var bank = [d1,]; 
    for(var i = 0;i < bank.length;i++){ 
         var an = search(value , bank[i]); 
         if(an){ 
             c1="توع دهنت🥺"; 
             c2="بخورش😂"; 
             c3="رباتم میرینه؟🥺"; 
             c4="ریدن 🤣 مح برقیم😔"; 
             c5="غذات سرد نشه‼🤣"; 
             c6="واس ناهارت بود؟😕"; 
             c7="💩💩"; 
             c8="💩🤣😕"; 
             c9="💩💩💩💩"; 
             c10="💩😕🤣‼"; 
             c11="رباتم میرینه؟؟😑"; 
             c12="توع دهنت"; 
             c13="عاا همون عن در جا توع حلقت😔🥺😂"; 
             c14="گوه گوه گوه"; 
             c15="میشه منم برینم🤕"; 
             c16="نمیشه منم ریدنو ی بار تجربه کنم🥺😂"; 
             c17="منم میخوام ریدنو تجربه کنم😭😥🥺😂"; 
             var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,]; 
           var num = Math.floor(Math.random() * 17); 
           var ANS = bank[num]; 
           return ANS; 
        } 
    }
        d1=":walking:";
        var bank = [d1]; 
        for(var i = 0;i < bank.length;i++){ 
            var an = search(value , bank[i]); 
            if(an){ 
                c1="کجا میریااا"; 
                c2="کجا ب این زودی🚶"; 
                c3="🚶♀🚶♀"; 
                c4="هی🚶♂"; 
                c5="هوف🚶♀"; 
                c6="❤🩹🚶♂"; 
                c7="بی حوصله ای؟"; 
                c8="خسته ای؟"; 
                c9="حال نداری؟🚶♀"; 
                c10="چی شده خسته ای🚶♂🚶♂"; 
                c11="بی حالی امروز🚶♂💔"; 
                var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,]; 
                var num = Math.floor(Math.random() * 11); 
                var ANS = bank[num]; 
                return ANS; 
            } 
        }

  



    d1 = "گوگولی";
    var bank = [d1];
    for(var i = 0;i < bank.length;i++){
        var an = search(value , bank[i]);
        if(an){
            c1 ="جااانم😍😍😍";
            c2 ="😍😍جانم";
            c3 ="عشقم 😍";
            c4 ="چیه؟؟";
            c5 ="ها";
            c6 ="بله";
            c7 ="جان";
            c8 ="اوم اینجام";
            c9 ="جوننن";
            c10 ="✋";
            c11 ="فدات جانم";
            c12 ="بوس بهت";
            c13 ="به به";
            c14 ="به به😂😂";
            c15 ="چطوری خوشگله";
            c16 ="خوبی";
            c17 ="چطوری جیگر";
            c18 ="چطوری 😍";
            c19 ="به به خبی";
            c20 ="چطوری";
            c21 ="😂✋";
            c22 ="🤣✋";
            var bank = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22];
            var num = Math.floor(Math.random() * 22);
            var ANS = bank[num];
            return ANS;
        }
    }
         d1 ="نریپ حست نی ";
         d2 ="یکی حرفای اینو برام ترجمه کنه🙄😐☝";
         d3 ="گوه نخور";
         d4 ="ممدم همینو میگفت جناب";
         d5 ="حق باتوعه";
         d6 ="ببند";
         d7 ="باشعع:/";
         d8 ="نمیفهممممم😭 ";
         d9 =" :/ ";
         d10 ="No information 😆🤣 \n\ کیر شد🤣";
         d11 ="بهت نمیگم ک رباتم و نميفهمم چی میگی😉😐✋";
         d12 ="No information 😆🤣 \n\ کیر شد🤣";
         d13 ="No information 😆🤣 \n\ کیر شد🤣";
         d14 =" نمی فهممت  ";
         d15 ="ببند لطفا😐🙌 ";
         d16 ="چقد این شبیه ادماس🙄";
         d17 ="ینی این ادمه🙄";
         d18 ="حیف خری و من با خرا نمی حرفم 😐✌😂";
         d19 ="یکی حرفای اینو برام ترجمه کنه🙄😐☝";
         d20 ="نميفهمم چی میگی🥺";
         d21 ="نمیفهممممم😭";
         d22 ="الان باید چی بگم😐";
        var bank = [d1,d2,d3,d4,d5,d6,d7,d8,d9,d10,d11,d12,d13,d14,d15,d16,d17,d18,d19,d20,d21,d22];
        var num = Math.floor(Math.random() * 22);
        var ANS = bank[num];
        return ANS;
}

function search(value , sh){
    if(value == null){
        return false;
    }
    var result = value.search(sh);
    if(result !== -1){
        return true;
    }
    return false;
}

